// AnimBlueprintGeneratedClass ABP_Hunter85_CW_Magazin.ABP_Hunter85_CW_Magazin_C
// Size: 0xf48 (Inherited: 0x2e0)
struct UABP_Hunter85_CW_Magazin_C : UWeaponAttachmentMagazineAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2e8(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x318(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x360(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x3a8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x3f0(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x438(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x4e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x510(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x538(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x560(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x600(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x6b0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x6f8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x740(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x788(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x7b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7d8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x800(0x158)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x958(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x9f8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xa78(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xb28(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xba8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xc28(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xca8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xd28(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xdc8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xe48(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xec8(0x80)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Hunter85_CW_Magazin.ABP_Hunter85_CW_Magazin_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_Hunter85_CW_Magazin(int32_t EntryPoint); // Function ABP_Hunter85_CW_Magazin.ABP_Hunter85_CW_Magazin_C.ExecuteUbergraph_ABP_Hunter85_CW_Magazin // (Final|UbergraphFunction) // @ game+0x297fc00
};

