// AnimBlueprintGeneratedClass ABP_Sentry2.ABP_Sentry2_C
// Size: 0x1dfc (Inherited: 0x400)
struct UABP_Sentry2_C : USentryAnimInstance2 {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x400(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x408(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x438(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4d8(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x4f8(0x158)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x650(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x670(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x6f0(0x28)
	char pad_718[0x8]; // 0x718(0x08)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0x720(0x1b0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x8d0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x8f8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xa50(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xa78(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xac0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xb08(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xbc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xbf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xc18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xc40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xc68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xc90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xcb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xce0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xd08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xd30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xd58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xd80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xda8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xdd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xdf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xe20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xe48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xe70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xe98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xec0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xee8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xf10(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xf38(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xfb8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xfe8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1068(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1098(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1138(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x11b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1238(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1268(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x12e8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1318(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1348(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1378(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x13f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1428(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x14a8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x14d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1558(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1588(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x15b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x15e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1660(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x1690(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x16e0(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x1730(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x17f8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x18c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1940(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1970(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1a20(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1ae0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1c38(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1d90(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1db8(0x28)
	struct FRandomStream RandomStream; // 0x1de0(0x08)
	struct ASentry2* Sentry; // 0x1de8(0x08)
	struct FVector CurrentLongRangeGunLookAtLocation; // 0x1df0(0x0c)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Sentry2.ABP_Sentry2_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_BlendListByBool_208246EF4323739C85D425BDCBA50869(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_BlendListByBool_208246EF4323739C85D425BDCBA50869 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequenceEvaluator_CCD8193848346E0ED33DFBAB866B90E3(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequenceEvaluator_CCD8193848346E0ED33DFBAB866B90E3 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequenceEvaluator_D2EE5CF5432596CA50BFBE8C891CE3A3(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequenceEvaluator_D2EE5CF5432596CA50BFBE8C891CE3A3 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TwoWayBlend_55574D7242592FFEC622D7B8868A427D(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TwoWayBlend_55574D7242592FFEC622D7B8868A427D // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TwoWayBlend_869C828542A14B7F7C605F852309CFAE(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TwoWayBlend_869C828542A14B7F7C605F852309CFAE // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequencePlayer_4A14EDD746445E0DE89C16A093C86EA2(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequencePlayer_4A14EDD746445E0DE89C16A093C86EA2 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequencePlayer_73D6E97F4EEF2308D5828C9B91EB50F9(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequencePlayer_73D6E97F4EEF2308D5828C9B91EB50F9 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequencePlayer_385B18A746FC866F7EB55F938A95891F(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_SequencePlayer_385B18A746FC866F7EB55F938A95891F // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_B29D09F8489CFD6CA7749091A2604A42(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_B29D09F8489CFD6CA7749091A2604A42 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_944A5DA54F54196AEAE93F88BFB1EF14(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_944A5DA54F54196AEAE93F88BFB1EF14 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_AEC626A94F6637BC4069D9981C366D5F(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_AEC626A94F6637BC4069D9981C366D5F // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_6B09E3124CC9A3CA5899EFA8981A8621(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_6B09E3124CC9A3CA5899EFA8981A8621 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_C761A8F9493DFE2A44A26B93DCFD7C30(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_C761A8F9493DFE2A44A26B93DCFD7C30 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_F0B5E32D4C391909DB9368AD300A421E(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_F0B5E32D4C391909DB9368AD300A421E // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_7463910F4F208D2F457B59B562A2B879(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_7463910F4F208D2F457B59B562A2B879 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_960260FF4616C6E2FB41FEBE51E6A4CA(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_960260FF4616C6E2FB41FEBE51E6A4CA // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_263C0F804C74391E67C66F8BE26FCC95(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_263C0F804C74391E67C66F8BE26FCC95 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_A5A9B0804CCDD8F781A0EBA217C90AD9(); // Function ABP_Sentry2.ABP_Sentry2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sentry2_AnimGraphNode_TransitionResult_A5A9B0804CCDD8F781A0EBA217C90AD9 // (BlueprintEvent) // @ game+0x297fc00
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Sentry2.ABP_Sentry2_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x297fc00
	void BlueprintInitializeAnimation(); // Function ABP_Sentry2.ABP_Sentry2_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_Sentry2(int32_t EntryPoint); // Function ABP_Sentry2.ABP_Sentry2_C.ExecuteUbergraph_ABP_Sentry2 // (Final|UbergraphFunction) // @ game+0x297fc00
};

