// AnimBlueprintGeneratedClass ABP_ArmedNPCBase.ABP_ArmedNPCBase_C
// Size: 0xae29 (Inherited: 0x510)
struct UABP_ArmedNPCBase_C : UArmedNPCBaseAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x510(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x518(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x548(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x570(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x598(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x5c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x5e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x610(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x638(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x660(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x688(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x6b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x6d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x700(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x728(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x778(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x7a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x7c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x7f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x818(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x840(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x868(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x890(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0x8b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0x958(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0x9d8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0xa58(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0xaf8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0xb78(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0xbf8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0xc98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0xd18(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0xd98(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0xe38(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0xeb8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0xf38(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0xfe8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x1088(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x1108(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x1188(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x1228(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x12a8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x1328(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x13c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x1448(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x14c8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x1568(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x15e8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0x1668(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x1718(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x17b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x1838(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x18b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x1958(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x19d8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x1a58(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x1af8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x1b78(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x1bf8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x1c98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x1d18(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0x1d98(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x1e48(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x1ee8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x1f98(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x2038(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x20b8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x2138(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x21d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x2258(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x22d8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x2378(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x23f8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x2478(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x2518(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x2598(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x2618(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x26c8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x26f8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x27e0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x28c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x2948(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x29c8(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_24; // 0x2ab0(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_23; // 0x2b78(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x2c40(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x2d28(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x2da8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x2e28(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_22; // 0x2f10(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_21; // 0x2fd8(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x30a0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x3150(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x3180(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x3268(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x3350(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x3438(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x34e8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x3518(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x35b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x3638(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x36b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x3758(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x37d8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x3858(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x38f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x3978(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x39f8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x3a98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x3b18(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0x3b98(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x3c48(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x3ce8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x3d68(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x3de8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x3e88(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x3f08(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x3f88(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x4028(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x40a8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x4128(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x41c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x4248(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x42c8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x4378(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x4418(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x4498(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x4518(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x45b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x4638(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x46b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x4758(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x47d8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x4858(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x48f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x4978(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x49f8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x4aa8(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x4b48(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x4bf8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x4c98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x4d18(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x4d98(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x4e38(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x4eb8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x4f38(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x4fd8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x5058(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x50d8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x5178(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x51f8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x5278(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x5328(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x5358(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x5408(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x54f0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x5590(0xe8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x5678(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x56a0(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x5760(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x5848(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x5930(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x59d0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x5ab8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x5ba0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x5c20(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x5ca0(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_20; // 0x5d88(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_19; // 0x5e50(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x5f18(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x5f98(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x6018(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18; // 0x6100(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17; // 0x61c8(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x6290(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x62c0(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x6370(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x6398(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x6480(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x6540(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x65e0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x66c8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x67b0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6898(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x6980(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x69b0(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x69f8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x6aa8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x6ad0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x6af8(0xc0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x6bb8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x6c08(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16; // 0x6c58(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x6d20(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x6de8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x6e68(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x6f28(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x6ff0(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x70b8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x7108(0x50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x7158(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x71d8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x72a0(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x7368(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x73b8(0x50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x7408(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x7488(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x7528(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x7578(0x50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x75c8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x7648(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x7708(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x77c8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x7890(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x7958(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x79a8(0x50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x79f8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x7a78(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x7b40(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x7c08(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x7c58(0x50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x7ca8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x7d28(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x7df0(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x7eb8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x7f08(0x50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x7f58(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x7fd8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x80a0(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x8168(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x81b8(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8208(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8238(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x82e8(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x8440(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x8488(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x84d0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x8518(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x8560(0x158)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x86b8(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x87c0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x87e8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x88a8(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x88d0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x8998(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x89c0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x8a08(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x8b60(0x158)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x8cb8(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x8e48(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x8e70(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x9000(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x9028(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x9050(0x190)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x91e0(0xb0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x9290(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x9420(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x9448(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x95a0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x95c8(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x9668(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x9688(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x96a8(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x96d0(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x9798(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x9848(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x98c8(0xa0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_4; // 0x9968(0x18)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x9980(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x9a00(0xa0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_3; // 0x9aa0(0x18)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x9ab8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x9c10(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x9c38(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x9d00(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x9db0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x9e30(0xa0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_2; // 0x9ed0(0x18)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x9ee8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x9f68(0xa0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0xa008(0x18)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xa020(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xa178(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xa2d0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xa370(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xa398(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xa4f0(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xa5a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xa5c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xa5f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xa618(0x28)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0xa640(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xa7d0(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xa850(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xa9a8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xa9d0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xaa70(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xaa98(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xab38(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xabb8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xac80(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xad00(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xada0(0x80)
	struct AArmedNPCBase* ArmedNPCBase; // 0xae20(0x08)
	bool bShouldSkipStandWalkOrJogOrRunStart; // 0xae28(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_ArmedNPCBase.ABP_ArmedNPCBase_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void ShouldSkipStandWalkOrJogOrRunStart(bool& Result); // Function ABP_ArmedNPCBase.ABP_ArmedNPCBase_C.ShouldSkipStandWalkOrJogOrRunStart // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ArmedNPCBase_AnimGraphNode_TransitionResult_B2D0ADF04EA246D430F9AFBFA0A5BAF5(); // Function ABP_ArmedNPCBase.ABP_ArmedNPCBase_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ArmedNPCBase_AnimGraphNode_TransitionResult_B2D0ADF04EA246D430F9AFBFA0A5BAF5 // (BlueprintEvent) // @ game+0x297fc00
