// AnimBlueprintGeneratedClass ABP_Tractor_Dashboard.ABP_Tractor_Dashboard_C
// Size: 0x764 (Inherited: 0x2e0)
struct UABP_Tractor_Dashboard_C : UVehicleAttachmentDashboardAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e0(0x08)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2e8(0x20)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x308(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x338(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x440(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x548(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x650(0x108)
	struct FRotator Rotation; // 0x758(0x0c)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Tractor_Dashboard.ABP_Tractor_Dashboard_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Tractor_Dashboard_AnimGraphNode_ModifyBone_98C0444242B56C2102A2909D0D01FE67(); // Function ABP_Tractor_Dashboard.ABP_Tractor_Dashboard_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Tractor_Dashboard_AnimGraphNode_ModifyBone_98C0444242B56C2102A2909D0D01FE67 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Tractor_Dashboard_AnimGraphNode_ModifyBone_442BBD1545AA9467353206A260BD0C36(); // Function ABP_Tractor_Dashboard.ABP_Tractor_Dashboard_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Tractor_Dashboard_AnimGraphNode_ModifyBone_442BBD1545AA9467353206A260BD0C36 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Tractor_Dashboard_AnimGraphNode_ModifyBone_B25A35A541FB1883F234DCB91BDEBA41(); // Function ABP_Tractor_Dashboard.ABP_Tractor_Dashboard_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Tractor_Dashboard_AnimGraphNode_ModifyBone_B25A35A541FB1883F234DCB91BDEBA41 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Tractor_Dashboard_AnimGraphNode_ModifyBone_E97EEB46418D54E6CA3E479A2164EC10(); // Function ABP_Tractor_Dashboard.ABP_Tractor_Dashboard_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Tractor_Dashboard_AnimGraphNode_ModifyBone_E97EEB46418D54E6CA3E479A2164EC10 // (BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_Tractor_Dashboard(int32_t EntryPoint); // Function ABP_Tractor_Dashboard.ABP_Tractor_Dashboard_C.ExecuteUbergraph_ABP_Tractor_Dashboard // (Final|UbergraphFunction) // @ game+0x297fc00
};

