// AnimBlueprintGeneratedClass ABP_GreatWhiteShark.ABP_GreatWhiteShark_C
// Size: 0x1174 (Inherited: 0x360)
struct UABP_GreatWhiteShark_C : USharkAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x360(0x08)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x368(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x400(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x428(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x450(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x478(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x560(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x590(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x610(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x640(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x728(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x758(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x840(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x870(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x920(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xa78(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xaa0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xbf8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xd50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xd78(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xda0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xdc8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xe88(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xfe0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1008(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1030(0x48)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1078(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x10a8(0xc8)
	float MinAngularVelocity; // 0x1170(0x04)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_GreatWhiteShark.ABP_GreatWhiteShark_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_BlendSpacePlayer_374FB1814F4BFCCF20ECF9AA2D741B46(); // Function ABP_GreatWhiteShark.ABP_GreatWhiteShark_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_BlendSpacePlayer_374FB1814F4BFCCF20ECF9AA2D741B46 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_TransitionResult_0497584D4A859F8AA863C391422E2512(); // Function ABP_GreatWhiteShark.ABP_GreatWhiteShark_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_TransitionResult_0497584D4A859F8AA863C391422E2512 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_BlendSpacePlayer_F073CE6644E3BB1C09DDBE8B6B8A6458(); // Function ABP_GreatWhiteShark.ABP_GreatWhiteShark_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_BlendSpacePlayer_F073CE6644E3BB1C09DDBE8B6B8A6458 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_TransitionResult_996C19444D8FB59E30D5B19006DC8B49(); // Function ABP_GreatWhiteShark.ABP_GreatWhiteShark_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_TransitionResult_996C19444D8FB59E30D5B19006DC8B49 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_TransitionResult_2C91480E4B86C533336A349A2758C1F8(); // Function ABP_GreatWhiteShark.ABP_GreatWhiteShark_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_TransitionResult_2C91480E4B86C533336A349A2758C1F8 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_TransitionResult_D276C94645E58FAC63783284F7182D39(); // Function ABP_GreatWhiteShark.ABP_GreatWhiteShark_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GreatWhiteShark_AnimGraphNode_TransitionResult_D276C94645E58FAC63783284F7182D39 // (BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_GreatWhiteShark(int32_t EntryPoint); // Function ABP_GreatWhiteShark.ABP_GreatWhiteShark_C.ExecuteUbergraph_ABP_GreatWhiteShark // (Final|UbergraphFunction) // @ game+0x297fc00
};

