// AnimBlueprintGeneratedClass ABP_M1911_Magazine.ABP_M1911_Magazine_C
// Size: 0xc18 (Inherited: 0x2e0)
struct UABP_M1911_Magazine_C : UWeaponAttachmentMagazineAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2e8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x318(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x398(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x3e0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x428(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x470(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x4b8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x568(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x590(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x5b8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x5e0(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x680(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x730(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x778(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x7c0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x808(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x830(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x858(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x880(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x9d8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xa78(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xaf8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb98(0x80)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_M1911_Magazine.ABP_M1911_Magazine_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_M1911_Magazine(int32_t EntryPoint); // Function ABP_M1911_Magazine.ABP_M1911_Magazine_C.ExecuteUbergraph_ABP_M1911_Magazine // (Final|UbergraphFunction) // @ game+0x297fc00
};

