// AnimBlueprintGeneratedClass AnimBP_Eder22.AnimBP_Eder22_C
// Size: 0xdf8 (Inherited: 0x310)
struct UAnimBP_Eder22_C : UWeaponAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x318(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x348(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x390(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x3d8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x420(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x468(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x518(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x540(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x568(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x590(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x630(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x6e0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x728(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x770(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x7b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x7e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x808(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x830(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x988(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xa08(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xaa8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xb58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xbd8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xc58(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xcd8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xd78(0x80)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function AnimBP_Eder22.AnimBP_Eder22_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_AnimBP_Eder22(int32_t EntryPoint); // Function AnimBP_Eder22.AnimBP_Eder22_C.ExecuteUbergraph_AnimBP_Eder22 // (Final|UbergraphFunction) // @ game+0x297fc00
};

