// BlueprintGeneratedClass BP_CB_Warehouse_E_INT.BP_CB_Warehouse_E_INT_C
// Size: 0x298 (Inherited: 0x220)
struct ABP_CB_Warehouse_E_INT_C : AActor {
	struct UInstancedStaticMeshComponent* InstancedStaticMesh; // 0x220(0x08)
	struct UItemSpawnerComponent* ItemSpawner; // 0x228(0x08)
	struct USceneComponent* Utilities; // 0x230(0x08)
	struct UStaticMeshComponent* SM_WorkLadder_01_StaticMeshComponent0; // 0x238(0x08)
	struct UStaticMeshComponent* SM_WoodenLogsCutPile_04_StaticMeshComponent0; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Wooden_Crate_MERGED_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_PlywoodTable_01a_StaticMeshComponent0; // 0x250(0x08)
	struct UInstancedStaticMeshComponent* SM_Plywood_Board_01 (ISMA)_InstancedStaticMesh; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Mattress_02_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Haystack_5pcs_01_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Haystack_4_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Haystack_03_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Crate_3_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Haystack_4PCs_01_StaticMeshComponent0; // 0x288(0x08)
	struct USceneComponent* Scene; // 0x290(0x08)
};

