// BlueprintGeneratedClass BP_Farm_Model_01.BP_Farm_Model_01_C
// Size: 0x588 (Inherited: 0x4c8)
struct ABP_Farm_Model_01_C : ABuilding {
	struct UChildActorComponent* BP_Debris_Tire_Stack_02_NoSmoke; // 0x4c8(0x08)
	struct UItemSpawnerComponent* ItemSpawner; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_Farm_Model_WM; // 0x4d8(0x08)
	struct UWeatherMaskComponent_C* WeatherMaskComponent; // 0x4e0(0x08)
	struct USceneComponent* UTILS; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_Barrel_01; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_Trash_Set_02a; // 0x4f8(0x08)
	struct UInstancedStaticMeshComponent* SM_Trash_Set_02a (ISMA); // 0x500(0x08)
	struct UInstancedStaticMeshComponent* SM_Haystack_3pcs_01 (ISMA)_02; // 0x508(0x08)
	struct UInstancedStaticMeshComponent* SM_Haystack_3pcs_01 (ISMA)_01; // 0x510(0x08)
	struct UInstancedStaticMeshComponent* SM_Haystack_02 (ISMA); // 0x518(0x08)
	struct UInstancedStaticMeshComponent* SM_Crate_02_Box_A (ISMA); // 0x520(0x08)
	struct UInstancedStaticMeshComponent* SM_Cardboard_Box_05_Empty (ISMA); // 0x528(0x08)
	struct UInstancedStaticMeshComponent* SM_barrel_01 (ISMA); // 0x530(0x08)
	struct USceneComponent* ISMA; // 0x538(0x08)
	struct UStaticMeshComponent* SM_Wood_Pallet_01a; // 0x540(0x08)
	struct UStaticMeshComponent* SM_School_Desk3; // 0x548(0x08)
	struct UStaticMeshComponent* SM_MatressVariation1; // 0x550(0x08)
	struct UStaticMeshComponent* SM_Crate_02_Box; // 0x558(0x08)
	struct UStaticMeshComponent* SM_calendar_01; // 0x560(0x08)
	struct USceneComponent* Stuff; // 0x568(0x08)
	struct UStaticMeshComponent* SM_Farm_Model_01; // 0x570(0x08)
	struct USceneComponent* Building; // 0x578(0x08)
	struct USceneComponent* Scene; // 0x580(0x08)
};

