// BlueprintGeneratedClass BP_Garage_02_B_RW_Int_03.BP_Garage_02_B_RW_Int_03_C
// Size: 0x288 (Inherited: 0x220)
struct ABP_Garage_02_B_RW_Int_03_C : AActor {
	struct UStaticMeshComponent* StaticMesh12; // 0x220(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x228(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x230(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x238(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Barrel_01c; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CardboardBox_02a; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Storage_Shelves_01; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Dumpster_Yellow_open; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Barrel_01; // 0x268(0x08)
	struct UItemSpawnerComponent* ItemSpawner; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x278(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x280(0x08)
};

