// BlueprintGeneratedClass BPC_RIS.BPC_RIS_C
// Size: 0x1650 (Inherited: 0x15b0)
struct ABPC_RIS_C : ABP_WheeledVehicle4W_C {
	struct UBoxComponent* DamageRegion_BumperBack; // 0x15b0(0x08)
	struct UBoxComponent* DamageRegion_CenterBack; // 0x15b8(0x08)
	struct UBoxComponent* DamageRegion_BumperFront; // 0x15c0(0x08)
	struct UBoxComponent* DamageRegion_CenterFront; // 0x15c8(0x08)
	struct UBoxComponent* DamageRegion_SideBackRight; // 0x15d0(0x08)
	struct UBoxComponent* DamageRegion_SideBackLeft; // 0x15d8(0x08)
	struct UBoxComponent* DamageRegion_CenterTop; // 0x15e0(0x08)
	struct UCapsuleComponent* DamageRegion_WheelBackRight; // 0x15e8(0x08)
	struct UCapsuleComponent* DamageRegion_WheelBackLeft; // 0x15f0(0x08)
	struct UCapsuleComponent* DamageRegion_WheelFrontRight; // 0x15f8(0x08)
	struct UCapsuleComponent* DamageRegion_WheelFrontLeft; // 0x1600(0x08)
	struct UBoxComponent* DamageRegion_SideFrontRight; // 0x1608(0x08)
	struct UBoxComponent* DamageRegion_SideFrontLeft; // 0x1610(0x08)
	struct UVehicleCameraComponent* VehicleCamera; // 0x1618(0x08)
	struct USpotLightComponent* RHeadlight; // 0x1620(0x08)
	struct USpotLightComponent* RReverseLight; // 0x1628(0x08)
	struct USpotLightComponent* RBrakeLight; // 0x1630(0x08)
	struct USpotLightComponent* LBrakeLight; // 0x1638(0x08)
	struct USpotLightComponent* LHeadlight; // 0x1640(0x08)
	struct USpotLightComponent* LReverseLight; // 0x1648(0x08)
};

