// Class ConZ.AbandonedBunkerConnectionSetup
// Size: 0x40 (Inherited: 0x30)
struct UAbandonedBunkerConnectionSetup : UDataAsset {
	struct TArray<struct FAbandonedBunkerConnectionBinding> Bindings; // 0x30(0x10)
};

// Class ConZ.ExamineMeshNotify
// Size: 0x28 (Inherited: 0x28)
struct UExamineMeshNotify : UObject {
};

// Class ConZ.ExamineMeshNotify_BoundToAbandonedBunkerActivation
// Size: 0x28 (Inherited: 0x28)
struct UExamineMeshNotify_BoundToAbandonedBunkerActivation : UExamineMeshNotify {
};

// Class ConZ.AbandonedBunker
// Size: 0x570 (Inherited: 0x220)
struct AAbandonedBunker : AActor {
	char pad_220[0xe8]; // 0x220(0xe8)
	struct UBillboardComponent* _sprite; // 0x308(0x08)
	bool _secretBunker; // 0x310(0x01)
	char pad_311[0x3]; // 0x311(0x03)
	float _reducedKeycardDurationSeconds; // 0x314(0x04)
	float _miuntesUntilResetAfterNoPlayersNearby; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct UDoorUnlockData* _masterKeycardUnlockData; // 0x320(0x08)
	struct TArray<struct FAbandonedBunkerFloorSetup> _floorSetup; // 0x328(0x10)
	struct UAbandonedBunkerConnectionSetup* _connectionSetup; // 0x338(0x08)
	struct FGameplayTagContainer _alwaysPoweredRooms; // 0x340(0x20)
	float _alarmDuration; // 0x360(0x04)
	struct TWeakObjectPtr<struct ABuilding> _killboxRoom; // 0x364(0x08)
	struct FGameplayTag _killboxRoomTag; // 0x36c(0x08)
	float _managerDescriptionReplicatedNoiseNormalized; // 0x374(0x04)
	struct TArray<uint16_t> _poweredRoomIds; // 0x378(0x10)
	struct TArray<uint16_t> _alarmedRoomIds; // 0x388(0x10)
	struct TArray<struct FTransform> _knockoutTeleportLocationTransforms; // 0x398(0x10)
	float _prisonerKnockoutDurationOnLock; // 0x3a8(0x04)
	char pad_3AC[0x8c]; // 0x3ac(0x8c)
	struct FActivationReservation _temporaryOverrideActivationReservation; // 0x438(0x18)
	struct FActivationReservation _currentActivationReservation; // 0x450(0x18)
	char pad_468[0x10]; // 0x468(0x10)
	struct UAbandonedBunkerZoneManagerComponent* _abandonedBunkerManagerComponent; // 0x478(0x08)
	struct UNavigationInvokerComponent* _razorNavigationInvokerComponent; // 0x480(0x08)
	char pad_488[0xe8]; // 0x488(0xe8)

	void OnRep_PoweredRoomIds(struct TArray<uint16_t>& oldPoweredRoomIds); // Function ConZ.AbandonedBunker.OnRep_PoweredRoomIds // (Final|Native|Private|HasOutParms) // @ game+0x2330400
	void OnRep_AlarmedRoomIds(struct TArray<uint16_t>& oldAlarmedRoomIds); // Function ConZ.AbandonedBunker.OnRep_AlarmedRoomIds // (Final|Native|Private|HasOutParms) // @ game+0x2330310
	void OnRep_ActivationReservationOverride(); // Function ConZ.AbandonedBunker.OnRep_ActivationReservationOverride // (Final|Native|Private) // @ game+0x23302f0
	void OnRep_ActivationReservation(); // Function ConZ.AbandonedBunker.OnRep_ActivationReservation // (Final|Native|Private) // @ game+0x23302f0
	void NetMulticast_SetPartialOpenRatioDoorComponent(struct UAbandonedBunkerDoorComponent* doorComponent, float Ratio); // Function ConZ.AbandonedBunker.NetMulticast_SetPartialOpenRatioDoorComponent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x2330210
};

// Class ConZ.AbandonedBunkerActivationRegistry
// Size: 0x118 (Inherited: 0xb0)
struct UAbandonedBunkerActivationRegistry : UActorComponent {
	char pad_B0[0x68]; // 0xb0(0x68)
};

// Class ConZ.AbandonedBunkerBCUMemoryModuleTerminal
// Size: 0x278 (Inherited: 0x220)
struct AAbandonedBunkerBCUMemoryModuleTerminal : AActor {
	char pad_220[0x8]; // 0x220(0x08)
	struct UStaticMeshComponent* _mesh; // 0x228(0x08)
	struct UStaticMeshComponent* _progressBarMesh; // 0x230(0x08)
	struct FTimespan _cooldown; // 0x238(0x08)
	struct FDateTime _lastDownloadTime; // 0x240(0x08)
	char pad_248[0x10]; // 0x248(0x10)
	float _downloadActionDuration; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct UAkAudioEvent* _downloadActionStartAudio; // 0x260(0x08)
	struct UAkAudioEvent* _downloadActionStopAudio; // 0x268(0x08)
	char pad_270[0x8]; // 0x270(0x08)

	void OnRep_LastDownloadTime(); // Function ConZ.AbandonedBunkerBCUMemoryModuleTerminal.OnRep_LastDownloadTime // (Final|Native|Private) // @ game+0x23303e0
};

// Class ConZ.AbandonedBunkerDialPad
// Size: 0x2e8 (Inherited: 0x220)
struct AAbandonedBunkerDialPad : AActor {
	char pad_220[0x8]; // 0x220(0x08)
	struct ADialPadMinigame* _minigameClass; // 0x228(0x08)
	struct UDialPadMinigameConfiguration* _minigameConfigurationClass; // 0x230(0x08)
	struct AMinigame* _hackingMinigameClass; // 0x238(0x08)
	struct UMinigameConfiguration* _hackingMinigameConfiguration; // 0x240(0x08)
	struct ADoor* _connectedDoor; // 0x248(0x08)
	struct FLinearColor _lockedColor; // 0x250(0x10)
	struct FLinearColor _unlockedColor; // 0x260(0x10)
	struct FLinearColor _offColor; // 0x270(0x10)
	int32_t _combinationLength; // 0x280(0x04)
	float _minigameBaseDuration; // 0x284(0x04)
	struct TArray<char> _wornButtons; // 0x288(0x10)
	char pad_298[0x50]; // 0x298(0x50)

	void OnRep_WornButtons(); // Function ConZ.AbandonedBunkerDialPad.OnRep_WornButtons // (Final|Native|Private) // @ game+0x23304b0
};

// Class ConZ.AbandonedBunkerDoorComponent
// Size: 0x580 (Inherited: 0x500)
struct UAbandonedBunkerDoorComponent : UStaticMeshComponent {
	struct ADoor* _outerDoor; // 0x500(0x08)
	enum class EDoorOpenMethod _doorOpenMethod; // 0x508(0x01)
	char pad_509[0x3]; // 0x509(0x03)
	int32_t _doorManualOpenMethod; // 0x50c(0x04)
	bool _canAlwaysBeOpenedDuringDay; // 0x510(0x01)
	char pad_511[0x3]; // 0x511(0x03)
	struct FVector _directionTowardsInside; // 0x514(0x0c)
	bool _canAlwaysBeOpenedFromInside; // 0x520(0x01)
	char pad_521[0x3]; // 0x521(0x03)
	struct FGameplayTag _roomId; // 0x524(0x08)
	float _manualOpenActionMovementAcceptanceRadius; // 0x52c(0x04)
	float _manualOpenActionBaseDuration; // 0x530(0x04)
	float _manualOpenDurationReductionPerStrengthPoint; // 0x534(0x04)
	float _manualOpenMinimumDuration; // 0x538(0x04)
	float _forceOpenCrowbarDamage; // 0x53c(0x04)
	float _manualOpenAutoCloseDelay; // 0x540(0x04)
	char pad_544[0x4]; // 0x544(0x04)
	struct AMinigame* _hackingMinigameClass; // 0x548(0x08)
	struct UMinigameConfiguration* _hackingMinigameConfiguration; // 0x550(0x08)
	char pad_558[0x28]; // 0x558(0x28)

	void Door_OnDoorOpened(); // Function ConZ.AbandonedBunkerDoorComponent.Door_OnDoorOpened // (Final|Native|Private) // @ game+0x2330010
};

// Class ConZ.ItemContainer
// Size: 0x330 (Inherited: 0x220)
struct AItemContainer : AActor {
	char pad_220[0x10]; // 0x220(0x10)
	struct USceneComponent* _rootComponent; // 0x230(0x08)
	bool _canBeForceUnlocked; // 0x238(0x01)
	char pad_239[0x3]; // 0x239(0x03)
	float _forceUnlockTime; // 0x23c(0x04)
	float _forceUnlockMovementAcceptanceRadius; // 0x240(0x04)
	char pad_244[0xc]; // 0x244(0x0c)
	struct FUnlockLocation _unlockPositionMarker; // 0x250(0x30)
	char pad_280[0x8]; // 0x280(0x08)
	struct TArray<struct UObject*> _upgradeItemsClasses; // 0x288(0x10)
	struct TArray<struct ULockData*> _lockData; // 0x298(0x10)
	char pad_2A8[0x10]; // 0x2a8(0x10)
	struct TArray<struct UObject*> _originalUpgradeItemClasses; // 0x2b8(0x10)
	struct TArray<struct ULockData*> _originalLockData; // 0x2c8(0x10)
	bool _ignoreServerSettings; // 0x2d8(0x01)
	char pad_2D9[0x28]; // 0x2d9(0x28)
	bool _disableSerialization; // 0x301(0x01)
	char pad_302[0x2]; // 0x302(0x02)
	struct FGameplayTag _famePointAwardTag; // 0x304(0x08)
	char pad_30C[0x24]; // 0x30c(0x24)
};

// Class ConZ.AbandonedBunkerItemContainerBoundToActivation
// Size: 0x340 (Inherited: 0x330)
struct AAbandonedBunkerItemContainerBoundToActivation : AItemContainer {
	char pad_330[0x10]; // 0x330(0x10)
};

// Class ConZ.AbandonedBunkerLightComponent
// Size: 0x170 (Inherited: 0xb0)
struct UAbandonedBunkerLightComponent : UActorComponent {
	enum class EBunkerLightControlType _controlType; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	float _blinkPeriodWhenLowPower; // 0xb4(0x04)
	bool _autoFindLightComponents; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
	struct TArray<struct ULightComponent*> _lightComponents; // 0xc0(0x10)
	char pad_D0[0x10]; // 0xd0(0x10)
	bool _autoFindMeshComponents; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
	struct TArray<struct UStaticMeshComponent*> _meshComponents; // 0xe8(0x10)
	char pad_F8[0x10]; // 0xf8(0x10)
	bool _autoFindParticleComponents; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct TArray<struct UParticleSystemComponent*> _particleComponents; // 0x110(0x10)
	bool _autoFindNiagaraComponents; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct TArray<struct UNiagaraComponent*> _niagaraComponents; // 0x128(0x10)
	bool _autoFindAudioComponents; // 0x138(0x01)
	char pad_139[0x7]; // 0x139(0x07)
	struct TArray<struct UAkComponent*> _audioComponents; // 0x140(0x10)
	struct UAkAudioEvent* _audioEventStart; // 0x150(0x08)
	struct UAkAudioEvent* _audioEventStop; // 0x158(0x08)
	char pad_160[0x10]; // 0x160(0x10)
};

// Class ConZ.LWObjectSetup
// Size: 0x30 (Inherited: 0x28)
struct ULWObjectSetup : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class ConZ.EntitySystemObjectSetup
// Size: 0x40 (Inherited: 0x30)
struct UEntitySystemObjectSetup : ULWObjectSetup {
	bool TickEnabled; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float TickInterval; // 0x34(0x04)
	bool CanEverTickOnServer; // 0x38(0x01)
	bool CanEverTickOnClient; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class ConZ.EntitySetup
// Size: 0x80 (Inherited: 0x40)
struct UEntitySetup : UEntitySystemObjectSetup {
	bool Transient; // 0x40(0x01)
	bool Hidden; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	float BoundsRadius; // 0x44(0x04)
	struct TSoftClassPtr<UObject> Actor; // 0x48(0x28)
	struct TArray<struct FEntitySetup_Component> Components; // 0x70(0x10)
};

// Class ConZ.AbandonedBunkerManagerSetup
// Size: 0x80 (Inherited: 0x80)
struct UAbandonedBunkerManagerSetup : UEntitySetup {
};

// Class ConZ.AbandonedBunkerSwitchboard
// Size: 0x360 (Inherited: 0x220)
struct AAbandonedBunkerSwitchboard : AActor {
	char pad_220[0x50]; // 0x220(0x50)
	struct TArray<enum class ESwitchboardSwitch> _disabledSwitches; // 0x270(0x10)
	struct USwitchboardComponent* _switchboardComponent; // 0x280(0x08)
	struct UGaugeClusterComponent* _gaugeClusterComponent; // 0x288(0x08)
	bool _isMasterSwitchboard; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	float _defaultLoadWhenPowered; // 0x294(0x04)
	float _defaultLoadDuringBlackout; // 0x298(0x04)
	float _fuseHealthLowPowerThreshold; // 0x29c(0x04)
	struct FGameplayTag _defaultFuseGaugeTag; // 0x2a0(0x08)
	struct FGameplayTag _attachedFuseGaugeTag; // 0x2a8(0x08)
	struct FName _fuseAttachmentSocketName; // 0x2b0(0x08)
	struct ASwitchboardMinigame* _masterSwitchboardMinigameClass; // 0x2b8(0x08)
	struct USwitchboardMinigameConfiguration* _masterSwitchboardMinigameConfigurationClass; // 0x2c0(0x08)
	struct ASwitchboardMinigame* _slaveSwitchboardMinigameClass; // 0x2c8(0x08)
	struct USwitchboardMinigameConfiguration* _slaveSwitchboardMinigameConfigurationClass; // 0x2d0(0x08)
	char pad_2D8[0x8]; // 0x2d8(0x08)
	struct FTransform _decalTransform; // 0x2e0(0x30)
	struct UAkAudioEvent* _switchFlippedAudioEvent; // 0x310(0x08)
	struct UAkAudioEvent* _fuseAddedAudioEvent; // 0x318(0x08)
	struct UAkAudioEvent* _fuseBurnedAudioEvent; // 0x320(0x08)
	float _emissiveStrengthWhenPowered; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
	struct AItem* _repAttachedFuseItem; // 0x330(0x08)
	struct AItem* _attachedFuseItem; // 0x338(0x08)
	char pad_340[0x20]; // 0x340(0x20)

	void OnRep_AttachedFuseItem(); // Function ConZ.AbandonedBunkerSwitchboard.OnRep_AttachedFuseItem // (Final|Native|Private) // @ game+0x23303c0
};

// Class ConZ.AbandonedBunkerZoneBoxComponent
// Size: 0x490 (Inherited: 0x480)
struct UAbandonedBunkerZoneBoxComponent : UBoxComponent {
	struct FGameplayTag _roomId; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)
};

// Class ConZ.AbandonedBunkerZoneCommonData
// Size: 0x1b0 (Inherited: 0x30)
struct UAbandonedBunkerZoneCommonData : UDataAsset {
	float NoiseAccumulationLevels[0x3]; // 0x30(0x0c)
	float NoiseAccumulationLevelsExtraPerPlayer[0x3]; // 0x3c(0x0c)
	float NoiseLoudnessThreshold; // 0x48(0x04)
	float AccumulatedNoiseCap; // 0x4c(0x04)
	float RoomAlarmNoiseIncreasePerTick; // 0x50(0x04)
	float RoomAlarmNoiseIncreaseTickRate; // 0x54(0x04)
	struct TMap<struct FName, float> NoiseAccumulationMultiplierPerNoiseTag; // 0x58(0x50)
	float TimeToReleaseExtraResources; // 0xa8(0x04)
	float TimeForNoiseLevelToStartDropping; // 0xac(0x04)
	float TimeForNoiseLevelAfterEnemyActivationToStartDropping; // 0xb0(0x04)
	float NoiseDropRatePerSecond; // 0xb4(0x04)
	float TimeForPlayerNoiseToStartDropping; // 0xb8(0x04)
	float PlayerNoiseDropRatePerSecond; // 0xbc(0x04)
	float BunkerComponentResetTime; // 0xc0(0x04)
	float CommotionEventCooldownMin; // 0xc4(0x04)
	float CommotionEventCooldownMax; // 0xc8(0x04)
	float RazorSpawnPointEnemyActivationDistance; // 0xcc(0x04)
	struct FFloatRange EnemyActivationEventCooldownRange; // 0xd0(0x10)
	struct FFloatRange EnemyActivationEventRespawnCooldownRange; // 0xe0(0x10)
	float TimeAfterReturningFromEnemyActivationStateBeforeSpawnCooldownResets; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct TSoftClassPtr<UObject> RazorClass; // 0xf8(0x28)
	struct TSoftClassPtr<UObject> BrennerClass; // 0x120(0x28)
	struct FInt32Range NaturalRazorLimitRange; // 0x148(0x10)
	int32_t NaturalRazorLimitPlayerCap; // 0x158(0x04)
	int32_t ExtraNaturalRazorsPerPlayer; // 0x15c(0x04)
	float MinDistanceBetweenRazorsWhenSpawning; // 0x160(0x04)
	struct FInt32Range VentilationRazorLimitRange; // 0x164(0x10)
	struct FInt32Interval VentilationRazorsSpawnedPerAlarmEvent; // 0x174(0x08)
	int32_t VentilationRazorLimitPlayerCap; // 0x17c(0x04)
	int32_t ExtraVentilationRazorsPerPlayer; // 0x180(0x04)
	int32_t MaxRazorCorpsesPerZone; // 0x184(0x04)
	float RazorCorpseRemovalCheckInterval; // 0x188(0x04)
	float TimeToNormalRazorSpawnRazorRespawn; // 0x18c(0x04)
	struct UEncounterSpawnAirborneCharacters* DropshipSentryEncounterClass; // 0x190(0x08)
	struct AActor* SentryNavigationInvokerClass; // 0x198(0x08)
	float EncounterSpawnChanceUponAlarmTrigger; // 0x1a0(0x04)
	float MinDistanceBetweenEnemyAndPlayerWhenSpawning; // 0x1a4(0x04)
	struct FGameplayTag VaultRoomId; // 0x1a8(0x08)
};

// Class ConZ.AbandonedBunkerZoneManagerComponent
// Size: 0x250 (Inherited: 0x200)
struct UAbandonedBunkerZoneManagerComponent : USceneComponent {
	char pad_200[0x8]; // 0x200(0x08)
	struct TArray<struct FTransform> _razorNormalSpawnTransforms; // 0x208(0x10)
	struct TArray<struct ARazorSpawnPoint*> _razorSpawnPoints; // 0x218(0x10)
	struct TArray<struct FTransform> _brennerSpawnPoints; // 0x228(0x10)
	struct FVector _dropshipSentryEncounterSpawnLocation; // 0x238(0x0c)
	float _sentryNavigationInvokerGenerationRadius; // 0x244(0x04)
	char pad_248[0x8]; // 0x248(0x08)
};

// Class ConZ.AchievementsManagerClient
// Size: 0x2b8 (Inherited: 0x220)
struct AAchievementsManagerClient : AActor {
	char pad_220[0x98]; // 0x220(0x98)
};

// Class ConZ.AchievementsManagerServer
// Size: 0x298 (Inherited: 0x220)
struct AAchievementsManagerServer : AActor {
	char pad_220[0x78]; // 0x220(0x78)
};

// Class ConZ.ActionProgressWidget
// Size: 0x2e0 (Inherited: 0x268)
struct UActionProgressWidget : UUserWidget {
	struct FMulticastInlineDelegate ActionProgressFinishedEvent; // 0x268(0x10)
	struct FMulticastInlineDelegate ActionProgressCancelledEvent; // 0x278(0x10)
	bool CanCancel; // 0x288(0x01)
	char pad_289[0xb]; // 0x289(0x0b)
	float _currentTime; // 0x294(0x04)
	float _duration; // 0x298(0x04)
	bool _manualMode; // 0x29c(0x01)
	char pad_29D[0x3]; // 0x29d(0x03)
	struct UImage* Progress; // 0x2a0(0x08)
	struct UImage* Cancel; // 0x2a8(0x08)
	struct UTextBlock* PercentageText; // 0x2b0(0x08)
	struct UTextBlock* Percent; // 0x2b8(0x08)
	char pad_2C0[0x20]; // 0x2c0(0x20)

	void UnPauseProgress(); // Function ConZ.ActionProgressWidget.UnPauseProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x2330570
	void SetProgress(float Progress); // Function ConZ.ActionProgressWidget.SetProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x23304f0
	void PauseProgress(); // Function ConZ.ActionProgressWidget.PauseProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x23304d0
	void OnActionProgressFinishedEvent__DelegateSignature(); // DelegateFunction ConZ.ActionProgressWidget.OnActionProgressFinishedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x297fc00
	void OnActionProgressCancelledEvent__DelegateSignature(); // DelegateFunction ConZ.ActionProgressWidget.OnActionProgressCancelledEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x297fc00
	void ExecuteAction(); // Function ConZ.ActionProgressWidget.ExecuteAction // (Final|Native|Public|BlueprintCallable) // @ game+0x2330030
	void CancelAction(); // Function ConZ.ActionProgressWidget.CancelAction // (Final|Native|Public|BlueprintCallable) // @ game+0x232fff0
};

// Class ConZ.ActorStatics
// Size: 0x28 (Inherited: 0x28)
struct UActorStatics : UBlueprintFunctionLibrary {

	struct UActorComponent* GetActorComponentByName(struct AActor* Actor, struct FName& Name); // Function ConZ.ActorStatics.GetActorComponentByName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x2330130
	struct FVector GetActorBoundsCenter(struct AActor* Actor, bool onlyCollidingComponents); // Function ConZ.ActorStatics.GetActorBoundsCenter // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x2330050
};

// Class ConZ.ActorWithRepGraphPolicy_RelevantToSomeConnections
// Size: 0x28 (Inherited: 0x28)
struct UActorWithRepGraphPolicy_RelevantToSomeConnections : UInterface {
};

// Class ConZ.AdjustableSeparator
// Size: 0x288 (Inherited: 0x268)
struct UAdjustableSeparator : UUserWidget {
	struct USizeBox* _slotSizeBox; // 0x268(0x08)
	struct UNamedSlot* _divider; // 0x270(0x08)
	float _slotMinHeight; // 0x278(0x04)
	float _slotMaxHeight; // 0x27c(0x04)
	char pad_280[0x8]; // 0x280(0x08)
};

// Class ConZ.AdminCommand
// Size: 0xa0 (Inherited: 0x28)
struct UAdminCommand : UObject {
	struct FString _verb; // 0x28(0x10)
	struct TArray<struct FAdminCommandArgumentDescription> _argumentDescriptions; // 0x38(0x10)
	int32_t _numberOfRequiredArguments; // 0x48(0x04)
	int32_t _numberOfRepeatingArguments; // 0x4c(0x04)
	bool _isEnabled; // 0x50(0x01)
	bool _isEnabledInShippingBuild; // 0x51(0x01)
	enum class EExecutorStatus _requiredExecutorLevel; // 0x52(0x01)
	bool _shouldExecuteOnServer; // 0x53(0x01)
	bool _shouldExecuteOnClient; // 0x54(0x01)
	bool _shouldDisableSingleplayerAchievementsIfExecuted; // 0x55(0x01)
	bool _hasCooldown; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	float _cooldown; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FText _description; // 0x60(0x18)
	char pad_78[0x28]; // 0x78(0x28)
};

// Class ConZ.AdminCommand_AddOrRemoveWidget
// Size: 0xf0 (Inherited: 0xa0)
struct UAdminCommand_AddOrRemoveWidget : UAdminCommand {
	struct TMap<struct FName, struct UUserWidget*> _widgetClassesByName; // 0xa0(0x50)
};

// Class ConZ.AdminCommand_AddPrisonerBodyEffect
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_AddPrisonerBodyEffect : UAdminCommand {
	struct UPrisonerBodyEffect* _bodyEffectClass; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_AdminLight
// Size: 0xb0 (Inherited: 0xa0)
struct UAdminCommand_AdminLight : UAdminCommand {
	struct UAdminLight* _adminLightComponent; // 0xa0(0x08)
	float _maxIntensityMultiplier; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class ConZ.AdminCommand_Announce
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_Announce : UAdminCommand {
};

// Class ConZ.AdminCommand_BanPlayer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_BanPlayer : UAdminCommand {
};

// Class ConZ.AdminCommand_BoatDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_BoatDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_CancelVote
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_CancelVote : UAdminCommand {
};

// Class ConZ.AdminCommand_ChangeCurrencyBalance
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ChangeCurrencyBalance : UAdminCommand {
};

// Class ConZ.AdminCommand_ChangeCurrencyBalanceToAll
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ChangeCurrencyBalanceToAll : UAdminCommand {
};

// Class ConZ.AdminCommand_ChangeCurrencyBalanceToAllOnline
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ChangeCurrencyBalanceToAllOnline : UAdminCommand {
};

// Class ConZ.AdminCommand_ChangeFamePoints
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ChangeFamePoints : UAdminCommand {
};

// Class ConZ.AdminCommand_CheckServerTime
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_CheckServerTime : UAdminCommand {
};

// Class ConZ.AdminCommand_ClearEncounterCooldowns
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ClearEncounterCooldowns : UAdminCommand {
};

// Class ConZ.AdminCommand_ClearFakeName
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ClearFakeName : UAdminCommand {
};

// Class ConZ.AdminCommand_CookRecipe
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_CookRecipe : UAdminCommand {
	struct UCookingRecipe* _recipe; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_CrashMajestically
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_CrashMajestically : UAdminCommand {
};

// Class ConZ.AdminCommand_CreateEntity
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_CreateEntity : UAdminCommand {
};

// Class ConZ.AdminCommand_DebugWeapon
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DebugWeapon : UAdminCommand {
};

// Class ConZ.AdminCommand_DemolitionSkillDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DemolitionSkillDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyAllFlagsForPlayer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyAllFlagsForPlayer : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyAllItemsWithinRadius
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyAllItemsWithinRadius : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyAllRazorsWithinRadius
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyAllRazorsWithinRadius : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyAllVehicles
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyAllVehicles : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyCorpsesWithinRadius
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyCorpsesWithinRadius : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyEncountersAtPlayerLocation
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyEncountersAtPlayerLocation : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyEntity
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyEntity : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyFlag
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyFlag : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyVehicle
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyVehicle : UAdminCommand {
};

// Class ConZ.AdminCommand_DestroyZombiesWithinRadius
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DestroyZombiesWithinRadius : UAdminCommand {
};

// Class ConZ.AdminCommand_DisablePrisonerBodyEffects
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DisablePrisonerBodyEffects : UAdminCommand {
};

// Class ConZ.AdminCommand_DistanceDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DistanceDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_DoorDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DoorDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_DrawDebugZombieCapsulesOnLegacySpawnPoints
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DrawDebugZombieCapsulesOnLegacySpawnPoints : UAdminCommand {
};

// Class ConZ.AdminCommand_DrawNearbyEncounters
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DrawNearbyEncounters : UAdminCommand {
};

// Class ConZ.AdminCommand_DrawSentryHealthBar
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DrawSentryHealthBar : UAdminCommand {
};

// Class ConZ.AdminCommand_DumpAllSquadsInfoList
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DumpAllSquadsInfoList : UAdminCommand {
};

// Class ConZ.AdminCommand_DumpEncounterManagerData
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DumpEncounterManagerData : UAdminCommand {
};

// Class ConZ.AdminCommand_DumpWetnessDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_DumpWetnessDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_GrantElevatedStatus
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_GrantElevatedStatus : UAdminCommand {
};

// Class ConZ.AdminCommand_RevokeElevatedStatus
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_RevokeElevatedStatus : UAdminCommand {
};

// Class ConZ.AdminCommand_EnableAdminViolations
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_EnableAdminViolations : UAdminCommand {
};

// Class ConZ.AdminCommand_EnableHuntingClueDebugArrow
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_EnableHuntingClueDebugArrow : UAdminCommand {
};

// Class ConZ.AdminCommand_EnableOrDisableServer
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_EnableOrDisableServer : UAdminCommand {
	bool _shouldEnableServer; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class ConZ.AdminCommand_EndTournamentMode
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_EndTournamentMode : UAdminCommand {
};

// Class ConZ.AdminCommand_EnhancedPhotoMode
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_EnhancedPhotoMode : UAdminCommand {
};

// Class ConZ.AdminCommand_EquipParachute
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_EquipParachute : UAdminCommand {
	struct AClothesItem* _parachuteClass; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_ExecuteConsoleCommand
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ExecuteConsoleCommand : UAdminCommand {
};

// Class ConZ.AdminCommand_ExecutePrisonerBodyConditionInteraction
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ExecutePrisonerBodyConditionInteraction : UAdminCommand {
};

// Class ConZ.AdminCommand_ExportDefaultItemSpawnerPresets
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ExportDefaultItemSpawnerPresets : UAdminCommand {
};

// Class ConZ.AdminCommand_ExportDefaultItemSpawningCooldownGroups
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ExportDefaultItemSpawningCooldownGroups : UAdminCommand {
};

// Class ConZ.AdminCommand_ExportDefaultItemSpawningParameters
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ExportDefaultItemSpawningParameters : UAdminCommand {
};

// Class ConZ.AdminCommand_ExportItemLootTree
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_ExportItemLootTree : UAdminCommand {
	enum class EItemLootTreeToExport _lootTreeToExport; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class ConZ.AdminCommand_ExportItemSpawnerPresetsInZone
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ExportItemSpawnerPresetsInZone : UAdminCommand {
};

// Class ConZ.AdminCommand_ExportQuests
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ExportQuests : UAdminCommand {
};

// Class ConZ.AdminCommand_FindSquadMember
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_FindSquadMember : UAdminCommand {
};

// Class ConZ.AdminCommand_ForceBBEncounterOnNearbyOwnedBase
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ForceBBEncounterOnNearbyOwnedBase : UAdminCommand {
};

// Class ConZ.AdminCommand_ForceEncounterAtPlayerLocation
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_ForceEncounterAtPlayerLocation : UAdminCommand {
	struct UEncounterBase* _encounterClass; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_GetMeshInfo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_GetMeshInfo : UAdminCommand {
};

// Class ConZ.AdminCommand_GetUserID
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_GetUserID : UAdminCommand {
};

// Class ConZ.AdminCommand_GetUserIDByRank
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_GetUserIDByRank : UAdminCommand {
};

// Class ConZ.AdminCommand_KickPlayer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_KickPlayer : UAdminCommand {
};

// Class ConZ.AdminCommand_KnockoutPrisoner
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_KnockoutPrisoner : UAdminCommand {
};

// Class ConZ.AdminCommand_LeaveCorpse
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_LeaveCorpse : UAdminCommand {
};

// Class ConZ.AdminCommand_ListActiveAbandonedBunkers
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListActiveAbandonedBunkers : UAdminCommand {
};

// Class ConZ.AdminCommand_ListActiveHunts
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListActiveHunts : UAdminCommand {
};

// Class ConZ.AdminCommand_ListActiveSecretBunkers
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListActiveSecretBunkers : UAdminCommand {
};

// Class ConZ.AdminCommand_ListFlags
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListFlags : UAdminCommand {
};

// Class ConZ.AdminCommand_ListItemsSpawnLocations
// Size: 0xe0 (Inherited: 0xa0)
struct UAdminCommand_ListItemsSpawnLocations : UAdminCommand {
	struct FSearchItemSpawnerPresetArray _itemSpawnerPresets[0x2]; // 0xa0(0x20)
	struct FSearchItemClassesArray _itemClasses[0x2]; // 0xc0(0x20)
};

// Class ConZ.AdminCommand_ListMutedPlayers
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListMutedPlayers : UAdminCommand {
};

// Class ConZ.AdminCommand_ListPlayers
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListPlayers : UAdminCommand {
};

// Class ConZ.AdminCommand_ListPrimaryAssets
// Size: 0xf8 (Inherited: 0xa0)
struct UAdminCommand_ListPrimaryAssets : UAdminCommand {
	struct FPrimaryAssetType _primaryAssetType; // 0xa0(0x08)
	struct TSet<struct FPrimaryAssetId> _primaryAssetsToExclude; // 0xa8(0x50)
};

// Class ConZ.AdminCommand_ListPrisonerBodyConditionInteractions
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListPrisonerBodyConditionInteractions : UAdminCommand {
};

// Class ConZ.AdminCommand_ListPrisonerBodyEffects
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_ListPrisonerBodyEffects : UAdminCommand {
	struct UPrisonerBodyEffect* _bodyEffectClass; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_ListPrisonerForeignSubstances
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListPrisonerForeignSubstances : UAdminCommand {
};

// Class ConZ.AdminCommand_ListSilencedPlayers
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListSilencedPlayers : UAdminCommand {
};

// Class ConZ.AdminCommand_ListSpawnedAnimals
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListSpawnedAnimals : UAdminCommand {
};

// Class ConZ.AdminCommand_ListSpawnedVehicles
// Size: 0x1a0 (Inherited: 0xa0)
struct UAdminCommand_ListSpawnedVehicles : UAdminCommand {
	struct FGameplayTagContainer _vehicleSpawnGroupsByCategory[0x8]; // 0xa0(0x100)
};

// Class ConZ.AdminCommand_ListSquadMembers
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListSquadMembers : UAdminCommand {
};

// Class ConZ.AdminCommand_ListSquads
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListSquads : UAdminCommand {
};

// Class ConZ.AdminCommand_ListWeatherControllerOverrides
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ListWeatherControllerOverrides : UAdminCommand {
};

// Class ConZ.AdminCommand_Location
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_Location : UAdminCommand {
};

// Class ConZ.AdminCommand_Loot
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_Loot : UAdminCommand {
};

// Class ConZ.AdminCommand_MapTeleport
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_MapTeleport : UAdminCommand {
};

// Class ConZ.AdminCommand_MutePlayer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_MutePlayer : UAdminCommand {
};

// Class ConZ.AdminCommand_PlacementDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_PlacementDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_PlayerInfo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_PlayerInfo : UAdminCommand {
};

// Class ConZ.AdminCommand_PrintEntities
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_PrintEntities : UAdminCommand {
};

// Class ConZ.AdminCommand_PrintGlobalRaidProtectionRaidTimes
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_PrintGlobalRaidProtectionRaidTimes : UAdminCommand {
};

// Class ConZ.AdminCommand_Quests
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_Quests : UAdminCommand {
};

// Class ConZ.AdminCommand_RandomizePriceDeltas
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_RandomizePriceDeltas : UAdminCommand {
};

// Class ConZ.AdminCommand_ReloadCustomMapConfig
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ReloadCustomMapConfig : UAdminCommand {
};

// Class ConZ.AdminCommand_ReloadLootCustomizationsAndResetSpawners
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ReloadLootCustomizationsAndResetSpawners : UAdminCommand {
};

// Class ConZ.AdminCommand_RemovePrisonerBodyEffect
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_RemovePrisonerBodyEffect : UAdminCommand {
	struct UPrisonerBodyEffect* _bodyEffectClass; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_RenameVehicle
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_RenameVehicle : UAdminCommand {
};

// Class ConZ.AdminCommand_ReportDesync
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ReportDesync : UAdminCommand {
};

// Class ConZ.AdminCommand_ResetAchievements
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ResetAchievements : UAdminCommand {
};

// Class ConZ.AdminCommand_ResetEconomy
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ResetEconomy : UAdminCommand {
};

// Class ConZ.AdminCommand_ResetSquadInfo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ResetSquadInfo : UAdminCommand {
};

// Class ConZ.AdminCommand_ScheduleCargoDrop
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ScheduleCargoDrop : UAdminCommand {
};

// Class ConZ.AdminCommand_ScheduleWorldEvent
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ScheduleWorldEvent : UAdminCommand {
};

// Class ConZ.AdminCommand_SendNotification
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SendNotification : UAdminCommand {
};

// Class ConZ.AdminCommand_SetAchievementUnlocked
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetAchievementUnlocked : UAdminCommand {
};

// Class ConZ.AdminCommand_SetAIInvisibility
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetAIInvisibility : UAdminCommand {
};

// Class ConZ.AdminCommand_SetAirplaneMaxVelocity
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetAirplaneMaxVelocity : UAdminCommand {
};

// Class ConZ.AdminCommand_SetAllInventoryAccess
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetAllInventoryAccess : UAdminCommand {
};

// Class ConZ.AdminCommand_SetCraftingSearch
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetCraftingSearch : UAdminCommand {
};

// Class ConZ.AdminCommand_SetCurrencyBalance
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetCurrencyBalance : UAdminCommand {
};

// Class ConZ.AdminCommand_SetCurrencyBalanceToAll
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetCurrencyBalanceToAll : UAdminCommand {
};

// Class ConZ.AdminCommand_SetCurrencyBalanceToAllOnline
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetCurrencyBalanceToAllOnline : UAdminCommand {
};

// Class ConZ.AdminCommand_SetDecayTimeDilation
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetDecayTimeDilation : UAdminCommand {
};

// Class ConZ.AdminCommand_SetDeluxeVersion
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetDeluxeVersion : UAdminCommand {
};

// Class ConZ.AdminCommand_SetFakeName
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetFakeName : UAdminCommand {
};

// Class ConZ.AdminCommand_SetFamePoints
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetFamePoints : UAdminCommand {
};

// Class ConZ.AdminCommand_SetFamePointsToAll
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetFamePointsToAll : UAdminCommand {
};

// Class ConZ.AdminCommand_SetFamePointsToAllOnline
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetFamePointsToAllOnline : UAdminCommand {
};

// Class ConZ.AdminCommand_SetFarmingSimulationSpeed
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetFarmingSimulationSpeed : UAdminCommand {
};

// Class ConZ.AdminCommand_SetGardenNutrientsHigh
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetGardenNutrientsHigh : UAdminCommand {
};

// Class ConZ.AdminCommand_SetGardenPlantGrowthStage
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetGardenPlantGrowthStage : UAdminCommand {
};

// Class ConZ.AdminCommand_SetGardenPlantingTime
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetGardenPlantingTime : UAdminCommand {
};

// Class ConZ.AdminCommand_SetGender
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetGender : UAdminCommand {
};

// Class ConZ.AdminCommand_SetGodMode
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetGodMode : UAdminCommand {
};

// Class ConZ.AdminCommand_SetHealthToItemInHands
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetHealthToItemInHands : UAdminCommand {
};

// Class ConZ.AdminCommand_SetInfiniteAmmo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetInfiniteAmmo : UAdminCommand {
};

// Class ConZ.AdminCommand_SetItemDebugMode
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetItemDebugMode : UAdminCommand {
};

// Class ConZ.AdminCommand_SetMalfunctionProbability
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetMalfunctionProbability : UAdminCommand {
};

// Class ConZ.AdminCommand_SetMountedVehicleProperty
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetMountedVehicleProperty : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerAttributes
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerAttributes : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerBladderVolume
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerBladderVolume : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerExhaustion
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerExhaustion : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerImmortality
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerImmortality : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerInfiniteOxygen
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerInfiniteOxygen : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerInfiniteStamina
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerInfiniteStamina : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerMetabolismSimulationSpeed
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerMetabolismSimulationSpeed : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerStamina
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerStamina : UAdminCommand {
};

// Class ConZ.AdminCommand_SetPrisonerStomachVolume
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetPrisonerStomachVolume : UAdminCommand {
};

// Class ConZ.AdminCommand_SetReplishableResourceAmount
// Size: 0xb0 (Inherited: 0xa0)
struct UAdminCommand_SetReplishableResourceAmount : UAdminCommand {
	float _defaultAreaOfEffect; // 0xa0(0x04)
	float _minAreaOfEffect; // 0xa4(0x04)
	float _maxAreaOfEffect; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class ConZ.AdminCommand_SetShouldPrintExamineSpawnerPresets
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetShouldPrintExamineSpawnerPresets : UAdminCommand {
};

// Class ConZ.AdminCommand_SetSkillLevel
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetSkillLevel : UAdminCommand {
};

// Class ConZ.AdminCommand_SetSuperJump
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetSuperJump : UAdminCommand {
};

// Class ConZ.AdminCommand_SetTime
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetTime : UAdminCommand {
};

// Class ConZ.AdminCommand_SetTimeSpeed
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetTimeSpeed : UAdminCommand {
};

// Class ConZ.AdminCommand_SetWeather
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetWeather : UAdminCommand {
};

// Class ConZ.AdminCommand_SetWeatherControllerOverrideActive
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetWeatherControllerOverrideActive : UAdminCommand {
};

// Class ConZ.AdminCommand_SetWeatherControllerOverrideValue
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SetWeatherControllerOverrideValue : UAdminCommand {
};

// Class ConZ.AdminCommand_ShouldShowOtherPlayerInfo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShouldShowOtherPlayerInfo : UAdminCommand {
};

// Class ConZ.AdminCommand_ShouldShowOtherPlayerLocations
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShouldShowOtherPlayerLocations : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowBaseBuildingDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowBaseBuildingDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowFlagInfo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowFlagInfo : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowFlagLocations
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowFlagLocations : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowNameplates
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowNameplates : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowRespawnTimes
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowRespawnTimes : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowVehicleDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowVehicleDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowVehicleInfo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowVehicleInfo : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowVehicleLocations
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowVehicleLocations : UAdminCommand {
};

// Class ConZ.AdminCommand_ShowWeaponInfo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShowWeaponInfo : UAdminCommand {
};

// Class ConZ.AdminCommand_ShutdownServer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ShutdownServer : UAdminCommand {
};

// Class ConZ.AdminCommand_SilencePlayer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SilencePlayer : UAdminCommand {
};

// Class ConZ.AdminCommand_Sleep
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_Sleep : UAdminCommand {
};

// Class ConZ.AdminCommand_SpawnAllItems
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SpawnAllItems : UAdminCommand {
};

// Class ConZ.AdminCommand_SpawnPrimaryActorAsset
// Size: 0x120 (Inherited: 0xa0)
struct UAdminCommand_SpawnPrimaryActorAsset : UAdminCommand {
	struct FPrimaryAssetType _primaryAssetType; // 0xa0(0x08)
	struct TSet<struct FPrimaryAssetId> _primaryAssetsToExclude; // 0xa8(0x50)
	int32_t _countArgumentMinValue; // 0xf8(0x04)
	int32_t _countArgumentMaxValue; // 0xfc(0x04)
	struct FVector _spawnOffset; // 0x100(0x0c)
	bool _isSpawnedActorCapableOfFalling; // 0x10c(0x01)
	char pad_10D[0x13]; // 0x10d(0x13)
};

// Class ConZ.AdminCommand_SpawnAnimal
// Size: 0x120 (Inherited: 0x120)
struct UAdminCommand_SpawnAnimal : UAdminCommand_SpawnPrimaryActorAsset {
};

// Class ConZ.AdminCommand_SpawnArmedNPC
// Size: 0x120 (Inherited: 0x120)
struct UAdminCommand_SpawnArmedNPC : UAdminCommand_SpawnPrimaryActorAsset {
};

// Class ConZ.AdminCommand_SpawnBrenner
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SpawnBrenner : UAdminCommand {
};

// Class ConZ.AdminCommand_SpawnDebugAnimalTrack
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_SpawnDebugAnimalTrack : UAdminCommand {
	struct FPrimaryAssetType _primaryAssetType; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_SpawnInventoryFullOf
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SpawnInventoryFullOf : UAdminCommand {
};

// Class ConZ.AdminCommand_SpawnItem
// Size: 0x170 (Inherited: 0x120)
struct UAdminCommand_SpawnItem : UAdminCommand_SpawnPrimaryActorAsset {
	char pad_120[0x50]; // 0x120(0x50)
};

// Class ConZ.AdminCommand_SpawnRandomAnimal
// Size: 0x120 (Inherited: 0x120)
struct UAdminCommand_SpawnRandomAnimal : UAdminCommand_SpawnAnimal {
};

// Class ConZ.AdminCommand_SpawnRandomPrimaryActorAsset
// Size: 0x120 (Inherited: 0x120)
struct UAdminCommand_SpawnRandomPrimaryActorAsset : UAdminCommand_SpawnPrimaryActorAsset {
};

// Class ConZ.AdminCommand_SpawnZombie
// Size: 0x120 (Inherited: 0x120)
struct UAdminCommand_SpawnZombie : UAdminCommand_SpawnPrimaryActorAsset {
};

// Class ConZ.AdminCommand_SpawnRandomZombie
// Size: 0x120 (Inherited: 0x120)
struct UAdminCommand_SpawnRandomZombie : UAdminCommand_SpawnZombie {
};

// Class ConZ.AdminCommand_SpawnRazor
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_SpawnRazor : UAdminCommand {
};

// Class ConZ.AdminCommand_SpawnReflectionSphere
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_SpawnReflectionSphere : UAdminCommand {
	struct UObject* _actorClass; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_SpawnVehicle
// Size: 0x128 (Inherited: 0x120)
struct UAdminCommand_SpawnVehicle : UAdminCommand_SpawnPrimaryActorAsset {
	char pad_120[0x8]; // 0x120(0x08)
};

// Class ConZ.AdminCommand_StartTournamentMode
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_StartTournamentMode : UAdminCommand {
};

// Class ConZ.AdminCommand_Teleport
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_Teleport : UAdminCommand {
};

// Class ConZ.AdminCommand_TeleportTo
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_TeleportTo : UAdminCommand {
};

// Class ConZ.AdminCommand_TeleportTo3pm
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_TeleportTo3pm : UAdminCommand {
};

// Class ConZ.AdminCommand_TeleportToMe
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_TeleportToMe : UAdminCommand {
};

// Class ConZ.AdminCommand_TeleportToVehicle
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_TeleportToVehicle : UAdminCommand {
};

// Class ConZ.AdminCommand_ToggleFamePointsDebugVisualization
// Size: 0xa8 (Inherited: 0xa0)
struct UAdminCommand_ToggleFamePointsDebugVisualization : UAdminCommand {
	struct UFamePointDebugComponent* _famePointDebugComponentClass; // 0xa0(0x08)
};

// Class ConZ.AdminCommand_ToggleZombieNavigationLogging
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_ToggleZombieNavigationLogging : UAdminCommand {
};

// Class ConZ.AdminCommand_TrackShotsFired
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_TrackShotsFired : UAdminCommand {
};

// Class ConZ.AdminCommand_TrapsDebug
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_TrapsDebug : UAdminCommand {
};

// Class ConZ.AdminCommand_UnbanPlayer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_UnbanPlayer : UAdminCommand {
};

// Class ConZ.AdminCommand_UnmutePlayer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_UnmutePlayer : UAdminCommand {
};

// Class ConZ.AdminCommand_UnsilencePlayer
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_UnsilencePlayer : UAdminCommand {
};

// Class ConZ.AdminCommand_UpgradeBaseBuildingElementsWithinRadius
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_UpgradeBaseBuildingElementsWithinRadius : UAdminCommand {
};

// Class ConZ.AdminCommand_VehicleCheat
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_VehicleCheat : UAdminCommand {
};

// Class ConZ.AdminCommand_VisualizeAnimalLocation
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_VisualizeAnimalLocation : UAdminCommand {
};

// Class ConZ.AdminCommand_VisualizeArmedNPCLocation
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_VisualizeArmedNPCLocation : UAdminCommand {
};

// Class ConZ.AdminCommand_VisualizeBulletTrajectories
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_VisualizeBulletTrajectories : UAdminCommand {
};

// Class ConZ.AdminCommand_VisualizePlayerAiming
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_VisualizePlayerAiming : UAdminCommand {
};

// Class ConZ.AdminCommand_VisualizeVehicleTrajectory
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_VisualizeVehicleTrajectory : UAdminCommand {
};

// Class ConZ.AdminCommand_VisualizeZombieLocation
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_VisualizeZombieLocation : UAdminCommand {
};

// Class ConZ.AdminCommand_Vote
// Size: 0xa0 (Inherited: 0xa0)
struct UAdminCommand_Vote : UAdminCommand {
};

// Class ConZ.AdminCommandArgumentCompletion
// Size: 0x38 (Inherited: 0x28)
struct UAdminCommandArgumentCompletion : UObject {
	bool _canCompletionValuesBeCached; // 0x28(0x01)
	char pad_29[0xf]; // 0x29(0x0f)

	void GetCompletionValues(struct TArray<struct FString>& Result); // Function ConZ.AdminCommandArgumentCompletion.GetCompletionValues // (Native|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x2343ab0
};

// Class ConZ.AdminCommandArgumentCompletion_Achievements
// Size: 0x38 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_Achievements : UAdminCommandArgumentCompletion {
};

// Class ConZ.AdminCommandArgumentCompletion_Constant
// Size: 0x48 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_Constant : UAdminCommandArgumentCompletion {
	struct TArray<struct FString> _completionValues; // 0x38(0x10)
};

// Class ConZ.AdminCommandArgumentCompletion_Enum
// Size: 0x98 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_Enum : UAdminCommandArgumentCompletion {
	struct FName _enum; // 0x38(0x08)
	bool _excludeNoneEnumerator; // 0x40(0x01)
	bool _excludeCountEnumerator; // 0x41(0x01)
	bool _excludeAutoGeneratedEnumerator; // 0x42(0x01)
	char pad_43[0x5]; // 0x43(0x05)
	struct TSet<struct FName> _additionalEnumeratorsToExclude; // 0x48(0x50)
};

// Class ConZ.AdminCommandArgumentCompletion_Player
// Size: 0x38 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_Player : UAdminCommandArgumentCompletion {
};

// Class ConZ.AdminCommandArgumentCompletion_PrimaryAsset
// Size: 0x90 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_PrimaryAsset : UAdminCommandArgumentCompletion {
	struct FPrimaryAssetType _primaryAssetType; // 0x38(0x08)
	struct TSet<struct FPrimaryAssetId> _primaryAssetsToExclude; // 0x40(0x50)
};

// Class ConZ.AdminCommandArgumentCompletion_QuestSetup
// Size: 0x38 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_QuestSetup : UAdminCommandArgumentCompletion {
};

// Class ConZ.AdminCommandArgumentCompletion_Skill
// Size: 0x38 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_Skill : UAdminCommandArgumentCompletion {
};

// Class ConZ.AdminCommandArgumentCompletion_Squad
// Size: 0x38 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_Squad : UAdminCommandArgumentCompletion {
};

// Class ConZ.AdminCommandArgumentCompletion_Widget
// Size: 0x40 (Inherited: 0x38)
struct UAdminCommandArgumentCompletion_Widget : UAdminCommandArgumentCompletion {
	struct UAdminCommand_AddOrRemoveWidget* _commandClass; // 0x38(0x08)
};

// Class ConZ.AdminCommandArgumentDataTypeBase
// Size: 0x108 (Inherited: 0x30)
struct UAdminCommandArgumentDataTypeBase : UDataAsset {
	struct FText DataTypeName; // 0x30(0x18)
	struct UAdminCommandArgumentCompletion* ArgumentCompletion; // 0x48(0x08)
	char pad_50[0xb8]; // 0x50(0xb8)
};

// Class ConZ.AdminCommandArgumentDataType_Bool
// Size: 0x110 (Inherited: 0x108)
struct UAdminCommandArgumentDataType_Bool : UAdminCommandArgumentDataTypeBase {
	bool _defaultValue; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
};

// Class ConZ.AdminCommandArgumentDataType_Location
// Size: 0x118 (Inherited: 0x108)
struct UAdminCommandArgumentDataType_Location : UAdminCommandArgumentDataTypeBase {
	struct FVector _defaultValue; // 0x108(0x0c)
	char pad_114[0x4]; // 0x114(0x04)
};

// Class ConZ.AdminCommandArgumentDataType_Numeric
// Size: 0x110 (Inherited: 0x108)
struct UAdminCommandArgumentDataType_Numeric : UAdminCommandArgumentDataTypeBase {
	float _defaultValue; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
};

// Class ConZ.AdminCommandArgumentDataType_String
// Size: 0x120 (Inherited: 0x108)
struct UAdminCommandArgumentDataType_String : UAdminCommandArgumentDataTypeBase {
	struct FString _defaultValue; // 0x108(0x10)
	bool _caseSensitive; // 0x118(0x01)
	char pad_119[0x7]; // 0x119(0x07)
};

// Class ConZ.AdminCommandArgumentDataType_Transform
// Size: 0x140 (Inherited: 0x108)
struct UAdminCommandArgumentDataType_Transform : UAdminCommandArgumentDataTypeBase {
	char pad_108[0x8]; // 0x108(0x08)
	struct FTransform _defaultValue; // 0x110(0x30)
};

// Class ConZ.AdminCommandArgumentDataType_TransformOrLocation
// Size: 0x118 (Inherited: 0x108)
struct UAdminCommandArgumentDataType_TransformOrLocation : UAdminCommandArgumentDataTypeBase {
	struct FVector _defaultLocationValue; // 0x108(0x0c)
	char pad_114[0x4]; // 0x114(0x04)
};

// Class ConZ.AdminCommandCompletionManager
// Size: 0x138 (Inherited: 0x28)
struct UAdminCommandCompletionManager : UObject {
	struct TMap<struct FString, struct UAdminCommand*> _commands; // 0x28(0x50)
	char pad_78[0xc0]; // 0x78(0xc0)
};

// Class ConZ.AdminCommandExecutor
// Size: 0x28 (Inherited: 0x28)
struct UAdminCommandExecutor : UInterface {
};

// Class ConZ.AdminCommandRegistry
// Size: 0x98 (Inherited: 0x28)
struct UAdminCommandRegistry : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TArray<struct UAdminCommand*> _commands; // 0x38(0x10)
	char pad_48[0x50]; // 0x48(0x50)
};

// Class ConZ.AdminCommandsStatics
// Size: 0x28 (Inherited: 0x28)
struct UAdminCommandsStatics : UBlueprintFunctionLibrary {
};

// Class ConZ.AdminLight
// Size: 0x370 (Inherited: 0x360)
struct UAdminLight : UPointLightComponent {
	struct UCurveFloat* _intensityVersusTimeOfDay; // 0x360(0x08)
	char pad_368[0x8]; // 0x368(0x08)
};

// Class ConZ.AdminPlantPanel
// Size: 0x2b8 (Inherited: 0x268)
struct UAdminPlantPanel : UUserWidget {
	char pad_268[0x8]; // 0x268(0x08)
	struct UButton* _seedingButton; // 0x270(0x08)
	struct UButton* _vegetatingButton; // 0x278(0x08)
	struct UButton* _floweringButton; // 0x280(0x08)
	struct UButton* _ripeningButton; // 0x288(0x08)
	struct UButton* _killButton; // 0x290(0x08)
	struct UButton* _addWeedButton; // 0x298(0x08)
	struct UButton* _removeWeedButton; // 0x2a0(0x08)
	struct UButton* _removePlantButton; // 0x2a8(0x08)
	struct UButton* _addWaterButton; // 0x2b0(0x08)

	void OnClickVegetating(); // Function ConZ.AdminPlantPanel.OnClickVegetating // (Final|Native|Private) // @ game+0x2343c80
	void OnClickSeeding(); // Function ConZ.AdminPlantPanel.OnClickSeeding // (Final|Native|Private) // @ game+0x2343c60
	void OnClickRipening(); // Function ConZ.AdminPlantPanel.OnClickRipening // (Final|Native|Private) // @ game+0x2343c40
	void OnClickRemoveWeed(); // Function ConZ.AdminPlantPanel.OnClickRemoveWeed // (Final|Native|Private) // @ game+0x2343c20
	void OnClickRemovePlant(); // Function ConZ.AdminPlantPanel.OnClickRemovePlant // (Final|Native|Private) // @ game+0x2343c00
	void OnClickKill(); // Function ConZ.AdminPlantPanel.OnClickKill // (Final|Native|Private) // @ game+0x2343be0
	void OnClickFlowering(); // Function ConZ.AdminPlantPanel.OnClickFlowering // (Final|Native|Private) // @ game+0x2343bc0
	void OnClickAddWeed(); // Function ConZ.AdminPlantPanel.OnClickAddWeed // (Final|Native|Private) // @ game+0x2343ba0
	void OnClickAddWater(); // Function ConZ.AdminPlantPanel.OnClickAddWater // (Final|Native|Private) // @ game+0x2343b80
};

// Class ConZ.AdvancedBuoyancyComponent
// Size: 0x560 (Inherited: 0x500)
struct UAdvancedBuoyancyComponent : UStaticMeshComponent {
	char pad_500[0x4]; // 0x500(0x04)
	float _waterKinematicViscosity; // 0x504(0x04)
	float _cPD1; // 0x508(0x04)
	float _cPD2; // 0x50c(0x04)
	float _fP; // 0x510(0x04)
	float _cSD1; // 0x514(0x04)
	float _cSD2; // 0x518(0x04)
	float _fS; // 0x51c(0x04)
	float _maxAcceleration; // 0x520(0x04)
	float _p; // 0x524(0x04)
	float _maxHydrodynamicVelocity; // 0x528(0x04)
	char pad_52C[0x34]; // 0x52c(0x34)
};

// Class ConZ.AIDetectionTimerHandler
// Size: 0x270 (Inherited: 0x220)
struct AAIDetectionTimerHandler : AActor {
	char pad_220[0x50]; // 0x220(0x50)

	void OnDestroyedEvent(struct AActor* DestroyedActor); // Function ConZ.AIDetectionTimerHandler.OnDestroyedEvent // (Final|Native|Private) // @ game+0x2343ca0
};

// Class ConZ.AIManager
// Size: 0x1b0 (Inherited: 0x28)
struct UAIManager : UObject {
	char pad_28[0x18]; // 0x28(0x18)
	struct FAITeamAttitudeData _teamAttitudes[0xb]; // 0x40(0x16b)
	char pad_1AB[0x5]; // 0x1ab(0x05)
};

// Class ConZ.VehicleBase
// Size: 0x12f0 (Inherited: 0x280)
struct AVehicleBase : APawn {
	char pad_280[0x1f8]; // 0x280(0x1f8)
	struct UVehicleMeshComponent* _vehicleMeshComponent; // 0x478(0x08)
	char pad_480[0x1c]; // 0x480(0x1c)
	bool _shouldApplyWaterDrag; // 0x49c(0x01)
	char pad_49D[0x3]; // 0x49d(0x03)
	float _waterDragForceCoefficient; // 0x4a0(0x04)
	struct FFloatInterval _submergedInWaterDamagePerSecond; // 0x4a4(0x08)
	char pad_4AC[0x54]; // 0x4ac(0x54)
	struct AVehicleItemContainer* _itemContainer; // 0x500(0x08)
	struct TArray<struct UVehicleAttachment*> _vehicleAttachments; // 0x508(0x10)
	struct TArray<struct UVehicleAttachment*> _repVehicleAttachments; // 0x518(0x10)
	char pad_528[0x10]; // 0x528(0x10)
	struct FVehicleAttachmentSlot _chassisSlot; // 0x538(0x58)
	char pad_590[0x8]; // 0x590(0x08)
	struct FGameplayTagContainer _lockInfluencingAttachmentSlotTags; // 0x598(0x20)
	struct FGameplayTagContainer _lockingAttachmentSlotTags; // 0x5b8(0x20)
	struct TArray<struct UVehicleSystem*> _vehicleSystems; // 0x5d8(0x10)
	char pad_5E8[0x18]; // 0x5e8(0x18)
	struct FPackedEntitySetupAndId _repServerEntitySetupAndId; // 0x600(0x08)
	char pad_608[0x4c0]; // 0x608(0x4c0)
	struct UVehicleForcePushComponent* _forcePushComponent; // 0xac8(0x08)
	struct TMap<struct UVehicleAttachment*, struct UWidgetComponent*> _attachmentHealthWidgets; // 0xad0(0x50)
	struct UVehicleAttachmentHealthWidget* _attachmentHealthWidget; // 0xb20(0x08)
	struct UEntityOverlapDetectionComponent* _entityOverlapDetection; // 0xb28(0x08)
	struct UNetworkPredictionComponent* _networkPrediction; // 0xb30(0x08)
	struct FCollisionProfileName _serverCollisionProfileName; // 0xb38(0x08)
	char pad_B40[0x18]; // 0xb40(0x18)
	float _netUpdateFrequencyWhenStationary; // 0xb58(0x04)
	struct FGameplayTag SpawnGroup; // 0xb5c(0x08)
	float _linearSpeedThresholdSqr; // 0xb64(0x04)
	float _angularSpeedThresholdSqr; // 0xb68(0x04)
	char pad_B6C[0xc]; // 0xb6c(0x0c)
	struct AVehicleItemContainer* _itemContainerClass; // 0xb78(0x08)
	char pad_B80[0x10]; // 0xb80(0x10)
	struct FRepairableParams _repairableParams; // 0xb90(0x38)
	char pad_BC8[0x1]; // 0xbc8(0x01)
	bool _repIsSimulatingPhysics; // 0xbc9(0x01)
	char pad_BCA[0x2]; // 0xbca(0x02)
	struct FVector _repLocationWhenNotSimulatingPhysics; // 0xbcc(0x0c)
	struct FRotator _repRotationWhenNotSimulatingPhysics; // 0xbd8(0x0c)
	char pad_BE4[0x4]; // 0xbe4(0x04)
	float _physicsDormancyTimeout; // 0xbe8(0x04)
	char pad_BEC[0x50]; // 0xbec(0x50)
	bool _shouldPeriodicallyWakeOtherVehicles; // 0xc3c(0x01)
	char pad_C3D[0x3]; // 0xc3d(0x03)
	float _wakePingInterval; // 0xc40(0x04)
	char pad_C44[0x24]; // 0xc44(0x24)
	struct UVehicleServiceComponent* _serviceComponent; // 0xc68(0x08)
	char pad_C70[0x1]; // 0xc70(0x01)
	bool _isInQuickService; // 0xc71(0x01)
	char pad_C72[0xd6]; // 0xc72(0xd6)
	struct UVehicleCameraStabilizerComponent* _cameraStabilizer; // 0xd48(0x08)
	char pad_D50[0x4]; // 0xd50(0x04)
	uint32_t _previewMeshTimePerMesh; // 0xd54(0x04)
	char pad_D58[0x8]; // 0xd58(0x08)
	struct FText _healthBarCaption; // 0xd60(0x18)
	struct FVehicleImpactEffects _impactEffects[0x5]; // 0xd78(0x118)
	struct UParticleSystem* _instantDestructionExplosionEffect; // 0xe90(0x08)
	struct UAkAudioEvent* _instantDestructionExplosionAudioEvent; // 0xe98(0x08)
	char pad_EA0[0x60]; // 0xea0(0x60)
	float _maxSpeedForInteraction; // 0xf00(0x04)
	float _maxSpeedForForceUnmount; // 0xf04(0x04)
	bool _shouldUnmountWhenTilted; // 0xf08(0x01)
	char pad_F09[0x3]; // 0xf09(0x03)
	float _maxAngleForForceUnmount; // 0xf0c(0x04)
	bool _shouldDisableClimbingDependingOnVelocity; // 0xf10(0x01)
	char pad_F11[0x3]; // 0xf11(0x03)
	float _maxSpeedForClimbingKmH; // 0xf14(0x04)
	int32_t _climbingPermissions; // 0xf18(0x04)
	char pad_F1C[0xc]; // 0xf1c(0x0c)
	float _maxSubmergedTime; // 0xf28(0x04)
	float _maxSubmersionFactor; // 0xf2c(0x04)
	char pad_F30[0x8]; // 0xf30(0x08)
	struct UUserWidget* _mountSlotIndicatorsWidget; // 0xf38(0x08)
	char pad_F40[0x8]; // 0xf40(0x08)
	float _inWaterDestructionTimeInSeconds; // 0xf48(0x04)
	float _outOfWaterDestructionTimeInSeconds; // 0xf4c(0x04)
	struct UVehicleHandlingSkill* _vehicleHandlingSkill; // 0xf50(0x08)
	bool _isInWater; // 0xf58(0x01)
	char pad_F59[0x3]; // 0xf59(0x03)
	float _navigationRelevancyVelocitySquared; // 0xf5c(0x04)
	bool _disableAIClimbingWhenMounteesExist; // 0xf60(0x01)
	char pad_F61[0x3]; // 0xf61(0x03)
	float _aiNoiseFrequencyPerHour; // 0xf64(0x04)
	enum class ENoiseLevel _aiNoiseLevel; // 0xf68(0x01)
	char pad_F69[0xb]; // 0xf69(0x0b)
	struct FVector _aiNoiseOffset; // 0xf74(0x0c)
	char pad_F80[0x8]; // 0xf80(0x08)
	struct FNavAgentSelector _supportedNavAgents; // 0xf88(0x04)
	char pad_F8C[0x1c]; // 0xf8c(0x1c)
	struct UParticleSystem* _smokeParticlesLow; // 0xfa8(0x08)
	struct UParticleSystem* _smokeParticlesMedium; // 0xfb0(0x08)
	struct UParticleSystem* _smokeParticlesHigh; // 0xfb8(0x08)
	char pad_FC0[0x8]; // 0xfc0(0x08)
	struct UParticleSystemComponent* _smokeParticleSystemComponent; // 0xfc8(0x08)
	struct FVector _smokeParticlesOffset; // 0xfd0(0x0c)
	bool _shouldVehicleBurnWhenDestroyed; // 0xfdc(0x01)
	char pad_FDD[0x3]; // 0xfdd(0x03)
	struct FHeatSourceParameters _transientHeatSourceParameters; // 0xfe0(0x24)
	struct FVector _transientHeatSourceOffset; // 0x1004(0x0c)
	char pad_1010[0x8]; // 0x1010(0x08)
	enum class EConZPxDominanceGroup _physicsDominanceGroup; // 0x1018(0x01)
	char pad_1019[0x7]; // 0x1019(0x07)
	struct TArray<struct FGameplayTag> _mountSlotsBySwitchSeatIndex; // 0x1020(0x10)
	struct TArray<struct UBaseMountPathBlocker*> _mountPathBlockers; // 0x1030(0x10)
	struct FGameplayTag _toggleMainLightsDeviceControlTag; // 0x1040(0x08)
	struct FGameplayTag _toggleRadioDeviceControlTag; // 0x1048(0x08)
	struct FGameplayTag _changeRadioStationDeviceControlTag; // 0x1050(0x08)
	struct FGameplayTag _increaseRadioVolumeDeviceControlTag; // 0x1058(0x08)
	struct FGameplayTag _decreaseRadioVolumeDeviceControlTag; // 0x1060(0x08)
	char pad_1068[0x8]; // 0x1068(0x08)
	struct FTransform _unlockTransform; // 0x1070(0x30)
	float _forceUnlockMovementAcceptanceRadius; // 0x10a0(0x04)
	float _absoluteSpeedLimitKmh; // 0x10a4(0x04)
	enum class EAITeam _aiTeam; // 0x10a8(0x01)
	char pad_10A9[0x67]; // 0x10a9(0x67)
	struct FVehicleDamageHandlerParams _damageHandlerParams; // 0x1110(0x10)
	struct TMap<enum class ECollisionDamageType, float> _damageRatios; // 0x1120(0x50)
	float _explosionDamageRatio; // 0x1170(0x04)
	float _minCollisionDamageThatCausesKnockout; // 0x1174(0x04)
	struct FRuntimeFloatCurve _passengerDamageVsCollisionDamage; // 0x1178(0x88)
	float _collisionDamageKnockoutDuration; // 0x1200(0x04)
	float _spawnGracePeriod; // 0x1204(0x04)
	float _postServiceGracePeriod; // 0x1208(0x04)
	char pad_120C[0x14]; // 0x120c(0x14)
	struct TArray<char> _damageHandlerSerializedData; // 0x1220(0x10)
	char pad_1230[0x28]; // 0x1230(0x28)
	struct APrisoner* _driver; // 0x1258(0x08)
	struct APrisoner* _driverRep; // 0x1260(0x08)
	char pad_1268[0x10]; // 0x1268(0x10)
	float _additionalMassPhysicsMultiplier; // 0x1278(0x04)
	char pad_127C[0x21]; // 0x127c(0x21)
	bool _canFlyingViolationChecksBeMade; // 0x129d(0x01)
	char pad_129E[0x52]; // 0x129e(0x52)

	void Server_CollideWithVehicle(struct FGameplayTag myRegion, struct AVehicleBase* otherVehicle, struct FGameplayTag otherRegion, float impactSpeed); // Function ConZ.VehicleBase.Server_CollideWithVehicle // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x251efd0
	void Server_ApplyDamageToRegion(struct FGameplayTag region, float Damage, float armorPenetration, enum class ECollisionDamageType collisionDamageType); // Function ConZ.VehicleBase.Server_ApplyDamageToRegion // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x251ee80
	void Server_ApplyDamageToAttachment(struct UVehicleAttachment* Attachment, float Damage, float armorPenetration, enum class ECollisionDamageType collisionDamageType); // Function ConZ.VehicleBase.Server_ApplyDamageToAttachment // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x251ed30
	void OnRep_VehicleAttachments(); // Function ConZ.VehicleBase.OnRep_VehicleAttachments // (Final|Native|Private) // @ game+0x251ed10
	void OnRep_ServiceComponent(); // Function ConZ.VehicleBase.OnRep_ServiceComponent // (Final|Native|Private) // @ game+0x251ecf0
	void OnRep_ServerEntitySetupAndId(); // Function ConZ.VehicleBase.OnRep_ServerEntitySetupAndId // (Final|Native|Private) // @ game+0x251ecd0
	void OnRep_ItemContainer(); // Function ConZ.VehicleBase.OnRep_ItemContainer // (Final|Native|Private) // @ game+0x251ec20
	void OnRep_Driver(); // Function ConZ.VehicleBase.OnRep_Driver // (Final|Native|Private) // @ game+0x251ec00
	void NetMulticast_PlayInstantDestructionEffectsAtLocation(struct FVector Location); // Function ConZ.VehicleBase.NetMulticast_PlayInstantDestructionEffectsAtLocation // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x251eb70
};

// Class ConZ.DcxWheeledVehicle
// Size: 0x15a0 (Inherited: 0x12f0)
struct ADcxWheeledVehicle : AVehicleBase {
	char pad_12F0[0x28]; // 0x12f0(0x28)
	struct UDcxVehicleDriveComponent* _driveComponent; // 0x1318(0x08)
	struct UVehicleDoorsComponent* _doorsComponent; // 0x1320(0x08)
	struct UDcxWheeledVehicleEffectsComponent* _effectsComponent; // 0x1328(0x08)
	char pad_1330[0x40]; // 0x1330(0x40)
	struct FGameplayTag _ignitionStartEventDeviceControlTag; // 0x1370(0x08)
	struct FGameplayTag _ignitionEndEventDeviceControlTag; // 0x1378(0x08)
	struct FGameplayTag _brakeLightsEnableDeviceControlTag; // 0x1380(0x08)
	struct FGameplayTag _brakeLightsDisableDeviceControlTag; // 0x1388(0x08)
	struct FGameplayTag _reverseLightsEnableDeviceControlTag; // 0x1390(0x08)
	struct FGameplayTag _reverseLightsDisableDeviceControlTag; // 0x1398(0x08)
	char pad_13A0[0x4]; // 0x13a0(0x04)
	int32_t _minimumNumberOfWheelsToBeDriven; // 0x13a4(0x04)
	int32_t _minimumNumberOfWheelsToBePushed; // 0x13a8(0x04)
	float _minPushStartVelocity; // 0x13ac(0x04)
	float _minPushStartVelocityIgnition; // 0x13b0(0x04)
	char pad_13B4[0x4]; // 0x13b4(0x04)
	float _hornAiLoudness; // 0x13b8(0x04)
	char pad_13BC[0x4]; // 0x13bc(0x04)
	struct UAkAudioEvent* _hornStartAudioEvent; // 0x13c0(0x08)
	struct UAkAudioEvent* _hornStopAudioEvent; // 0x13c8(0x08)
	float _maxPushForce; // 0x13d0(0x04)
	char pad_13D4[0x4]; // 0x13d4(0x04)
	float _minPushForce; // 0x13d8(0x04)
	float _maxPushForcePerPusher; // 0x13dc(0x04)
	float _minPushStartForce; // 0x13e0(0x04)
	char pad_13E4[0x4]; // 0x13e4(0x04)
	struct UCurveFloat* _speedToPushForceCurve; // 0x13e8(0x08)
	float _maxLinearVelocityWhenPushing; // 0x13f0(0x04)
	float _maxTotalVelocityWhenPushingBeforeUnmount; // 0x13f4(0x04)
	float _maxAllowedDistanceFromPushStartingPlayer; // 0x13f8(0x04)
	char pad_13FC[0x4]; // 0x13fc(0x04)
	struct FRuntimeFloatCurve _pusherActionDifficultyVsSpeed; // 0x1400(0x88)
	struct FRuntimeFloatCurve _pusherBaseStrengthChangeRateSpeedInfluenceVsSpeed; // 0x1488(0x88)
	struct FRuntimeFloatCurve _pusherBaseConstitutionChangeRateModifierVsSpeed; // 0x1510(0x88)
	float _terminalVelocityConstant; // 0x1598(0x04)
	char pad_159C[0x4]; // 0x159c(0x04)

	void UpdateHandlingParametersOnClient(float WheelSteeringLerpSpeedMultiplier, float engineIgnitionDurationMultiplier, float engineIgnitionFailureChance, float gearboxGearChangeDelayMultiplier, float gearboxGearUpRatioMultiplier, float gearboxGearDownRatioMultiplier); // Function ConZ.DcxWheeledVehicle.UpdateHandlingParametersOnClient // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x23be850
};

// Class ConZ.DcxWheeledVehicle4W
// Size: 0x15b0 (Inherited: 0x15a0)
struct ADcxWheeledVehicle4W : ADcxWheeledVehicle {
	char pad_15A0[0x10]; // 0x15a0(0x10)
};

// Class ConZ.Airplane
// Size: 0x19f0 (Inherited: 0x15b0)
struct AAirplane : ADcxWheeledVehicle4W {
	char pad_15B0[0x18]; // 0x15b0(0x18)
	struct ULiftComponent* _physicsLiftComponent; // 0x15c8(0x08)
	struct TMap<enum class EAerodynamicSurfaceType, struct FAerodynamicSurfaceControlData> _aerodynamicSurfaceMap; // 0x15d0(0x50)
	char pad_1620[0x10]; // 0x1620(0x10)
	float _airFlowParticlesSpeedKmhThreshold; // 0x1630(0x04)
	float _reverseTaxiingForce; // 0x1634(0x04)
	float _maxReverseTaxiingVelocity; // 0x1638(0x04)
	float _airplaneHeightToStallInMeters; // 0x163c(0x04)
	float _propellerForce; // 0x1640(0x04)
	float _maxVelocity; // 0x1644(0x04)
	char pad_1648[0x8]; // 0x1648(0x08)
	float _inAirSweepDistance; // 0x1650(0x04)
	char pad_1654[0x8]; // 0x1654(0x08)
	struct FInt32Range _throttleLevelRange; // 0x165c(0x10)
	char pad_166C[0x4]; // 0x166c(0x04)
	struct FRuntimeFloatCurve _throttlePerLevel; // 0x1670(0x88)
	char pad_16F8[0x4]; // 0x16f8(0x04)
	float _throttleLerpAmount; // 0x16fc(0x04)
	char pad_1700[0x8]; // 0x1700(0x08)
	struct TMap<enum class ESkillLevel, float> _brakeLerpAmountPerSkillLevel; // 0x1708(0x50)
	char pad_1758[0x8]; // 0x1758(0x08)
	struct TMap<enum class ESkillLevel, float> _rollLerpAmountPerSkillLevel; // 0x1760(0x50)
	char pad_17B0[0x8]; // 0x17b0(0x08)
	struct TMap<enum class ESkillLevel, float> _yawLerpAmountPerSkillLevel; // 0x17b8(0x50)
	char pad_1808[0x8]; // 0x1808(0x08)
	struct TMap<enum class ESkillLevel, float> _pitchLerpAmountPerSkillLevel; // 0x1810(0x50)
	char pad_1860[0x8]; // 0x1860(0x08)
	struct TMap<enum class ESkillLevel, float> _controlResetLerpAmountPerSkillLevel; // 0x1868(0x50)
	char pad_18B8[0x8]; // 0x18b8(0x08)
	struct FRuntimeFloatCurve _handbrakeFactorVsVelocity; // 0x18c0(0x88)
	char pad_1948[0x8]; // 0x1948(0x08)
	struct FGameplayTagContainer _criticalAttachmentSlotTags; // 0x1950(0x20)
	float _damagePerSecondWhenMissingCriticalAttachments; // 0x1970(0x04)
	char pad_1974[0x4]; // 0x1974(0x04)
	struct UStaticMeshComponent* _propellerMesh; // 0x1978(0x08)
	struct UMaterialInterface* _propellerMaterial; // 0x1980(0x08)
	struct UMaterialInstanceDynamic* _propellerMaterialDynamic; // 0x1988(0x08)
	struct TArray<struct UObject*> _classesToIgnorePropellerDamage; // 0x1990(0x10)
	float _EMInterferenceMaxDisabledTime; // 0x19a0(0x04)
	char pad_19A4[0x4]; // 0x19a4(0x04)
	float _deathExplosionDamage; // 0x19a8(0x04)
	float _deathExplosionForce; // 0x19ac(0x04)
	float _deathExplosionInnerRadius; // 0x19b0(0x04)
	float _deathExplosionOuterRadius; // 0x19b4(0x04)
	struct FTargetTypeDamageMultiplier _explosionTargetTypeMultiplier; // 0x19b8(0x10)
	struct UAkAudioEvent* _deathExplosionAudioEvent; // 0x19c8(0x08)
	struct UParticleSystem* _deathExplosionParticleSystem; // 0x19d0(0x08)
	struct FVector _deathExplosionParticleSystemScale; // 0x19d8(0x0c)
	char pad_19E4[0xc]; // 0x19e4(0x0c)

	void OnPropellerHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComponent, struct FVector NormalImpulse, struct FHitResult& Hit); // Function ConZ.Airplane.OnPropellerHit // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x2343d30
};

// Class ConZ.DcxWheeledVehicleAnimInstance
// Size: 0xa80 (Inherited: 0xa50)
struct UDcxWheeledVehicleAnimInstance : UDcxVehicleAnimInstance {
	enum class EVehicleEngineState EngineState; // 0xa48(0x01)
	bool IsEngineRunning; // 0xa49(0x01)
	float EngineRpm; // 0xa4c(0x04)
	float EngineRpmInterpSpeed; // 0xa50(0x04)
	float MaxSteeringWheelSteerAngle; // 0xa54(0x04)
	float SteeringWheelSteerAngleInterpSpeed; // 0xa58(0x04)
	float CurrentSteeringWheelSteerAngle; // 0xa5c(0x04)
	struct TArray<float> DoorOpenPercentage; // 0xa60(0x10)
	struct TArray<float> DoorWindowOpenPercentage; // 0xa70(0x10)
};

// Class ConZ.AirplaneAnimInstance
// Size: 0xae0 (Inherited: 0xa80)
struct UAirplaneAnimInstance : UDcxWheeledVehicleAnimInstance {
	bool IsAnyoneMounted; // 0xa80(0x01)
	char pad_A81[0x3]; // 0xa81(0x03)
	float Speed; // 0xa84(0x04)
	float SpeedKph; // 0xa88(0x04)
	float PropellerRotationAngle; // 0xa8c(0x04)
	float RudderAngle; // 0xa90(0x04)
	bool IsMounteeDriver; // 0xa94(0x01)
	char pad_A95[0x3]; // 0xa95(0x03)
	float clockMinuteRotation; // 0xa98(0x04)
	float clockHourRotation; // 0xa9c(0x04)
	float altimeterTensRotation; // 0xaa0(0x04)
	float altimeterHundredsRotation; // 0xaa4(0x04)
	float altimeterThousandsRotation; // 0xaa8(0x04)
	float airSpeedRotation; // 0xaac(0x04)
	float rpmRotation; // 0xab0(0x04)
	float verticalSpeedRotation; // 0xab4(0x04)
	float throttleLeverRotation; // 0xab8(0x04)
	float leftYawPedalRotation; // 0xabc(0x04)
	float rightYawPedalRotation; // 0xac0(0x04)
	struct FRotator stickRotator; // 0xac4(0x0c)
	struct FRotator headingRotator; // 0xad0(0x0c)
	bool shouldHidePropellerBone; // 0xadc(0x01)
	char pad_ADD[0x3]; // 0xadd(0x03)
};

// Class ConZ.AirplaneLeftWingAnimInstance
// Size: 0x2c0 (Inherited: 0x2c0)
struct UAirplaneLeftWingAnimInstance : UAnimInstance {
	float LeftAileronsAngle; // 0x2b8(0x04)
};

// Class ConZ.AirplaneRightWingAnimInstance
// Size: 0x2c0 (Inherited: 0x2c0)
struct UAirplaneRightWingAnimInstance : UAnimInstance {
	float RightAileronsAngle; // 0x2b8(0x04)
};

// Class ConZ.AirplaneElevatorsAnimInstance
// Size: 0x2c0 (Inherited: 0x2c0)
struct UAirplaneElevatorsAnimInstance : UAnimInstance {
	float ElevatorsAngle; // 0x2b8(0x04)
};

// Class ConZ.AirplaneLegsFrontAnimInstance
// Size: 0x2e0 (Inherited: 0x2c0)
struct UAirplaneLegsFrontAnimInstance : UAnimInstance {
	float LeftWheelRotation; // 0x2b8(0x04)
	float RightWheelRotation; // 0x2bc(0x04)
	struct UDcxVehicleWheelsComponent* _vehicleWheels; // 0x2c0(0x08)
	struct FName _leftWheelDcxBoneName; // 0x2c8(0x08)
	struct FName _rightWheelDcxBoneName; // 0x2d0(0x08)
};

// Class ConZ.AirplaneLegsRearInstance
// Size: 0x2d0 (Inherited: 0x2c0)
struct UAirplaneLegsRearInstance : UAnimInstance {
	float RearWheelRotation; // 0x2b8(0x04)
	struct UDcxVehicleWheelsComponent* _vehicleWheels; // 0x2c0(0x08)
	struct FName _rearWheelDcxBoneName; // 0x2c8(0x08)
};

// Class ConZ.AIStatics
// Size: 0x28 (Inherited: 0x28)
struct UAIStatics : UBlueprintFunctionLibrary {
};

// Class ConZ.AkComponentClientOnly
// Size: 0x3d0 (Inherited: 0x3d0)
struct UAkComponentClientOnly : UAkComponent {
};

// Class ConZ.AmbientSounds
// Size: 0x2f8 (Inherited: 0x220)
struct AAmbientSounds : AActor {
	float MinCameraLocationDeltaForUpdate; // 0x220(0x04)
	struct FGameplayTag ForestMask; // 0x224(0x08)
	float ForestMaskSearchRadius; // 0x22c(0x04)
	struct UAkAudioEvent* CoastalForestAudioEvent; // 0x230(0x08)
	struct UAkAudioEvent* ContinentalForest1AudioEvent; // 0x238(0x08)
	struct UAkAudioEvent* ContinentalForest2AudioEvent; // 0x240(0x08)
	struct UAkAudioEvent* ContinentalForest3AudioEvent; // 0x248(0x08)
	struct UAkAudioEvent* UndergroundAudioEvent; // 0x250(0x08)
	struct FGameplayTag CityMask; // 0x258(0x08)
	float CityMaskSearchRadius; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct UAkAudioEvent* CityAudioEvent; // 0x268(0x08)
	struct UAkAudioEvent* LargeVillageAudioEvent; // 0x270(0x08)
	struct UAkAudioEvent* SmallVillageAudioEvent; // 0x278(0x08)
	struct UAkAudioEvent* IndustrialAreaAudioEvent; // 0x280(0x08)
	char pad_288[0x70]; // 0x288(0x70)
};

// Class ConZ.Item
// Size: 0x9b0 (Inherited: 0x220)
struct AItem : AActor {
	char pad_220[0x98]; // 0x220(0x98)
	struct FMulticastInlineDelegate DebugTextChanged; // 0x2b8(0x10)
	struct FMulticastInlineDelegate PickedUpState; // 0x2c8(0x10)
	struct FMulticastInlineDelegate OnStaticMeshChanged; // 0x2d8(0x10)
	char pad_2E8[0x28]; // 0x2e8(0x28)
	struct UStaticMeshComponent* Mesh; // 0x310(0x08)
	char pad_318[0x110]; // 0x318(0x110)
	struct FGenericTeamId _genericTeamId; // 0x428(0x10)
	struct UThrowingComponent* ThrowingComponent; // 0x438(0x08)
	struct FText _caption; // 0x440(0x18)
	struct FText _description; // 0x458(0x18)
	int32_t _uses; // 0x470(0x04)
	float _health; // 0x474(0x04)
	float _maxHealth; // 0x478(0x04)
	float _maxHealthPercentageAfterReachingBadQuality; // 0x47c(0x04)
	float _weight; // 0x480(0x04)
	float _initialWeightUsed; // 0x484(0x04)
	float _maxWaterWeightAsRatioOfWeight; // 0x488(0x04)
	float _radiationDecreaseRate; // 0x48c(0x04)
	float _maxRadiationAmountPerWeight; // 0x490(0x04)
	float _baseRadiationPropagationFactor; // 0x494(0x04)
	bool _canEverDecontaminate; // 0x498(0x01)
	char pad_499[0x7]; // 0x499(0x07)
	struct UChoppingRecipeDataAsset* _choppingRecipeDataAsset; // 0x4a0(0x08)
	bool _shouldBeMaintained; // 0x4a8(0x01)
	bool _canBeDropped; // 0x4a9(0x01)
	bool _canTakeInHands; // 0x4aa(0x01)
	bool _canBeVisibleInVicinity; // 0x4ab(0x01)
	bool _canPlaceItemsOn; // 0x4ac(0x01)
	enum class EItemBlueprintPlacementBlockingType _blueprintPlacementBlockingType; // 0x4ad(0x01)
	char pad_4AE[0x2]; // 0x4ae(0x02)
	struct TArray<struct TSoftClassPtr<UObject>> _blacklistedPlacementItems; // 0x4b0(0x10)
	bool _canPlaceBlueprintsOn; // 0x4c0(0x01)
	char pad_4C1[0x7]; // 0x4c1(0x07)
	struct USkeletalMesh* _overrideSkeletalMesh; // 0x4c8(0x08)
	struct FTransform _overrideSkeletalMeshRelativeTransform; // 0x4d0(0x30)
	enum class EItemExhausted _ifExhausted; // 0x500(0x01)
	char pad_501[0x3]; // 0x501(0x03)
	float _resourceAmountUsedPerWash; // 0x504(0x04)
	bool _shouldDoServerCheckBeforeDropping; // 0x508(0x01)
	bool _shouldBlockVisibilityForAISight; // 0x509(0x01)
	enum class EDeluxeVersion _requiredDLC; // 0x50a(0x01)
	char pad_50B[0x5]; // 0x50b(0x05)
	struct TSoftObjectPtr<UTexture2D> _inventoryIcon; // 0x510(0x28)
	struct TSoftObjectPtr<UTexture2D> _inventoryIconInHands; // 0x538(0x28)
	struct TSoftObjectPtr<UTexture2D> _outsideInventoryIcon; // 0x560(0x28)
	uint32_t _sizeX; // 0x588(0x04)
	uint32_t _sizeY; // 0x58c(0x04)
	struct TArray<struct UBaseItemTag*> _inventoryWhiteList; // 0x590(0x10)
	struct TArray<struct UBaseItemTag*> _inventoryBlackList; // 0x5a0(0x10)
	float _maxContainedWeight; // 0x5b0(0x04)
	bool _canContainNonEmptyItems; // 0x5b4(0x01)
	bool _canBeContainedIfNonEmpty; // 0x5b5(0x01)
	char pad_5B6[0x2]; // 0x5b6(0x02)
	struct UUIRepresentationSubobject* _uiRepresentationSubobject; // 0x5b8(0x08)
	struct UUIContainerSubobject* _uiContainerSubobject; // 0x5c0(0x08)
	bool _isIgnoredBySpawners; // 0x5c8(0x01)
	char pad_5C9[0x3]; // 0x5c9(0x03)
	struct FFloatInterval _spawnTimeoutPerPlayer; // 0x5cc(0x08)
	struct FItemLocation _itemLocation; // 0x5d4(0x0f)
	enum class EItemRarity _rarity; // 0x5e3(0x01)
	char pad_5E4[0x4]; // 0x5e4(0x04)
	struct FGameplayTagContainer _itemSpawnTypes; // 0x5e8(0x20)
	struct FGameplayTag _itemSpawnGroup; // 0x608(0x08)
	struct FVector _spawnLocationOffset; // 0x610(0x0c)
	struct FRotator _spawnRotationOffset; // 0x61c(0x0c)
	float _spawnRotationRandomization; // 0x628(0x04)
	float _placementCollisionUpOffset; // 0x62c(0x04)
	bool _shouldOverrideUsageWhenSpawnedBySpawners; // 0x630(0x01)
	char pad_631[0x3]; // 0x631(0x03)
	float _initialUsageWhenSpawnedBySpawners; // 0x634(0x04)
	float _randomizeUsageWhenSpawnedBySpawners; // 0x638(0x04)
	char pad_63C[0x4]; // 0x63c(0x04)
	struct TArray<struct UBaseItemTag*> _itemTags; // 0x640(0x10)
	struct TArray<struct UBaseItemTag*> _ownedItemTags; // 0x650(0x10)
	enum class ENoiseLevel _noiseLevel; // 0x660(0x01)
	char pad_661[0x7]; // 0x661(0x07)
	struct FItemMotionNoise _motionNoise; // 0x668(0x08)
	struct UAkAudioEvent* _inventoryHandlingSound; // 0x670(0x08)
	struct UAkAudioEvent* _destroyedSound; // 0x678(0x08)
	struct TArray<struct FCraftingPart> _defaultCraftingParts; // 0x680(0x10)
	float _damageOnUse; // 0x690(0x04)
	float _damageOverTime; // 0x694(0x04)
	float _autoDestructTime; // 0x698(0x04)
	bool _allowContainedItemsDecay; // 0x69c(0x01)
	char pad_69D[0x7]; // 0x69d(0x07)
	bool _shouldDestroyContainedItemsOnDestroyEvent; // 0x6a4(0x01)
	char pad_6A5[0x3]; // 0x6a5(0x03)
	float _minTemperatureForHeatDamage; // 0x6a8(0x04)
	float _containedDamageStartPercentage; // 0x6ac(0x04)
	float _damageResponseFactor; // 0x6b0(0x04)
	char pad_6B4[0x4]; // 0x6b4(0x04)
	struct UAttachmentSocketMountType* _attachmentSocketMountType; // 0x6b8(0x08)
	struct TArray<struct FAttachmentSocket> _attachmentSockets; // 0x6c0(0x10)
	struct UAttachmentSocketMountType* _holsterAttachmentSocketMountType; // 0x6d0(0x08)
	struct TMap<struct UAttachmentSocketMountType*, struct FAttachmentSocketOffset> _attachmentSocketsOffset; // 0x6d8(0x50)
	bool _enableGlowOnBeginPlay; // 0x728(0x01)
	bool _enableAwarenessGlow; // 0x729(0x01)
	bool _enableHoverGlow; // 0x72a(0x01)
	char pad_72B[0x5]; // 0x72b(0x05)
	struct UStaticMesh* _placementMeshOverride; // 0x730(0x08)
	struct UStaticMesh* _staticMeshHolsterOverride; // 0x738(0x08)
	struct USkeletalMesh* _skeletalMeshHolsterOverride; // 0x740(0x08)
	bool _hasHighLoadPriorityInVirtualization; // 0x748(0x01)
	char pad_749[0x3]; // 0x749(0x03)
	float _virtualizationDistanceOffset; // 0x74c(0x04)
	bool _canEverBeVirtualized; // 0x750(0x01)
	bool _shouldBeRemovedFromVirtualizationOnOwnerSet; // 0x751(0x01)
	char pad_752[0x2]; // 0x752(0x02)
	float _resultHealthMultiplierWhenCraftingIngredient; // 0x754(0x04)
	float _preferredDamagePerUpdate; // 0x758(0x04)
	bool _useHandCorrections; // 0x75c(0x01)
	char pad_75D[0x3]; // 0x75d(0x03)
	float _vicinityCheckDistance; // 0x760(0x04)
	float _reachabilityTestZOffset; // 0x764(0x04)
	struct TArray<struct UObject*> _stackableClasses; // 0x768(0x10)
	int32_t _maxNumOfStacks; // 0x778(0x04)
	float _bloodDryingSpeed; // 0x77c(0x04)
	struct TArray<struct FCraftingIngredientInstance> _craftingIngredientInstances; // 0x780(0x10)
	struct USkeletalMeshComponent* _skeletalMeshComponent; // 0x790(0x08)
	char pad_798[0x4]; // 0x798(0x04)
	float _weightUsed; // 0x79c(0x04)
	char pad_7A0[0x18]; // 0x7a0(0x18)
	struct FPackedEntitySetupAndId _repServerEntitySetupAndId; // 0x7b8(0x08)
	struct TArray<struct UItemComponent*> _itemComponents; // 0x7c0(0x10)
	struct AActor* _attachParentObject; // 0x7d0(0x08)
	struct FVisibilityReplication _visibilityReplication; // 0x7d8(0x08)
	char pad_7E0[0x48]; // 0x7e0(0x48)
	float _radiationAmount; // 0x828(0x04)
	float _uncraftTime; // 0x82c(0x04)
	uint64_t _replicatedState; // 0x830(0x08)
	char pad_838[0x1]; // 0x838(0x01)
	char _flagsReplicated; // 0x839(0x01)
	char pad_83A[0x26]; // 0x83a(0x26)
	struct UItemRootComponent* _rootComponent; // 0x860(0x08)
	char pad_868[0x8]; // 0x868(0x08)
	int64_t _expirationTime; // 0x870(0x08)
	struct TArray<struct FInventoryStackData> _stacks; // 0x878(0x10)
	struct AItem* _stackExhaustedSuccessorItem; // 0x888(0x08)
	struct TScriptInterface<IInventoryContainer> _parentContainer; // 0x890(0x10)
	struct TScriptInterface<IInventoryNode> _parentInventoryNode; // 0x8a0(0x10)
	char pad_8B0[0x70]; // 0x8b0(0x70)
	struct TArray<struct FCraftingPart> _craftingParts; // 0x920(0x10)
	char pad_930[0x3c]; // 0x930(0x3c)
	struct FName _survivalTipToShowOnPickup; // 0x96c(0x08)
	struct FName _survivalTipToShowOnEquip; // 0x974(0x08)
	char pad_97C[0x34]; // 0x97c(0x34)

	void UpdateVisuals(bool shouldHandleAging); // Function ConZ.Item.UpdateVisuals // (Native|Public) // @ game+0x240b830
	void StopBlinking(); // Function ConZ.Item.StopBlinking // (Final|Native|Public) // @ game+0x240b810
	void StaticMeshChangedDelegate__DelegateSignature(struct AItem* Item); // DelegateFunction ConZ.Item.StaticMeshChangedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x297fc00
	void StateChangedDelegate__DelegateSignature(struct AItem* Item); // DelegateFunction ConZ.Item.StateChangedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x297fc00
	void SetInventoryIconInHands(struct TSoftObjectPtr<UTexture2D> Value); // Function ConZ.Item.SetInventoryIconInHands // (Final|Native|Public|BlueprintCallable) // @ game+0x240b700
	void SetInventoryIcon(struct TSoftObjectPtr<UTexture2D> Value); // Function ConZ.Item.SetInventoryIcon // (Final|Native|Public|BlueprintCallable) // @ game+0x240b5f0
	void SetHealth(float health); // Function ConZ.Item.SetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x240b570
	void Server_Throw(struct FVector ZeroBasedStartPosition, struct FRotator StartRotation, struct FVector StartVelocity); // Function ConZ.Item.Server_Throw // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0x240b470
	void PickedUpStateDelegate__DelegateSignature(struct AItem* Item, bool pickedUp); // DelegateFunction ConZ.Item.PickedUpStateDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x297fc00
	void OnRightClicked(); // Function ConZ.Item.OnRightClicked // (Final|Native|Private) // @ game+0xbbc480
	void OnRep_WeightUsed(); // Function ConZ.Item.OnRep_WeightUsed // (Native|Protected) // @ game+0x240b450
	void OnRep_Visibility(); // Function ConZ.Item.OnRep_Visibility // (Native|Protected) // @ game+0x240b430
	void OnRep_Stacks(); // Function ConZ.Item.OnRep_Stacks // (Final|Native|Private) // @ game+0xbbc480
	void OnRep_ServerEntitySetupAndId(); // Function ConZ.Item.OnRep_ServerEntitySetupAndId // (Native|Protected) // @ game+0x240b410
	void OnRep_ReplicatedState(); // Function ConZ.Item.OnRep_ReplicatedState // (Final|Native|Private) // @ game+0x240b3f0
	void OnRep_Health(); // Function ConZ.Item.OnRep_Health // (Native|Protected) // @ game+0x240b3d0
	void OnRep_FlagsReplicated(); // Function ConZ.Item.OnRep_FlagsReplicated // (Final|Native|Private) // @ game+0x240b3b0
	void OnDetachedFromItem(struct AItem* Item); // Function ConZ.Item.OnDetachedFromItem // (Native|Event|Protected|BlueprintEvent) // @ game+0x23e73f0
	void OnDestroyedEvent(struct AActor* Self); // Function ConZ.Item.OnDestroyedEvent // (Native|Public) // @ game+0x240b200
	void OnContainedItemDestroyed(struct AActor* containedItem); // Function ConZ.Item.OnContainedItemDestroyed // (Final|Native|Public) // @ game+0x240b170
	void OnAttachedToItem(struct AItem* Item); // Function ConZ.Item.OnAttachedToItem // (Native|Event|Protected|BlueprintEvent) // @ game+0x15377a0
	void NetMulticast_SpawnDestroyedEffects(); // Function ConZ.Item.NetMulticast_SpawnDestroyedEffects // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x236c4d0
	void NetMulticast_SpawnAndInteractOnOwningClient(struct APrisoner* User, enum class EInteractionType interactionType, struct FInteractionData InteractionData); // Function ConZ.Item.NetMulticast_SpawnAndInteractOnOwningClient // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x240afd0
	void NetMulticast_EnsureSpawned(); // Function ConZ.Item.NetMulticast_EnsureSpawned // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x15376c0
	void NetMulticast_Drop(struct APawn* dropper, bool wasThrown, bool dropDown, bool resetRotation); // Function ConZ.Item.NetMulticast_Drop // (Net|Native|Event|NetMulticast|Public) // @ game+0x240ae60
	void Multicast_Throw(struct FVector ZeroBasedStartPosition, struct FRotator StartRotation, struct FVector StartVelocity); // Function ConZ.Item.Multicast_Throw // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x240ad60
	bool HasPriorityForContainerItem(struct AItem* containerItem); // Function ConZ.Item.HasPriorityForContainerItem // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x240acc0
	struct FWidgetDisplayInfo GetWidgetDisplayInfo(); // Function ConZ.Item.GetWidgetDisplayInfo // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x240ac80
	float GetWaterWeight(); // Function ConZ.Item.GetWaterWeight // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x240ac40
	float GetTotalWeight(); // Function ConZ.Item.GetTotalWeight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x240ac10
	struct FVector GetSupportingHandIKLocation(); // Function ConZ.Item.GetSupportingHandIKLocation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x240abd0
	enum class EPrisonerAnimationSet GetPrisonerAnimationSet(); // Function ConZ.Item.GetPrisonerAnimationSet // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x240aba0
	struct TSoftObjectPtr<UTexture2D> GetOutsideInventoryIcon(); // Function ConZ.Item.GetOutsideInventoryIcon // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x240ab30
	struct UMeshComponent* GetMeshComponent(); // Function ConZ.Item.GetMeshComponent // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x240ab00
	float GetMaxHealth(); // Function ConZ.Item.GetMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x240aad0
	struct TSoftObjectPtr<UTexture2D> GetInventoryIconInHands(); // Function ConZ.Item.GetInventoryIconInHands // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x240aa60
	struct TSoftObjectPtr<UTexture2D> GetInventoryIcon(); // Function ConZ.Item.GetInventoryIcon // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x240a9f0
	bool GetIgnoreSupportingHandIK(); // Function ConZ.Item.GetIgnoreSupportingHandIK // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x240a9c0
	float GetHealth(); // Function ConZ.Item.GetHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x240a990
	struct FText GetDescription(); // Function ConZ.Item.GetDescription // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x240a950
	struct FCharacterAndItemAnimation FindCharacterAndItemAnimation(struct UObject* Context, enum class EPrisonerMontage prisonerMontageType); // Function ConZ.Item.FindCharacterAndItemAnimation // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x240a870
	struct UAnimMontage* FindAnimationMontage(struct UObject* Context, enum class EPrisonerMontage prisonerMontageType); // Function ConZ.Item.FindAnimationMontage // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x240a7a0
	bool DropAround(struct AActor* Actor, struct APawn* dropper, float zOffset); // Function ConZ.Item.DropAround // (Final|Native|Public|BlueprintCallable) // @ game+0x240a680
	void DestroyInternal(); // Function ConZ.Item.DestroyInternal // (Native|Protected|BlueprintCallable) // @ game+0x240a660
	void DebugTextChangedDelegate__DelegateSignature(struct AItem* Item); // DelegateFunction ConZ.Item.DebugTextChangedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x297fc00
	bool CanBeMeleeWeapon(); // Function ConZ.Item.CanBeMeleeWeapon // (Native|Event|Public|BlueprintEvent|Const) // @ game+0xaceaf0
	bool CanBeCraftedByCharactrer(struct ACharacter* Character); // Function ConZ.Item.CanBeCraftedByCharactrer // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x240a5c0
	bool CanAutoAddItem(struct AItem* Item, char& column, char& row); // Function ConZ.Item.CanAutoAddItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x240a490
	bool AutoAddItemToInventoryNode(struct TScriptInterface<IInventoryNode> Item); // Function ConZ.Item.AutoAddItemToInventoryNode // (Native|Public|BlueprintCallable) // @ game+0x240a3e0
};

// Class ConZ.AmmunitionItem
// Size: 0xa00 (Inherited: 0x9b0)
struct AAmmunitionItem : AItem {
	struct FGameplayTag AmmunitionTag; // 0x9a8(0x08)
	struct FString AmmunitionTypeString; // 0x9b0(0x10)
	struct AProjectile* projectileClass; // 0x9c0(0x08)
	struct UStaticMesh* CartridgeMesh; // 0x9c8(0x08)
	struct UStaticMesh* CasingMesh; // 0x9d0(0x08)
	struct UStaticMesh* UsedBadRoundMesh; // 0x9d8(0x08)
	float WeaponSpreadMultiplier; // 0x9e0(0x04)
	int32_t MaxAmmoCount; // 0x9e4(0x04)
	int32_t _ammoCount; // 0x9e8(0x04)
	int32_t _ammoCountOwnerHelper; // 0x9ec(0x04)
	char pad_9F8[0x8]; // 0x9f8(0x08)

	void SetAmmoCount(int32_t Count, enum class ERPCType broadcastRPCType); // Function ConZ.AmmunitionItem.SetAmmoCount // (Final|Native|Public|BlueprintCallable) // @ game+0x2347130
	void OnRep_AmmoCountOwnerHelper(); // Function ConZ.AmmunitionItem.OnRep_AmmoCountOwnerHelper // (Final|Native|Private) // @ game+0x2347010
	void OnRep_AmmoCount(); // Function ConZ.AmmunitionItem.OnRep_AmmoCount // (Final|Native|Private|Const) // @ game+0x2346ff0
	void NetMulticast_SetAmmoCount(int32_t Count); // Function ConZ.AmmunitionItem.NetMulticast_SetAmmoCount // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2346f60
	float GetSpreadMultiplierForWeapon(struct AWeapon* Weapon); // Function ConZ.AmmunitionItem.GetSpreadMultiplierForWeapon // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2346e40
	int32_t GetAmmoCount(); // Function ConZ.AmmunitionItem.GetAmmoCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2346e10
	void Client_SetAmmoCount(int32_t Count); // Function ConZ.AmmunitionItem.Client_SetAmmoCount // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x2346d50
};

// Class ConZ.AmmunitionArrow
// Size: 0xa20 (Inherited: 0xa00)
struct AAmmunitionArrow : AAmmunitionItem {
	bool DestroyOnHit; // 0x9f8(0x01)
	struct ABrokenArrow* BrokenArrowClass; // 0xa00(0x08)
	float _muzzleVelocityMultiplier; // 0xa08(0x04)
	float _stiffnessFactor; // 0xa0c(0x04)
	float _flightRotationCorrectionSpeed; // 0xa10(0x04)
	float _elasticityFactorSpread; // 0xa14(0x04)
	char pad_A19[0x7]; // 0xa19(0x07)
};

// Class ConZ.AmmunitionBoneListAssetData
// Size: 0x38 (Inherited: 0x28)
struct UAmmunitionBoneListAssetData : UAssetUserData {
	struct TArray<struct FName> CartridgeBoneNames; // 0x28(0x10)
};

// Class ConZ.AmmunitionBoxItem
// Size: 0x9c0 (Inherited: 0x9b0)
struct AAmmunitionBoxItem : AItem {
	struct AAmmunitionItem* AmmunitionItemClass; // 0x9a8(0x08)
	int32_t MaxAmmoCount; // 0x9b0(0x04)
	int32_t _ammoCount; // 0x9b4(0x04)

	void OnRep_AmmoCount(); // Function ConZ.AmmunitionBoxItem.OnRep_AmmoCount // (Final|Native|Private) // @ game+0x2346ff0
};

// Class ConZ.AmmunitionExplosiveArrow
// Size: 0xa80 (Inherited: 0xa20)
struct AAmmunitionExplosiveArrow : AAmmunitionArrow {
	struct UAkAudioEvent* _startBeepingEvent; // 0xa18(0x08)
	struct UAkAudioEvent* _stopBeepingEvent; // 0xa20(0x08)
	float _startOfBeepingBeforeDetonation; // 0xa28(0x04)
	float _innerExplosionRadius; // 0xa2c(0x04)
	float _outerExplosionRadius; // 0xa30(0x04)
	float _explosionBaseDamage; // 0xa34(0x04)
	float _explosionMinDamage; // 0xa38(0x04)
	float _explosionDistanceFalloff; // 0xa3c(0x04)
	float _explosionTimerTime; // 0xa40(0x04)
	float _explosionForce; // 0xa44(0x04)
	struct FTargetTypeDamageMultiplier _targetTypeMultiplier; // 0xa48(0x10)
	struct FName _detonationPointSocketName; // 0xa58(0x08)
	struct AReplicatedExplosionEffectsActor* _effectsActorClass; // 0xa60(0x08)
	char pad_A70[0x8]; // 0xa70(0x08)
	bool _shouldStartCountdown; // 0xa78(0x01)
	char pad_A79[0x7]; // 0xa79(0x07)

	void Server_Explode(); // Function ConZ.AmmunitionExplosiveArrow.Server_Explode // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2347110
};

// Class ConZ.ConZCharacter
// Size: 0x830 (Inherited: 0x4d0)
struct AConZCharacter : ACharacter {
	char pad_4D0[0x70]; // 0x4d0(0x70)
	struct UChoppingRecipeDataAsset* ChoppingRecipeDataAsset; // 0x540(0x08)
	bool IterativeChopping; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)
	struct AItem* ItemRepresentation; // 0x550(0x08)
	struct FName HeadBoneName; // 0x558(0x08)
	struct TMap<struct FName, enum class EBodyPart> BodyPartByBoneName; // 0x560(0x50)
	float HeadHeight; // 0x5b0(0x04)
	float TorsoHeight; // 0x5b4(0x04)
	bool ShouldAutoUpdateEnvironmentDescription; // 0x5b8(0x01)
	char pad_5B9[0x3]; // 0x5b9(0x03)
	float EnvironmentDescriptionAutoUpdateInterval; // 0x5bc(0x04)
	struct UAkAudioEvent* EnteredIndoorEnvironmentAudioEvent; // 0x5c0(0x08)
	struct UAkAudioEvent* EnteredOutdoorEnvironmentAudioEvent; // 0x5c8(0x08)
	struct UAkAudioEvent* EnteredUndergroundAudioEvent; // 0x5d0(0x08)
	struct UAkAudioEvent* LeftUndergroundAudioEvent; // 0x5d8(0x08)
	char pad_5E0[0x18]; // 0x5e0(0x18)
	struct UVoiceChatComponent* VoiceChatComponent; // 0x5f8(0x08)
	char pad_600[0x8]; // 0x600(0x08)
	float _kockoutChanceModifier; // 0x608(0x04)
	enum class EConZGender _gender; // 0x60c(0x01)
	char pad_60D[0x3]; // 0x60d(0x03)
	struct FGenericTeamId _genericTeamId; // 0x610(0x10)
	struct UCharacterSoundComponent* SoundComponent; // 0x620(0x08)
	char pad_628[0x38]; // 0x628(0x38)
	enum class EConZPxDominanceGroup _physicsDominanceGroup; // 0x660(0x01)
	char pad_661[0x3]; // 0x661(0x03)
	float _activeHitTimeToLive; // 0x664(0x04)
	struct UCurveFloat* _hitDamageVsVehicleSpeedInKph; // 0x668(0x08)
	struct FHitEffects _effectsOnVehicleHit[0x5]; // 0x670(0x118)
	char pad_788[0x10]; // 0x788(0x10)
	bool _allowMultipleDamageReportsFromProjectile; // 0x798(0x01)
	char pad_799[0x7]; // 0x799(0x07)
	struct UPhysicsAsset* _physicsAssetOnServer; // 0x7a0(0x08)
	enum class EAITeam _aiTeam; // 0x7a8(0x01)
	char pad_7A9[0x7]; // 0x7a9(0x07)
	struct TArray<struct UCharacterAction*> _actionsList; // 0x7b0(0x10)
	char pad_7C0[0x24]; // 0x7c0(0x24)
	float _characterActionPlayRateMultiplier; // 0x7e4(0x04)
	struct UGrappleActionComponent* _grappleActionComponent; // 0x7e8(0x08)
	bool _isSubjectToEncounterManager; // 0x7f0(0x01)
	bool _isPartOfHorde; // 0x7f1(0x01)
	char pad_7F2[0x1]; // 0x7f2(0x01)
	bool _canReceiveForcedStimulusAfterHordeActivation; // 0x7f3(0x01)
	bool _canLeaveOnEncounterEnd; // 0x7f4(0x01)
	char pad_7F5[0x3]; // 0x7f5(0x03)
	float _rogueCharacterRemovalDistance; // 0x7f8(0x04)
	char pad_7FC[0x10]; // 0x7fc(0x10)
	bool _shouldPerformLoadedLevelsCheck; // 0x80c(0x01)
	char pad_80D[0x1]; // 0x80d(0x01)
	enum class ECharacterHiddenSpawnType _hiddenSpawnType; // 0x80e(0x01)
	char pad_80F[0x1]; // 0x80f(0x01)
	float _fadeTime; // 0x810(0x04)
	bool _canUseDoorNavlink; // 0x814(0x01)
	bool _canOpenLockedDoors; // 0x815(0x01)
	bool _canOpenUnpoweredDoors; // 0x816(0x01)
	bool _canUseWindowNavlink; // 0x817(0x01)
	char pad_818[0x18]; // 0x818(0x18)

	void SetGender(enum class EConZGender Value); // Function ConZ.ConZCharacter.SetGender // (Final|Native|Public|BlueprintCallable) // @ game+0x23921c0
	void SetEnvironmentDescription(struct FEnvironmentDescription& Value); // Function ConZ.ConZCharacter.SetEnvironmentDescription // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2392120
	void Server_SetEnvironmentDescription(struct FEnvironmentDescription Value); // Function ConZ.ConZCharacter.Server_SetEnvironmentDescription // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2392000
	void Server_RequestCharacterAction(struct FCharacterActionReplicationHelper Value); // Function ConZ.ConZCharacter.Server_RequestCharacterAction // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2391f70
	void Server_HandleMeleeAttackCapsuleHit(struct AConZCharacter* attacker, struct FMeleeAttackCapsuleHitInfo HitInfo); // Function ConZ.ConZCharacter.Server_HandleMeleeAttackCapsuleHit // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2391e30
	void Server_CharacterActionAck(struct FCharacterActionAck ack); // Function ConZ.ConZCharacter.Server_CharacterActionAck // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2391da0
	void OnRep_HiddenSpawnType(); // Function ConZ.ConZCharacter.OnRep_HiddenSpawnType // (Final|Native|Private) // @ game+0x2391d60
	void OnRep_GrappleActionComponent(); // Function ConZ.ConZCharacter.OnRep_GrappleActionComponent // (Final|Native|Private) // @ game+0x2391d40
	void OnRep_Gender(enum class EConZGender oldGender); // Function ConZ.ConZCharacter.OnRep_Gender // (Final|Native|Private) // @ game+0x2391cc0
	void NetMulticast_RequestCharacterAction(struct FCharacterActionReplicationHelper Value, int32_t characterActionSet, bool ignoreAutonomousProxy); // Function ConZ.ConZCharacter.NetMulticast_RequestCharacterAction // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2391530
	void NetMulticast_PlayAudioEventWithTag(struct FGameplayTag audioEventTag); // Function ConZ.ConZCharacter.NetMulticast_PlayAudioEventWithTag // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x23914a0
	void NetMulticast_HandleMeleeAttackCapsuleHit(struct AConZCharacter* attacker, struct FMeleeAttackCapsuleHitInfo HitInfo); // Function ConZ.ConZCharacter.NetMulticast_HandleMeleeAttackCapsuleHit // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2391360
	void NetMulticast_CharacterActionAck(struct FCharacterActionAck ack, bool ignoreAutonomousProxy); // Function ConZ.ConZCharacter.NetMulticast_CharacterActionAck // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2391280
	bool IsHeadBone(struct FName BoneName); // Function ConZ.ConZCharacter.IsHeadBone // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x23911b0
	bool IsConscious(); // Function ConZ.ConZCharacter.IsConscious // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2391180
	bool IsAlive(); // Function ConZ.ConZCharacter.IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2391150
	bool HasCharacterAction(); // Function ConZ.ConZCharacter.HasCharacterAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2391120
	struct UCharacterSoundComponent* GetSoundComponent(); // Function ConZ.ConZCharacter.GetSoundComponent // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2390f80
	enum class EDetectHitCollisionType GetHitReactBodyPartFromHitResult(struct FHitResult& HitResult); // Function ConZ.ConZCharacter.GetHitReactBodyPartFromHitResult // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x2390dc0
	enum class EDetectHitCollisionType GetHitReactBodyPartFromBodyPart(enum class EBodyPart Value); // Function ConZ.ConZCharacter.GetHitReactBodyPartFromBodyPart // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2390d30
	enum class EConZGender GetGender(); // Function ConZ.ConZCharacter.GetGender // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2390d00
	struct FEnvironmentDescription GetEnvironmentDescription(); // Function ConZ.ConZCharacter.GetEnvironmentDescription // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2390cd0
	struct UCharacterAction* GetCharacterAction(); // Function ConZ.ConZCharacter.GetCharacterAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2390be0
	enum class EBodyPart GetBodyPartFromBoneName(struct FName BoneName); // Function ConZ.ConZCharacter.GetBodyPartFromBoneName // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2390b40
	void Client_RequestCharacterAction(struct FCharacterActionReplicationHelper Value, bool cancelExecutingAction); // Function ConZ.ConZCharacter.Client_RequestCharacterAction // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2390a60
	void CharacterAction_EndHandle(struct UCharacterAction* action); // Function ConZ.ConZCharacter.CharacterAction_EndHandle // (Final|Native|Private) // @ game+0x23909d0
	void CharacterAction_BeginHandle(struct UCharacterAction* action); // Function ConZ.ConZCharacter.CharacterAction_BeginHandle // (Final|Native|Private) // @ game+0x2390940
	void ActorHitCallback(struct AActor* Actor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult& Hit); // Function ConZ.ConZCharacter.ActorHitCallback // (Native|Protected|HasOutParms|HasDefaults) // @ game+0x23906f0
};

// Class ConZ.Animal2
// Size: 0x9d0 (Inherited: 0x830)
struct AAnimal2 : AConZCharacter {
	struct FText SpeciesName; // 0x830(0x18)
	enum class EAnimalSpecies SpeciesType; // 0x848(0x01)
	enum class EAnimalActivityCycle ActivityCycle; // 0x849(0x01)
	char pad_84A[0x2]; // 0x84a(0x02)
	float MaxHealth; // 0x84c(0x04)
	struct UHitReactComponent* HitReactComponent; // 0x850(0x08)
	struct FGameplayTag HitReactType; // 0x858(0x08)
	struct FName EyesViewPointSocketName; // 0x860(0x08)
	struct FName TargetLocationSocketName; // 0x868(0x08)
	float BleedingSpeed; // 0x870(0x04)
	float LightWoundDamageAmount; // 0x874(0x04)
	float MeleeBleedingThreshold; // 0x878(0x04)
	float StuckCheckDuration; // 0x87c(0x04)
	float StuckRadius; // 0x880(0x04)
	char UnstuckMode; // 0x884(0x01)
	char pad_885[0x3]; // 0x885(0x03)
	struct FMulticastInlineDelegate OnDamageTaken; // 0x888(0x10)
	float HeadBoneRotationSendToServerInterval; // 0x898(0x04)
	float SightRange; // 0x89c(0x04)
	bool TiltMeshOnSlopes; // 0x8a0(0x01)
	bool AdjustMeshHeightOnSlopes; // 0x8a1(0x01)
	char pad_8A2[0x2]; // 0x8a2(0x02)
	float MeshPositionLerpSpeed; // 0x8a4(0x04)
	float BleedInterval; // 0x8a8(0x04)
	bool ShouldGoToRagdolIfTakenDamage; // 0x8ac(0x01)
	char pad_8AD[0x3]; // 0x8ad(0x03)
	float RagdollDuration; // 0x8b0(0x04)
	float _health; // 0x8b4(0x04)
	char pad_8B8[0x4]; // 0x8b8(0x04)
	bool _canBeModifiedWithServerSettings; // 0x8bc(0x01)
	char pad_8BD[0xf]; // 0x8bd(0x0f)
	int32_t _packSizeMin; // 0x8cc(0x04)
	int32_t _packSizeMax; // 0x8d0(0x04)
	char pad_8D4[0x34]; // 0x8d4(0x34)
	enum class EAnimalStance _animalStance; // 0x908(0x01)
	char pad_909[0x7]; // 0x909(0x07)
	bool _shouldUpdateMovementSpeedRTPCValue; // 0x910(0x01)
	char pad_911[0x47]; // 0x911(0x47)
	bool _doNotCrumble; // 0x958(0x01)
	char pad_959[0x3]; // 0x959(0x03)
	float _collisionDamageMultiplierPerBodyPart[0xc]; // 0x95c(0x30)
	char pad_98C[0x4]; // 0x98c(0x04)
	float _delayBetweenTakeDamageSounds; // 0x990(0x04)
	bool _canDrown; // 0x994(0x01)
	char pad_995[0x3]; // 0x995(0x03)
	float _drownDamageCycleLength; // 0x998(0x04)
	float _drownDamagePerCycle; // 0x99c(0x04)
	char pad_9A0[0x4]; // 0x9a0(0x04)
	float _baseEyeForwardDistance; // 0x9a4(0x04)
	bool _isSearched; // 0x9a8(0x01)
	char pad_9A9[0x3]; // 0x9a9(0x03)
	float _corpseSearchDuration; // 0x9ac(0x04)
	float _corpseMaxLifeTimeInMinutes; // 0x9b0(0x04)
	float _destroyCorpseTimerInterval; // 0x9b4(0x04)
	float _minDistanceToPlayerPawnOrSpectatorToDestroyCorpse; // 0x9b8(0x04)
	char pad_9BC[0x14]; // 0x9bc(0x14)

	void UnpackUint8(char pack, struct TArray<bool>& B); // Function ConZ.Animal2.UnpackUint8 // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x23472a0
	char PackBoolsIntoUint8(struct TArray<bool>& B); // Function ConZ.Animal2.PackBoolsIntoUint8 // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x2347050
	void OnRep_Health(); // Function ConZ.Animal2.OnRep_Health // (Native|Protected) // @ game+0x2347030
	void NetMulticast_PlaySoundOnClients(enum class EAnimal2Sound SoundToPlay); // Function ConZ.Animal2.NetMulticast_PlaySoundOnClients // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2346ee0
	struct APrisoner* ClosestPrisoner(); // Function ConZ.Animal2.ClosestPrisoner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2346de0
};

// Class ConZ.ConZCharacterMovementComponent
// Size: 0xda0 (Inherited: 0xb40)
struct UConZCharacterMovementComponent : UCharacterMovementComponent {
	enum class ECollisionResponse _navWalkingCollisionResponseToWorldStatic; // 0xb40(0x01)
	enum class ECollisionResponse _navWalkingCollisionResponseToWorldDynamic; // 0xb41(0x01)
	char pad_B42[0x2]; // 0xb42(0x02)
	float _maxClimbHeight; // 0xb44(0x04)
	float _obstacleDetectionInterval; // 0xb48(0x04)
	char pad_B4C[0x5]; // 0xb4c(0x05)
	bool _queryWaterSplinesEveryFrame; // 0xb51(0x01)
	char pad_B52[0xfe]; // 0xb52(0xfe)
	float _angularVelocityFilteringInterpolationSpeed; // 0xc50(0x04)
	char pad_C54[0x14c]; // 0xc54(0x14c)
};

// Class ConZ.Animal2MovementComponent
// Size: 0xdc0 (Inherited: 0xda0)
struct UAnimal2MovementComponent : UConZCharacterMovementComponent {
	float GroundSlopeRotationSpeedDegrees; // 0xda0(0x04)
	bool CorrectServerReceivedZ; // 0xda4(0x01)
	char pad_DA5[0x1b]; // 0xda5(0x1b)
};

// Class ConZ.CharacterSoundComponent
// Size: 0x128 (Inherited: 0xb0)
struct UCharacterSoundComponent : UActorComponent {
	struct FName AttachedSoundsAttachPointName; // 0xb0(0x08)
	struct UCharacterImpactSoundsData* ImpactSounds; // 0xb8(0x08)
	struct UCharacterPainSoundsData* PainSounds; // 0xc0(0x08)
	float MinDurationBetweenPainSounds; // 0xc8(0x04)
	float MaxDurationBetweenPainSounds; // 0xcc(0x04)
	char pad_D0[0x8]; // 0xd0(0x08)
	struct TMap<struct FGameplayTag, struct FConZCharacterTagSoundArray> _audioEventsPerTag; // 0xd8(0x50)
};

// Class ConZ.Animal2SoundComponent
// Size: 0x1a0 (Inherited: 0x128)
struct UAnimal2SoundComponent : UCharacterSoundComponent {
	struct UAkAudioEvent* IdleAudioEvent; // 0x128(0x08)
	struct UAkAudioEvent* AngryAudioEvent; // 0x130(0x08)
	struct UAkAudioEvent* AttackAudioEvent; // 0x138(0x08)
	struct UAkAudioEvent* ScaredAudioEvent; // 0x140(0x08)
	struct UAkAudioEvent* AlertedAudioEvent; // 0x148(0x08)
	struct UAkAudioEvent* TakeDamageAudioEvent; // 0x150(0x08)
	struct UAkAudioEvent* KillAudioEvent; // 0x158(0x08)
	struct UAkAudioEvent* AnimalFootstep; // 0x160(0x08)
	float FootstepSoundOverlap; // 0x168(0x04)
	float FixedFootstepVolume; // 0x16c(0x04)
	float SpeedFootstepVolume; // 0x170(0x04)
	float MinSilenceTimeout; // 0x174(0x04)
	float MaxSilenceTimeout; // 0x178(0x04)
	char pad_17C[0x24]; // 0x17c(0x24)
};

// Class ConZ.Animal2AnimInstance
// Size: 0x2f0 (Inherited: 0x2c0)
struct UAnimal2AnimInstance : UAnimInstance {
	struct UCurveFloat* InverseLocomotionBias; // 0x2b8(0x08)
	float MaximumLeaningAngle; // 0x2c0(0x04)
	int32_t IdleStanceIndex; // 0x2c4(0x04)
	enum class EAnimalStance stance; // 0x2c8(0x01)
	struct FRotator SlopeRootTiltRotation; // 0x2cc(0x0c)
	float ABPSpeed; // 0x2d8(0x04)
	float ABPTurn; // 0x2dc(0x04)
	float MoveVelocity; // 0x2e0(0x04)
	char pad_2E9[0x3]; // 0x2e9(0x03)
	bool _isRagdolled; // 0x2ec(0x01)
	char pad_2ED[0x3]; // 0x2ed(0x03)

	void AnimNotify_RFootDownRear(); // Function ConZ.Animal2AnimInstance.AnimNotify_RFootDownRear // (Native|Event|Public|BlueprintEvent) // @ game+0x2346d30
	void AnimNotify_RFootDown(); // Function ConZ.Animal2AnimInstance.AnimNotify_RFootDown // (Native|Event|Public|BlueprintEvent) // @ game+0x2346d30
	void AnimNotify_LFootDownRear(); // Function ConZ.Animal2AnimInstance.AnimNotify_LFootDownRear // (Native|Event|Public|BlueprintEvent) // @ game+0x2346d30
	void AnimNotify_LFootDown(); // Function ConZ.Animal2AnimInstance.AnimNotify_LFootDown // (Native|Event|Public|BlueprintEvent) // @ game+0x2346d30
	void AnimNotify_IntroEnd(); // Function ConZ.Animal2AnimInstance.AnimNotify_IntroEnd // (Native|Event|Public|BlueprintEvent) // @ game+0x2346d10
	void AnimNotify_IdleEnd(); // Function ConZ.Animal2AnimInstance.AnimNotify_IdleEnd // (Native|Event|Public|BlueprintEvent) // @ game+0x2346cf0
};

// Class ConZ.ConZAIController
// Size: 0x450 (Inherited: 0x330)
struct AConZAIController : AAIController {
	char pad_330[0x10]; // 0x330(0x10)
	bool _useConZFlyingNavigation; // 0x340(0x01)
	char pad_341[0x53]; // 0x341(0x53)
	float _turningSpeed; // 0x394(0x04)
	float _turningSpeedRestore; // 0x398(0x04)
	float _brakingDecelerationFlyingMovementRestore; // 0x39c(0x04)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	float _boundsInflation; // 0x3a8(0x04)
	bool _shouldUseBypassAccelerationAndTurning; // 0x3ac(0x01)
	char pad_3AD[0x3]; // 0x3ad(0x03)
	float _bypassAccelerationScale; // 0x3b0(0x04)
	float _bypassTurningSpeed; // 0x3b4(0x04)
	float _findPathBypassMultiplier; // 0x3b8(0x04)
	float _maxTimePerDestinationMultiplier; // 0x3bc(0x04)
	char pad_3C0[0x4]; // 0x3c0(0x04)
	struct FVector _flyingRandomMovementExtent; // 0x3c4(0x0c)
	float _flyingRepeatChooseLocationTime; // 0x3d0(0x04)
	float _speedToTurnOffOrientRotationToMovement; // 0x3d4(0x04)
	struct TArray<struct UObject*> _classesToIgnoreWhenFlyMoving; // 0x3d8(0x10)
	char pad_3E8[0x68]; // 0x3e8(0x68)
};

// Class ConZ.ComplexAnimalAIController
// Size: 0x620 (Inherited: 0x450)
struct AComplexAnimalAIController : AConZAIController {
	enum class EAnimalAgressivness Agressivness; // 0x450(0x01)
	char pad_451[0x3]; // 0x451(0x03)
	float SightIntimidateRadius; // 0x454(0x04)
	float SightAttackRadius; // 0x458(0x04)
	float FoeChargeVelocity; // 0x45c(0x04)
	bool ShouldForceChargeRotation; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	float AnimalVelocityThatMakesThisAnimalFlee; // 0x464(0x04)
	float FleeDistance; // 0x468(0x04)
	float FleeTime; // 0x46c(0x04)
	float TrotTime; // 0x470(0x04)
	float TimeToAttackWhenAggro; // 0x474(0x04)
	float TimeToQuitObserve; // 0x478(0x04)
	float MinReactionTime; // 0x47c(0x04)
	float MaxReactionTime; // 0x480(0x04)
	float MovingUpdateInterval; // 0x484(0x04)
	float AttackingUpdateInetrval; // 0x488(0x04)
	float PathSegmentLength_OBSOLETE; // 0x48c(0x04)
	float MinPaceDuration_OBSOLETE; // 0x490(0x04)
	int32_t MaxNumWalks_OBSOLETE; // 0x494(0x04)
	int32_t MaxNumTrots_OBSOLETE; // 0x498(0x04)
	float PathDirectionCounterResetTime_OBOLETE; // 0x49c(0x04)
	float MoveSegmentLength; // 0x4a0(0x04)
	float BackOffDistance; // 0x4a4(0x04)
	float AttackTrackingDistance; // 0x4a8(0x04)
	float PredictionFactor; // 0x4ac(0x04)
	bool BackAndForthStuckCheck; // 0x4b0(0x01)
	char AttackAttempts; // 0x4b1(0x01)
	char pad_4B2[0x2]; // 0x4b2(0x02)
	float ActionChangedDelay; // 0x4b4(0x04)
	float CloseAttackRepeatDelay; // 0x4b8(0x04)
	float AttackChainDelay; // 0x4bc(0x04)
	int32_t BlockedPathRetryAttempts; // 0x4c0(0x04)
	float DirectionLockTime; // 0x4c4(0x04)
	float MinWalkTimeDuringRoaming; // 0x4c8(0x04)
	float MaxWalkTimeDuringRoaming; // 0x4cc(0x04)
	float MinStandTimeDuringRoaming; // 0x4d0(0x04)
	float MaxStandTimeDuringRoaming; // 0x4d4(0x04)
	float IntimidateTime; // 0x4d8(0x04)
	float IntimidateAnimationEndTime; // 0x4dc(0x04)
	float AlertActionTime; // 0x4e0(0x04)
	float AlertStartupTime; // 0x4e4(0x04)
	float AlertAllowedAgainTime; // 0x4e8(0x04)
	float DoNotDespawnTime; // 0x4ec(0x04)
	struct UAISenseConfig_Sight* NormalAISenseSight; // 0x4f0(0x08)
	struct UAISenseConfig_Hearing* NormalAISenseHearing; // 0x4f8(0x08)
	struct UAISenseConfig_Hearing* RelaxedAISenseHearing; // 0x500(0x08)
	struct UAISenseConfig_Hearing* AlertedAISenseHearing; // 0x508(0x08)
	struct UAISenseConfig_Sight* SleepAISenseSight; // 0x510(0x08)
	struct AComplexAnimal2* _animal; // 0x518(0x08)
	char pad_520[0x88]; // 0x520(0x88)
	float _roamRadius; // 0x5a8(0x04)
	float _healthPercentageToFlee; // 0x5ac(0x04)
	float _damageMagnitudeHealthPercentageToFlee; // 0x5b0(0x04)
	float _distanceFromFoeToStartIgnoring; // 0x5b4(0x04)
	char pad_5B8[0x68]; // 0x5b8(0x68)

	void UpdatePerception(struct TArray<struct AActor*>& actorsPerceived); // Function ConZ.ComplexAnimalAIController.UpdatePerception // (Final|Native|Private|HasOutParms) // @ game+0x2384220
	void StartFullAlert(); // Function ConZ.ComplexAnimalAIController.StartFullAlert // (Final|Native|Public) // @ game+0x2383f60
	void QuitObserve(); // Function ConZ.ComplexAnimalAIController.QuitObserve // (Final|Native|Public) // @ game+0x2383d60
	void OnTakeDamageHandler(struct AActor* damageActor, float Damage, struct FVector HitLocation, struct APawn* eventInstigator); // Function ConZ.ComplexAnimalAIController.OnTakeDamageHandler // (Final|Native|Private|HasDefaults) // @ game+0x2383b00
	void OnActionChangedHandler(enum class EAnimalAction CurrentAction, enum class EAnimalAction PrevAction); // Function ConZ.ComplexAnimalAIController.OnActionChangedHandler // (Native|Protected) // @ game+0x23839f0
	enum class EAnimalMode GetMode(); // Function ConZ.ComplexAnimalAIController.GetMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11450c0
	void ChangeMode(enum class EAnimalMode newMode); // Function ConZ.ComplexAnimalAIController.ChangeMode // (Native|Public|BlueprintCallable) // @ game+0x23833c0
};

// Class ConZ.AnimalContinuousChargeAttackAIController
// Size: 0x638 (Inherited: 0x620)
struct AAnimalContinuousChargeAttackAIController : AComplexAnimalAIController {
	float LockAttackDirectionDistance; // 0x620(0x04)
	float ContinueAttackDistance; // 0x624(0x04)
	char pad_628[0x10]; // 0x628(0x10)
};

// Class ConZ.BaseItemTag
// Size: 0x30 (Inherited: 0x30)
struct UBaseItemTag : UDataAsset {
};

// Class ConZ.AnimalHandlingItemTag
// Size: 0x30 (Inherited: 0x30)
struct UAnimalHandlingItemTag : UBaseItemTag {
};

// Class ConZ.Skill
// Size: 0xb0 (Inherited: 0x30)
struct USkill : UDataAsset {
	struct FText Caption; // 0x30(0x18)
	enum class ESkillReplicationID ReplicationID; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float ComboBonus; // 0x4c(0x04)
	float NoSkillBonus; // 0x50(0x04)
	float BasicBonus; // 0x54(0x04)
	float MediumBonus; // 0x58(0x04)
	float AdvancedBonus; // 0x5c(0x04)
	float DisplayActionMessages; // 0x60(0x04)
	bool IsAvailableInCharacterCreation; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct UTexture2D* _skillIcon; // 0x68(0x08)
	char pad_70[0x34]; // 0x70(0x34)
	float _skillFamePointsMultiplier; // 0xa4(0x04)
	struct UPrisonerSkillUIData* _uiDataClass; // 0xa8(0x08)
};

// Class ConZ.IntelligenceSkill
// Size: 0xb0 (Inherited: 0xb0)
struct UIntelligenceSkill : USkill {
};

// Class ConZ.AnimalHandlingSkill
// Size: 0xc0 (Inherited: 0xb0)
struct UAnimalHandlingSkill : UIntelligenceSkill {
	char pad_B0[0x10]; // 0xb0(0x10)
};

// Class ConZ.AnimNotify_CharacterActionEnd
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_CharacterActionEnd : UAnimNotify {
};

// Class ConZ.AnimNotify_CharacterActionMarker
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_CharacterActionMarker : UAnimNotify {
};

// Class ConZ.AnimNotify_CharacterActionNotify
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_CharacterActionNotify : UAnimNotify {
	enum class ECharacterActionNotifyType CharacterActionNotifyType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ConZ.AnimNotify_ClimbingFinished
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ClimbingFinished : UAnimNotify {
};

// Class ConZ.AnimNotify_ConditionalPlayParticleEffectForItem
// Size: 0x90 (Inherited: 0x38)
struct UAnimNotify_ConditionalPlayParticleEffectForItem : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct FVector LocationOffset; // 0x40(0x0c)
	struct FRotator RotationOffset; // 0x4c(0x0c)
	struct FVector Scale; // 0x58(0x0c)
	char pad_64[0x1c]; // 0x64(0x1c)
	char Attached : 1; // 0x80(0x01)
	char pad_80_1 : 7; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	struct FName SocketName; // 0x84(0x08)
	char pad_8C[0x4]; // 0x8c(0x04)

	bool ShouldPlayParticleEffectForItem(struct AItem* Item); // Function ConZ.AnimNotify_ConditionalPlayParticleEffectForItem.ShouldPlayParticleEffectForItem // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2347200
};

// Class ConZ.AnimNotify_FishingActionNotify
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_FishingActionNotify : UAnimNotify {
	enum class EFishingActionNotifyType FishingActionNotifyType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ConZ.AnimNotify_MagazineUpdateAmmunitionMeshes
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotify_MagazineUpdateAmmunitionMeshes : UAnimNotify {
	bool showReversed; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct TArray<int32_t> ammoIndices; // 0x40(0x10)
};

// Class ConZ.AnimNotify_MakeNoise
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_MakeNoise : UAnimNotify {
	enum class ENoiseLevel noiseLevel; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	struct FName NoiseTag; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class ConZ.AnimNotify_PaddlingSwitchHands
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_PaddlingSwitchHands : UAnimNotify {
	enum class EBoatPaddlingState _newState; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ConZ.AnimNotify_PlaySoundBySurface
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_PlaySoundBySurface : UAnimNotify {
	struct UAkAudioEvent* AudioEvent; // 0x38(0x08)
	enum class ECollisionChannel TraceChannel; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class ConZ.AnimNotify_PlaySoundOnOwner
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_PlaySoundOnOwner : UAnimNotify {
	struct UAkAudioEvent* AudioEvent; // 0x38(0x08)
};

// Class ConZ.AnimNotify_PlaySubtitledSound
// Size: 0x58 (Inherited: 0x38)
struct UAnimNotify_PlaySubtitledSound : UAnimNotify {
	struct UAkAudioEvent* AudioEvent; // 0x38(0x08)
	struct FText Subtitles; // 0x40(0x18)
};

// Class ConZ.AnimNotify_QuestBookMinigameNotify
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_QuestBookMinigameNotify : UAnimNotify {
	enum class EQuestBookMinigameNotifyType _type; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ConZ.AnimNotify_SmokableItemEquip
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_SmokableItemEquip : UAnimNotify {
};

// Class ConZ.AnimNotify_SmokableItemSwitchMeshParent
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_SmokableItemSwitchMeshParent : UAnimNotify {
	enum class EDesiredParent DesiredParentSocket; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ConZ.AnimNotify_SmokableItemUnequip
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_SmokableItemUnequip : UAnimNotify {
};

// Class ConZ.AnimNotify_SpawnDefecationEffects
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_SpawnDefecationEffects : UAnimNotify {
};

// Class ConZ.AnimNotify_SpawnDiarrheaEffects
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_SpawnDiarrheaEffects : UAnimNotify {
};

// Class ConZ.AnimNotify_VehicleDoorOpenOrClose
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_VehicleDoorOpenOrClose : UAnimNotify {
};

// Class ConZ.AnimNotify_WaterPaddle
// Size: 0x60 (Inherited: 0x38)
struct UAnimNotify_WaterPaddle : UAnimNotify {
	struct UParticleSystem* ParticleSystem; // 0x38(0x08)
	struct UAkAudioEvent* AudioEvent; // 0x40(0x08)
	float VolumeMultiplier; // 0x48(0x04)
	float PitchMultiplier; // 0x4c(0x04)
	bool IsUnderwater; // 0x50(0x01)
	bool IsAttached; // 0x51(0x01)
	char pad_52[0x2]; // 0x52(0x02)
	struct FName AttachPointName; // 0x54(0x08)
	bool DebugMode; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
};

// Class ConZ.AnimNotify_WeaponActionNotify
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_WeaponActionNotify : UAnimNotify {
	enum class EWeaponActionNotifyType WeaponActionNotifyType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ConZ.AnimNotify_WeaponChamberBullet
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_WeaponChamberBullet : UAnimNotify {
};

// Class ConZ.AnimNotify_WeaponChamberBulletInternal
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_WeaponChamberBulletInternal : UAnimNotify {
};

// Class ConZ.AnimNotify_WeaponEjectCasing
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_WeaponEjectCasing : UAnimNotify {
	struct FName EmitterSocketName; // 0x38(0x08)
	bool AttachEmitter; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class ConZ.AnimNotify_WeaponUpdateAmmunitionMeshes
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotify_WeaponUpdateAmmunitionMeshes : UAnimNotify {
	bool showReversed; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct TArray<int32_t> ammoIndices; // 0x40(0x10)
};

// Class ConZ.AnimNotifyState_BoatRow
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_BoatRow : UAnimNotifyState {
};

// Class ConZ.AnimNotifyState_ChamberWeapon
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_ChamberWeapon : UAnimNotifyState {
};

// Class ConZ.AnimNotifyState_DrainStamina
// Size: 0x48 (Inherited: 0x30)
struct UAnimNotifyState_DrainStamina : UAnimNotifyState {
	enum class EAnimNotifyStaminDrainType DrainType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float AmountToDrain; // 0x34(0x04)
	float Duration; // 0x38(0x04)
	float RecoveryDelay; // 0x3c(0x04)
	float RatioToRecover; // 0x40(0x04)
	float RecoveryTime; // 0x44(0x04)
};

// Class ConZ.AnimNotifyState_Fade
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_Fade : UAnimNotifyState {
	float _fadeOutRatio; // 0x30(0x04)
	float _fadeInRatio; // 0x34(0x04)
	enum class AnimNotifyState_FadeForAction _forAction; // 0x38(0x01)
	char pad_39[0x17]; // 0x39(0x17)
};

// Class ConZ.AnimNotifyState_IgnoreUsingHandCorrections
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_IgnoreUsingHandCorrections : UAnimNotifyState {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class ConZ.AnimNotifyState_Melee
// Size: 0x70 (Inherited: 0x30)
struct UAnimNotifyState_Melee : UAnimNotifyState {
	struct FGameplayTag _attackCapsuleAttachment; // 0x30(0x08)
	float _damageMultiplier; // 0x38(0x04)
	enum class EHitSeverity _hitSeverity; // 0x3c(0x01)
	bool _stopOnHit; // 0x3d(0x01)
	bool _ignoreLandscape; // 0x3e(0x01)
	enum class EAttackType _attackType; // 0x3f(0x01)
	struct FName _hitDetectionMarkersRootBoneParentName; // 0x40(0x08)
	struct TArray<struct FMeleeHitDetectionMarker> _hitDetectionMarkers; // 0x48(0x10)
	int32_t _hitDetectionSamplingRate; // 0x58(0x04)
	char pad_5C[0x14]; // 0x5c(0x14)
};

// Class ConZ.AnimNotifyState_NoScopingAllowed
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_NoScopingAllowed : UAnimNotifyState {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class ConZ.AnimNotifyState_PaniniOverride
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_PaniniOverride : UAnimNotifyState {
};

// Class ConZ.AnimNotifyState_PhysicalAnimation
// Size: 0x60 (Inherited: 0x30)
struct UAnimNotifyState_PhysicalAnimation : UAnimNotifyState {
	bool GotoRagdollOnEnd; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FName BodyProfileName; // 0x34(0x08)
	struct FName ConstraintProfileName; // 0x3c(0x08)
	struct FName BoneName; // 0x44(0x08)
	struct FName StrengthBlendCurveName; // 0x4c(0x08)
	struct FName PhysicsBlendCurveName; // 0x54(0x08)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class ConZ.AnimNotifyState_PlaySoundOnOwnerRanged
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_PlaySoundOnOwnerRanged : UAnimNotifyState {
	struct UAkAudioEvent* BeginAudioEvent; // 0x30(0x08)
	struct UAkAudioEvent* EndAudioEvent; // 0x38(0x08)
};

// Class ConZ.AnimNotifyState_ShowAmmunitionMeshes
// Size: 0x60 (Inherited: 0x30)
struct UAnimNotifyState_ShowAmmunitionMeshes : UAnimNotifyState {
	bool GenerateCustomMeshComponents; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<struct FName> CustomMeshComponentsBoneNames; // 0x38(0x10)
	bool showReversed; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct TArray<int32_t> ammoIndices; // 0x50(0x10)
};

// Class ConZ.AnimNotifyState_WeaponHideMagazine
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_WeaponHideMagazine : UAnimNotifyState {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class ConZ.AnimNotifyState_WeaponRevolverDrumRotationDirection
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_WeaponRevolverDrumRotationDirection : UAnimNotifyState {
	enum class ERotationDirection RotationDirection; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class ConZ.AnimNotifyState_WeaponRevolverIgnoreDrumRotation
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_WeaponRevolverIgnoreDrumRotation : UAnimNotifyState {
};

// Class ConZ.AnimNotifyState_WeaponShowAmmunitionMeshes
// Size: 0x48 (Inherited: 0x30)
struct UAnimNotifyState_WeaponShowAmmunitionMeshes : UAnimNotifyState {
	bool showReversed; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<int32_t> ammoIndices; // 0x38(0x10)
};

// Class ConZ.AnimStatics
// Size: 0x28 (Inherited: 0x28)
struct UAnimStatics : UBlueprintFunctionLibrary {
};

// Class ConZ.AquaticLifeSpawningVolume
// Size: 0x2a8 (Inherited: 0x258)
struct AAquaticLifeSpawningVolume : AVolume {
	enum class EWaterZoneType _waterZoneType; // 0x258(0x01)
	char pad_259[0x7]; // 0x259(0x07)
	struct UFishSpeciesPreset* _fishSpeciesPreset; // 0x260(0x08)
	struct UFishSpawningPreset* _fishSpawningPreset; // 0x268(0x08)
	float _requiredDepthForSpawning; // 0x270(0x04)
	float _fishSchoolManagerSpawningExtent; // 0x274(0x04)
	int32_t _maxSchoolsPerFishSchoolManager; // 0x278(0x04)
	float _fishingZoneIndicatorMinSpawnTime; // 0x27c(0x04)
	float _fishingZoneIndicatorMaxSpawnTime; // 0x280(0x04)
	float _fishingZoneIndicatorMinLifetime; // 0x284(0x04)
	float _fishingZoneIndicatorMaxLifetime; // 0x288(0x04)
	int32_t _maxFishingZoneIndicatorPerPlayer; // 0x28c(0x04)
	float _fishingZoneIndicatorMinSpawningExtent; // 0x290(0x04)
	float _fishingZoneIndicatorMaxSpawningExtent; // 0x294(0x04)
	float _fishingZoneIndicatorMinRadius; // 0x298(0x04)
	float _fishingZoneIndicatorMaxRadius; // 0x29c(0x04)
	float _requiredDepthForFishingIndicator; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
};

// Class ConZ.StrengthSkill
// Size: 0xb0 (Inherited: 0xb0)
struct UStrengthSkill : USkill {
};

// Class ConZ.RangedWeaponsSkill
// Size: 0x218 (Inherited: 0xb0)
struct URangedWeaponsSkill : UStrengthSkill {
	char pad_B0[0x10]; // 0xb0(0x10)
	struct FRangedWeaponSkillExperienceAwards NoSkillExperienceAwards; // 0xc0(0x40)
	struct FRangedWeaponSkillExperienceAwards BasicSkillExperienceAwards; // 0x100(0x40)
	struct FRangedWeaponSkillExperienceAwards MediumSkillExperienceAwards; // 0x140(0x40)
	struct FRangedWeaponSkillExperienceAwards AdvancedSkillExperienceAwards; // 0x180(0x40)
	struct FRangedWeaponSkillExperienceAwards AboveAdvancedSkillExperienceAwards; // 0x1c0(0x40)
	struct FRangedWeaponSkillParametersPerSkillLevel NoSkillParameters; // 0x200(0x04)
	struct FRangedWeaponSkillParametersPerSkillLevel BasicSkillParameters; // 0x204(0x04)
	struct FRangedWeaponSkillParametersPerSkillLevel MediumSkillParameters; // 0x208(0x04)
	struct FRangedWeaponSkillParametersPerSkillLevel AdvancedSkillParameters; // 0x20c(0x04)
	struct FRangedWeaponSkillParametersPerSkillLevel AboveAdvancedSkillParameters; // 0x210(0x04)
	char pad_214[0x4]; // 0x214(0x04)
};

// Class ConZ.ArcherySkill
// Size: 0x280 (Inherited: 0x218)
struct UArcherySkill : URangedWeaponsSkill {
	float _drawWeightNoSkillValue; // 0x218(0x04)
	float _drawWeightBasicSkillValue; // 0x21c(0x04)
	float _drawWeightMediumSkillValue; // 0x220(0x04)
	float _drawWeightAdvancedSkillValue; // 0x224(0x04)
	float _drawWeightAboveAvancedSkillValue; // 0x228(0x04)
	float _holdTimeInFullDrawNoSkillValue; // 0x22c(0x04)
	float _holdTimeInFullDrawBasicSkillValue; // 0x230(0x04)
	float _holdTimeInFullDrawMediumSkillValue; // 0x234(0x04)
	float _holdTimeInFullDrawAdvancedSkillValue; // 0x238(0x04)
	float _holdTimeInFullDrawAboveAvancedSkillValue; // 0x23c(0x04)
	float _armsShakeMultiplierNoSkillValue; // 0x240(0x04)
	float _armsShakeMultiplierBasicSkillValue; // 0x244(0x04)
	float _armsShakeMultiplierMediumSkillValue; // 0x248(0x04)
	float _armsShakeMultiplierAdvancedSkillValue; // 0x24c(0x04)
	float _armsShakeMultiplierAboveAvancedSkillValue; // 0x250(0x04)
	float _tuneBowDurationNoSkillValue; // 0x254(0x04)
	float _tuneBowDurationBasicSkillValue; // 0x258(0x04)
	float _tuneBowDurationMediumSkillValue; // 0x25c(0x04)
	float _tuneBowDurationAdvancedSkillValue; // 0x260(0x04)
	float _tuneBowDurationAboveAvancedSkillValue; // 0x264(0x04)
	float _drawCenterDotExtraTimeLimitNoSkillValue; // 0x268(0x04)
	float _drawCenterDotExtraTimeLimitBasicSkillValue; // 0x26c(0x04)
	float _drawCenterDotExtraTimeLimitMediumSkillValue; // 0x270(0x04)
	float _drawCenterDotExtraTimeLimitAdvancedSkillValue; // 0x274(0x04)
	float _drawCenterDotExtraTimeLimitAboveAvancedSkillValue; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
};

// Class ConZ.ClothesItem
// Size: 0xa50 (Inherited: 0x9b0)
struct AClothesItem : AItem {
	struct UCharacterMesh* _characterMesh; // 0x9a8(0x08)
	uint32_t _warmth; // 0x9b0(0x04)
	uint32_t _waterResistance; // 0x9b4(0x04)
	float _inwardsWaterPropagationFactor; // 0x9b8(0x04)
	float _outwardsWaterPropagationFactor; // 0x9bc(0x04)
	float _camouflageBonus; // 0x9c0(0x04)
	float _damageWhenEquipped; // 0x9c4(0x04)
	float _dirtinessWhenEquipped; // 0x9c8(0x04)
	float _thermalConductivityFactor; // 0x9cc(0x04)
	float _burnDamageResistanceFactor; // 0x9d0(0x04)
	bool _overrideTemperatureResistanceThreshold; // 0x9d4(0x01)
	float _temperatureResistanceThreshold; // 0x9d8(0x04)
	bool _canBeEquipped; // 0x9dc(0x01)
	enum class EPrisonerMovementPace _maxPaceWhenEquipped; // 0x9dd(0x01)
	float _dirtiness; // 0x9e0(0x04)
	float _baseBodyPartMultiplier; // 0x9e4(0x04)
	float _baseBodyPartMultiplierWhileProne; // 0x9e8(0x04)
	float _smallMaterialDamageLimit; // 0x9ec(0x04)
	float _bigMaterialDamageLimit; // 0x9f0(0x04)
	float _maxFemaleHairLength; // 0x9f4(0x04)
	float _maxMaleHairLength; // 0x9f8(0x04)
	float _maxFacialHairLength; // 0x9fc(0x04)
	float _bellyJiggleMultiplier; // 0xa00(0x04)
	float _breastJiggleMultiplier; // 0xa04(0x04)
	uint32_t _armor; // 0xa08(0x04)
	float _hardness; // 0xa0c(0x04)
	float _projectileHitEnergyAbsorption; // 0xa10(0x04)
	float _projectileHitEnergyDamagedAbsorption; // 0xa14(0x04)
	float _energyThroughputRatio; // 0xa18(0x04)
	float _totalEnergyAbsorption; // 0xa1c(0x04)
	float _sharpMeleeDamageReduction; // 0xa20(0x04)
	float _bluntMeleeDamageReduction; // 0xa24(0x04)
	uint32_t _capacityX; // 0xa28(0x04)
	uint32_t _capacityY; // 0xa2c(0x04)
	char _materialParametersReplicated; // 0xa30(0x01)
	char pad_A34[0xc]; // 0xa34(0x0c)
	struct UInventoryContainer2D* _inventoryContainer2D; // 0xa40(0x08)
	char pad_A48[0x8]; // 0xa48(0x08)

	void SetDirtiness(float dirtiness); // Function ConZ.ClothesItem.SetDirtiness // (Final|Native|Public|BlueprintCallable) // @ game+0x23808d0
	void OnRep_MaterialParameters(); // Function ConZ.ClothesItem.OnRep_MaterialParameters // (Final|Native|Protected) // @ game+0x2380890
	void NetMulticast_UpdateMaterialParamsOnClients(); // Function ConZ.ClothesItem.NetMulticast_UpdateMaterialParamsOnClients // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x2380830
	int32_t GetWarmth(); // Function ConZ.ClothesItem.GetWarmth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2380420
	int32_t GetCapacityY(); // Function ConZ.ClothesItem.GetCapacityY // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2380220
	int32_t GetCapacityX(); // Function ConZ.ClothesItem.GetCapacityX // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x23801f0
};

// Class ConZ.Armband
// Size: 0xa50 (Inherited: 0xa50)
struct AArmband : AClothesItem {
	uint64_t _replicatedSquadEmblem; // 0xa48(0x08)

	void OnRep_SquadEmblem(); // Function ConZ.Armband.OnRep_SquadEmblem // (Final|Native|Private) // @ game+0x234bee0
};

// Class ConZ.CharacterAction
// Size: 0x108 (Inherited: 0x28)
struct UCharacterAction : UObject {
	char pad_28[0x30]; // 0x28(0x30)
	struct TArray<struct UCharacterActionDescription*> PreActionsDescriptions; // 0x58(0x10)
	struct TArray<struct UCharacterActionDescription*> PostActionsDescriptions; // 0x68(0x10)
	struct UCharacterAction* ParentAction; // 0x78(0x08)
	struct TArray<struct UCharacterAction*> _preActions; // 0x80(0x10)
	struct TArray<struct UCharacterAction*> _postActions; // 0x90(0x10)
	struct UActionProgressWidget* _progressWidget; // 0xa0(0x08)
	char pad_A8[0x18]; // 0xa8(0x18)
	struct UCharacterActionDescription* _description; // 0xc0(0x08)
	char pad_C8[0x40]; // 0xc8(0x40)

	float PlayMontage(struct UAnimMontage* Montage, float PlayRate, struct FName& startSection, bool assignCallbacks); // Function ConZ.CharacterAction.PlayMontage // (Final|Native|Protected|HasOutParms) // @ game+0x236ca90
	void OnProgressWidgetFinished(); // Function ConZ.CharacterAction.OnProgressWidgetFinished // (Native|Protected) // @ game+0x236c9a0
	void OnProgressWidgetCanceled(); // Function ConZ.CharacterAction.OnProgressWidgetCanceled // (Native|Protected) // @ game+0x236c980
	void OnPreActionEnd(struct UCharacterAction* action); // Function ConZ.CharacterAction.OnPreActionEnd // (Native|Protected) // @ game+0x236c8f0
	void OnPreActionBegin(struct UCharacterAction* action); // Function ConZ.CharacterAction.OnPreActionBegin // (Native|Protected) // @ game+0x236c860
	void OnMontageEnded(struct UAnimMontage* Montage, bool interrupted); // Function ConZ.CharacterAction.OnMontageEnded // (Native|Protected) // @ game+0x236c790
	void OnMontageBlendingOutStarted(struct UAnimMontage* Montage, bool interrupted); // Function ConZ.CharacterAction.OnMontageBlendingOutStarted // (Native|Protected) // @ game+0x236c6c0
};

// Class ConZ.ArmedNPCActionInsertArrow
// Size: 0x108 (Inherited: 0x108)
struct UArmedNPCActionInsertArrow : UCharacterAction {
};

// Class ConZ.CharacterActionDescription
// Size: 0x38 (Inherited: 0x28)
struct UCharacterActionDescription : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class ConZ.ArmedNPCActionInsertArrowDescription
// Size: 0x40 (Inherited: 0x38)
struct UArmedNPCActionInsertArrowDescription : UCharacterActionDescription {
	char pad_38[0x8]; // 0x38(0x08)
};

// Class ConZ.ArmedNPCActionReloadWeapon
// Size: 0x110 (Inherited: 0x108)
struct UArmedNPCActionReloadWeapon : UCharacterAction {
	char pad_108[0x8]; // 0x108(0x08)
};

// Class ConZ.ArmedNPCActionReloadWeaponDescription
// Size: 0x70 (Inherited: 0x38)
struct UArmedNPCActionReloadWeaponDescription : UCharacterActionDescription {
	char pad_38[0x38]; // 0x38(0x38)
};

// Class ConZ.ArmedNPCAimCorrectionsData
// Size: 0x2c0 (Inherited: 0x30)
struct UArmedNPCAimCorrectionsData : UDataAsset {
	struct FArmedNPCAimCorrection HandgunCorrections; // 0x30(0x120)
	struct FArmedNPCAimCorrection RifleCorrections; // 0x150(0x120)
	struct TMap<struct AWeapon*, struct FArmedNPCAimCorrection> CorrectionsPerWeapon; // 0x270(0x50)
};

// Class ConZ.ConZCharacterEncounterSaveState
// Size: 0x38 (Inherited: 0x28)
struct UConZCharacterEncounterSaveState : UObject {
	struct TArray<char> AIControllerData; // 0x28(0x10)
};

// Class ConZ.ArmedNPCBaseEncounterSaveState
// Size: 0x50 (Inherited: 0x38)
struct UArmedNPCBaseEncounterSaveState : UConZCharacterEncounterSaveState {
	int32_t Version; // 0x38(0x04)
	float health; // 0x3c(0x04)
	int32_t BodyMeshIndex; // 0x40(0x04)
	int32_t ItemInHandsIndex; // 0x44(0x04)
	bool IsSearched; // 0x48(0x01)
	enum class EArmedNPCPersonality Personality; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// Class ConZ.ArmedNPCBase
// Size: 0xa00 (Inherited: 0x830)
struct AArmedNPCBase : AConZCharacter {
	char pad_830[0x50]; // 0x830(0x50)
	struct UEntityOverlapDetectionComponent* _trapOverlapDetection; // 0x880(0x08)
	struct UBaseInteractionComponent* _baseInteractionComponent; // 0x888(0x08)
	struct UNavigationInvokerComponent* _navigationInvokerComponent; // 0x890(0x08)
	struct UMeleeCombatComponent* _meleeCombatComponent; // 0x898(0x08)
	struct UNPCInventoryComponent* _inventoryComponent; // 0x8a0(0x08)
	struct FAttachmentSocket RightHandAttachmentSocket; // 0x8a8(0x10)
	struct FAttachmentSocket LeftHandAttachmentSocket; // 0x8b8(0x10)
	bool _enableBaseInteraction; // 0x8c8(0x01)
	bool _isInCombatMode; // 0x8c9(0x01)
	char pad_8CA[0x6]; // 0x8ca(0x06)
	struct AActor* _meleeTarget; // 0x8d0(0x08)
	struct AItem* _itemInHands; // 0x8d8(0x08)
	char pad_8E0[0x18]; // 0x8e0(0x18)
	struct UHitReactComponent* _hitReactComponent; // 0x8f8(0x08)
	enum class EArmedNPCBaseMovementPace _pace; // 0x900(0x01)
	char pad_901[0x7]; // 0x901(0x07)
	struct UArmedNPCBaseCommonData* _armedNPCBaseCommonData; // 0x908(0x08)
	bool _canEverBeSearched; // 0x910(0x01)
	char pad_911[0x3]; // 0x911(0x03)
	float _corpseSearchDuration; // 0x914(0x04)
	float _drownDamageCycleLength; // 0x918(0x04)
	float _drownDamagePerCycle; // 0x91c(0x04)
	char pad_920[0x30]; // 0x920(0x30)
	struct AActor* _aimLocationTargetForSimulatedProxy; // 0x950(0x08)
	bool _assignAimLocationOnSimulatedProxy; // 0x958(0x01)
	char pad_959[0x7]; // 0x959(0x07)
	struct UArmedNPCWeaponManual* _weaponManual; // 0x960(0x08)
	char pad_968[0x8]; // 0x968(0x08)
	struct UMeleeSkillAnimationsPreset* _meleeSkillAnimationsPreset; // 0x970(0x08)
	char pad_978[0x24]; // 0x978(0x24)
	float _health; // 0x99c(0x04)
	bool _isSearched; // 0x9a0(0x01)
	char pad_9A1[0x3]; // 0x9a1(0x03)
	int32_t _bodyMeshIndex; // 0x9a4(0x04)
	int32_t _itemInHandsIndex; // 0x9a8(0x04)
	char pad_9AC[0x10]; // 0x9ac(0x10)
	bool _checkSurroundings; // 0x9bc(0x01)
	char pad_9BD[0x43]; // 0x9bd(0x43)

	void OnRep_Pace(); // Function ConZ.ArmedNPCBase.OnRep_Pace // (Final|Native|Private) // @ game+0x234bec0
	void OnRep_MeleeTarget(); // Function ConZ.ArmedNPCBase.OnRep_MeleeTarget // (Final|Native|Private) // @ game+0x234bea0
	void OnRep_IsSearched(bool oldValue); // Function ConZ.ArmedNPCBase.OnRep_IsSearched // (Native|Protected) // @ game+0x234be10
	void OnRep_IsInCombatMode(); // Function ConZ.ArmedNPCBase.OnRep_IsInCombatMode // (Final|Native|Private) // @ game+0x234bdf0
	void OnMontageEnded(struct UAnimMontage* Montage, bool interrupted); // Function ConZ.ArmedNPCBase.OnMontageEnded // (Final|Native|Private) // @ game+0x234bd20
	void NetMulticast_StopAnimation(enum class EArmedNPCAnimation Animation); // Function ConZ.ArmedNPCBase.NetMulticast_StopAnimation // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x234bca0
	void NetMulticast_PlayVoiceLine(enum class EArmedNPCVoiceLine line); // Function ConZ.ArmedNPCBase.NetMulticast_PlayVoiceLine // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x234bc20
	void NetMulticast_PlayAnimation(enum class EArmedNPCAnimation Animation); // Function ConZ.ArmedNPCBase.NetMulticast_PlayAnimation // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x234bba0
	void NetMulticast_OnConZCharacterKilled(); // Function ConZ.ArmedNPCBase.NetMulticast_OnConZCharacterKilled // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x234bb80
	void BaseInteractionComponent_OnBaseInteractionEvent(struct UBaseInteractionComponent* Component, struct FBaseInteractionEvent& BaseInteractionEvent); // Function ConZ.ArmedNPCBase.BaseInteractionComponent_OnBaseInteractionEvent // (Final|Native|Private|HasOutParms) // @ game+0x234ba90
};

// Class ConZ.ArmedNPCBaseAIController
// Size: 0x598 (Inherited: 0x450)
struct AArmedNPCBaseAIController : AConZAIController {
	struct UAISenseConfig_Sight* _sightSenseConfigCombat; // 0x450(0x08)
	struct UAISenseConfig_Hearing* _hearingSenseConfigCombat; // 0x458(0x08)
	struct UAISenseConfig_Touch* _touchSenseConfig; // 0x460(0x08)
	struct TMap<struct FName, float> _noiseAccumulationMultiplierPerNoiseTag; // 0x468(0x50)
	float _genericAcceptanceRadius; // 0x4b8(0x04)
	char pad_4BC[0xdc]; // 0x4bc(0xdc)

	void SensingComponent_OnActorSensed(struct TArray<struct AActor*>& actorsPercepted); // Function ConZ.ArmedNPCBaseAIController.SensingComponent_OnActorSensed // (Final|Native|Private|HasOutParms) // @ game+0x234f8a0
};

// Class ConZ.ArmedNPCBaseAnimInstance
// Size: 0x510 (Inherited: 0x2c0)
struct UArmedNPCBaseAnimInstance : UAnimInstance {
	char pad_2C0[0x8]; // 0x2c0(0x08)
	enum class EArmedNPCBaseMovementPace _desiredMovementPace; // 0x2c8(0x01)
	enum class EPrisonerGroundStance _stance; // 0x2c9(0x01)
	char pad_2CA[0x2]; // 0x2ca(0x02)
	float _desiredCourseAngle; // 0x2cc(0x04)
	float _groundStartAnimPlayRate; // 0x2d0(0x04)
	struct FVector _acceleration; // 0x2d4(0x0c)
	struct FVector _velocity; // 0x2e0(0x0c)
	float _speedXY; // 0x2ec(0x04)
	bool _wantsToMove; // 0x2f0(0x01)
	bool _wantsToWalk; // 0x2f1(0x01)
	char pad_2F2[0x2]; // 0x2f2(0x02)
	float _stoppingDistance; // 0x2f4(0x04)
	bool _shouldUseLUGroundStopAnimation; // 0x2f8(0x01)
	char pad_2F9[0x3]; // 0x2f9(0x03)
	float _legsPoseBeforeGroundStop; // 0x2fc(0x04)
	enum class ECardinalDirection _movementDirectionBeforeGroundStop; // 0x300(0x01)
	bool _wantsToJog; // 0x301(0x01)
	bool _wantsToRun; // 0x302(0x01)
	enum class EPrisonerAnimationSet _animationSet; // 0x303(0x01)
	enum class EPrisonerAnimationSet _animationSetBeforeGroundStop; // 0x304(0x01)
	bool _shouldUseWeaponAnimationPose; // 0x305(0x01)
	enum class EPrisonerCombatMode _combatMode; // 0x306(0x01)
	enum class EWeaponType _weaponType; // 0x307(0x01)
	float _weaponAimYaw; // 0x308(0x04)
	float _weaponAimPitch; // 0x30c(0x04)
	bool _hasAimLocation; // 0x310(0x01)
	char pad_311[0x3]; // 0x311(0x03)
	struct FVector _handRAimLocation; // 0x314(0x0c)
	struct FVector _supportingHandIKLocation; // 0x320(0x0c)
	bool _shouldIgnoreSupportingHandIK; // 0x32c(0x01)
	char pad_32D[0x3]; // 0x32d(0x03)
	float _leftHandIKAmount; // 0x330(0x04)
	bool _isAimingBow; // 0x334(0x01)
	bool _shouldSkipStandWalkOrJogOrRunStart; // 0x335(0x01)
	char pad_336[0x2]; // 0x336(0x02)
	struct UAnimSequenceBase* _meleeSkill_PrimaryIdleAnimation; // 0x338(0x08)
	struct UAnimSequenceBase* _meleeSkill_TiredIdleAnimation; // 0x340(0x08)
	struct UAnimSequenceBase* _meleeSkill_WalkingIdleAnimation; // 0x348(0x08)
	struct UAnimSequenceBase* _meleeSkill_BlockIdleAnimation; // 0x350(0x08)
	struct UBlendSpace* _meleeSkill_AimOffsetBlendSpace; // 0x358(0x08)
	float _meleeSkill_IdleToBlockBlendDuration; // 0x360(0x04)
	float _meleeSkill_BlockToIdleBlendDuration; // 0x364(0x04)
	float _meleeSkill_ExhaustionFactor; // 0x368(0x04)
	bool _shouldUseUnarmedCombatWalk; // 0x36c(0x01)
	bool _isHoldingBlock; // 0x36d(0x01)
	char pad_36E[0x2]; // 0x36e(0x02)
	struct FRotator _handAimCorrectionRotator; // 0x370(0x0c)
	char pad_37C[0x194]; // 0x37c(0x194)

	bool IsCourseAngleSupportedByStartAndStopAnimations(float courseAngle); // Function ConZ.ArmedNPCBaseAnimInstance.IsCourseAngleSupportedByStartAndStopAnimations // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234f5a0
	struct UAnimSequenceBase* GetWeaponAnimationPoseOnWorkerThread(enum class EWeaponAnimationPose animationPose, enum class EPrisonerGroundStance stance); // Function ConZ.ArmedNPCBaseAnimInstance.GetWeaponAnimationPoseOnWorkerThread // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234f4a0
	float GetPlayRateFromSpeed(float speedInAnimation, float MinPlayRate, float MaxPlayRate); // Function ConZ.ArmedNPCBaseAnimInstance.GetPlayRateFromSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234f350
	void GetLeanBlendWeights(float& Left, float& Right, float Multiplier, struct UCurveFloat* strengthBySpeedCurve); // Function ConZ.ArmedNPCBaseAnimInstance.GetLeanBlendWeights // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x234f1d0
	float GetKnownCurveValueOnWorkerThread(enum class EPrisonerAnimationCurve Curve); // Function ConZ.ArmedNPCBaseAnimInstance.GetKnownCurveValueOnWorkerThread // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234f140
	float GetInPlaceTurningElapsedTimeRight(enum class EPrisonerGroundStance stance); // Function ConZ.ArmedNPCBaseAnimInstance.GetInPlaceTurningElapsedTimeRight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234f0b0
	float GetInPlaceTurningElapsedTimeLeft(enum class EPrisonerGroundStance stance); // Function ConZ.ArmedNPCBaseAnimInstance.GetInPlaceTurningElapsedTimeLeft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234f020
	float GetInPlaceTurningDirectionBlendAlpha(enum class EPrisonerGroundStance stance); // Function ConZ.ArmedNPCBaseAnimInstance.GetInPlaceTurningDirectionBlendAlpha // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234ef90
	float GetInPlaceTurningBlendAlpha(enum class EPrisonerGroundStance stance); // Function ConZ.ArmedNPCBaseAnimInstance.GetInPlaceTurningBlendAlpha // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234ef00
	enum class ECardinalDirection GetCardinalDirectionFromCourseAngle(float Value); // Function ConZ.ArmedNPCBaseAnimInstance.GetCardinalDirectionFromCourseAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234ee40
	float GetBoxingInPlaceTurningElapsedTimeRight(); // Function ConZ.ArmedNPCBaseAnimInstance.GetBoxingInPlaceTurningElapsedTimeRight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234ee10
	float GetBoxingInPlaceTurningElapsedTimeLeft(); // Function ConZ.ArmedNPCBaseAnimInstance.GetBoxingInPlaceTurningElapsedTimeLeft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234ede0
	float GetBoxingInPlaceTurningDirectionBlendAlpha(); // Function ConZ.ArmedNPCBaseAnimInstance.GetBoxingInPlaceTurningDirectionBlendAlpha // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234edb0
	float GetBoxingInPlaceTurningBlendAlpha(); // Function ConZ.ArmedNPCBaseAnimInstance.GetBoxingInPlaceTurningBlendAlpha // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234ed80
	void AnimNotify_RFootDown(); // Function ConZ.ArmedNPCBaseAnimInstance.AnimNotify_RFootDown // (Native|Event|Protected|BlueprintEvent) // @ game+0x234ed60
	void AnimNotify_LFootDown(); // Function ConZ.ArmedNPCBaseAnimInstance.AnimNotify_LFootDown // (Native|Event|Protected|BlueprintEvent) // @ game+0x234ed40
};

// Class ConZ.ArmedNPCBaseCommonData
// Size: 0x160 (Inherited: 0x30)
struct UArmedNPCBaseCommonData : UDataAsset {
	float MaxHealth; // 0x30(0x04)
	struct FFloatInterval SightAndAwarenessRange; // 0x34(0x08)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UArmedNPCVariationsData* Variations; // 0x40(0x08)
	struct TArray<struct TSoftClassPtr<UObject>> PossibleItemInHands; // 0x48(0x10)
	struct TArray<struct TSoftClassPtr<UObject>> PossibleItemsOnSearch; // 0x58(0x10)
	struct UArmedNPCDifficultyLevelSettings* DifficultyLevelSettings; // 0x68(0x08)
	struct UArmedNPCDamageCustomizationData* DamageCustomizationData; // 0x70(0x08)
	float TimeForItemsToGetSoakedOnRain; // 0x78(0x04)
	float TimeForItemsToGetDry; // 0x7c(0x04)
	struct UPhysicalSurfacesData* PhysicalSurfacesData; // 0x80(0x08)
	struct FName HeadBoneName; // 0x88(0x08)
	enum class ESkillLevel MeleSkillLevel; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct UMeleeSkillAnimationsPreset* BoxingSkillAnimationsPreset; // 0x98(0x08)
	struct FArmedNPCMeleeAttackTypes MeleeAttackTypes; // 0xa0(0x88)
	struct FGameplayTag MeleeAttackCapsulesAttachmentForItemInRHand; // 0x128(0x08)
	struct FGameplayTag HitReactTypeWhenStanding; // 0x130(0x08)
	struct FGameplayTag HitReactTypeWhenStandingInCombatMode; // 0x138(0x08)
	struct FGameplayTag HitReactTypeWhenCrouching; // 0x140(0x08)
	struct FGameplayTag HitReactTypeWhenProne; // 0x148(0x08)
	struct UAnimMontage* AnimationsForEvents[0x2]; // 0x150(0x10)
};

// Class ConZ.ArmedNPCBaseMovementComponent
// Size: 0xdd0 (Inherited: 0xda0)
struct UArmedNPCBaseMovementComponent : UConZCharacterMovementComponent {
	char pad_DA0[0x4]; // 0xda0(0x04)
	float _speed[0x4]; // 0xda4(0x10)
	float _acceleration[0x4]; // 0xdb4(0x10)
	float _turnRate[0x2]; // 0xdc4(0x08)
	char pad_DCC[0x4]; // 0xdcc(0x04)

	float GetDesiredCourseAngle(); // Function ConZ.ArmedNPCBaseMovementComponent.GetDesiredCourseAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234eed0
};

// Class ConZ.ArmedNPCDamageCustomizationData
// Size: 0x98 (Inherited: 0x30)
struct UArmedNPCDamageCustomizationData : UDataAsset {
	float PointDamageMultiplierPerBodyPart[0xc]; // 0x30(0x30)
	float MeleeDamageMultiplierPerBodyPart[0xc]; // 0x60(0x30)
	float HeadshotInstantKillEnergyThreshold; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class ConZ.ArmedNPCDifficultyLevelSettings
// Size: 0x40 (Inherited: 0x30)
struct UArmedNPCDifficultyLevelSettings : UDataAsset {
	struct TArray<struct FArmedNPCDifficultyLevelSettingProperties> Levels; // 0x30(0x10)
};

// Class ConZ.ArmedNPCSoundComponent
// Size: 0x1e0 (Inherited: 0x128)
struct UArmedNPCSoundComponent : UCharacterSoundComponent {
	char pad_128[0x10]; // 0x128(0x10)
	struct UAkAudioEvent* RelaxedStanceEnteredAudioEvent; // 0x138(0x08)
	struct UAkAudioEvent* AlertedStanceEnteredAudioEvent; // 0x140(0x08)
	struct UAkAudioEvent* CombatStanceEnteredAudioEvent; // 0x148(0x08)
	struct UAkAudioEvent* FootstepAudioEvent; // 0x150(0x08)
	struct UAkAudioEvent* StopAllAudioEvent; // 0x158(0x08)
	struct UAkAudioEvent* DeathAudioEvent; // 0x160(0x08)
	struct UAkAudioEvent* StartSearchCorpseAudioEvent; // 0x168(0x08)
	struct UAkAudioEvent* StopSearchCorpseAudioEvent; // 0x170(0x08)
	struct UAkAudioEvent* FootstepsAudioEvent; // 0x178(0x08)
	struct UArmedNPCVoiceLinesData* VoiceLinesByPersonality[0x9]; // 0x180(0x48)
	char pad_1C8[0x18]; // 0x1c8(0x18)

	void PlayFootstepSounds(enum class EPhysicalSurface inPhysicalSurface); // Function ConZ.ArmedNPCSoundComponent.PlayFootstepSounds // (Final|Native|Public|BlueprintCallable) // @ game+0x234f820
	void OnAkPostEventCallback(enum class EAkCallbackType CallbackType, struct UAkCallbackInfo* CallbackInfo); // Function ConZ.ArmedNPCSoundComponent.OnAkPostEventCallback // (Final|Native|Private) // @ game+0x234f630
};

// Class ConZ.ArmedNPCVariationsData
// Size: 0x40 (Inherited: 0x30)
struct UArmedNPCVariationsData : UDataAsset {
	struct TArray<struct FArmedNPCVariation> Physical; // 0x30(0x10)
};

// Class ConZ.ArmedNPCVoiceLinesData
// Size: 0x60 (Inherited: 0x30)
struct UArmedNPCVoiceLinesData : UDataAsset {
	struct UAkAudioEvent* Lines[0x6]; // 0x30(0x30)
};

// Class ConZ.ArmedNPCWeaponManual
// Size: 0x28 (Inherited: 0x28)
struct UArmedNPCWeaponManual : UObject {

	void Tick(float DeltaTime); // Function ConZ.ArmedNPCWeaponManual.Tick // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x234f950
	void OnCharacterActionEnded(struct UCharacterAction* action); // Function ConZ.ArmedNPCWeaponManual.OnCharacterActionEnded // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x234f790
	void OnArmedNPCDifficultyLevelChanged(int32_t Level); // Function ConZ.ArmedNPCWeaponManual.OnArmedNPCDifficultyLevelChanged // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x234f700
	bool IsOutOfAmmo(); // Function ConZ.ArmedNPCWeaponManual.IsOutOfAmmo // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x9a5e70
	void Initialize(); // Function ConZ.ArmedNPCWeaponManual.Initialize // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x234f580
	struct AWeapon* GetWeapon(); // Function ConZ.ArmedNPCWeaponManual.GetWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x234f470
};

// Class ConZ.ArmedNPCWeaponManualBow
// Size: 0x88 (Inherited: 0x28)
struct UArmedNPCWeaponManualBow : UArmedNPCWeaponManual {
	char pad_28[0x18]; // 0x28(0x18)
	struct AAmmunitionArrow* AmmoClass; // 0x40(0x08)
	char pad_48[0x40]; // 0x48(0x40)
};

// Class ConZ.ArmedNPCWeaponManualCrossbow
// Size: 0x68 (Inherited: 0x28)
struct UArmedNPCWeaponManualCrossbow : UArmedNPCWeaponManual {
	char pad_28[0x10]; // 0x28(0x10)
	struct AAmmunitionArrow* AmmoClass; // 0x38(0x08)
	char pad_40[0x28]; // 0x40(0x28)
};

// Class ConZ.ArmedNPCWeaponManualHandgun
// Size: 0x80 (Inherited: 0x28)
struct UArmedNPCWeaponManualHandgun : UArmedNPCWeaponManual {
	char pad_28[0x58]; // 0x28(0x58)
};

// Class ConZ.ArmedNPCWeaponManualRifleAutomatic
// Size: 0x70 (Inherited: 0x28)
struct UArmedNPCWeaponManualRifleAutomatic : UArmedNPCWeaponManual {
	char pad_28[0x48]; // 0x28(0x48)
};

// Class ConZ.ArmedNPCWeaponManualRifleManual
// Size: 0x70 (Inherited: 0x28)
struct UArmedNPCWeaponManualRifleManual : UArmedNPCWeaponManual {
	char pad_28[0x48]; // 0x28(0x48)
};

// Class ConZ.ArrayStatics
// Size: 0x28 (Inherited: 0x28)
struct UArrayStatics : UBlueprintFunctionLibrary {
};

// Class ConZ.ReplenishableResourceBaseComponent
// Size: 0x640 (Inherited: 0x5a0)
struct UReplenishableResourceBaseComponent : UInstancedStaticMeshComponent {
	char pad_5A0[0x8]; // 0x5a0(0x08)
	struct FReplenishableResourceDescription _replenishableResourceDescription; // 0x5a8(0x88)
	struct FName _replenishableResourceAmountMaterialParameterName; // 0x630(0x08)
	char pad_638[0x8]; // 0x638(0x08)
};

// Class ConZ.ATMReplenishableResourceComponent
// Size: 0x640 (Inherited: 0x640)
struct UATMReplenishableResourceComponent : UReplenishableResourceBaseComponent {
};

// Class ConZ.ItemComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UItemComponent : UActorComponent {
	char pad_B0[0x18]; // 0xb0(0x18)
};

// Class ConZ.AttachableItemComponent
// Size: 0x170 (Inherited: 0xc8)
struct UAttachableItemComponent : UItemComponent {
	char pad_C8[0x18]; // 0xc8(0x18)
	struct FTransform _attachRelativeTransform; // 0xe0(0x30)
	float _damage; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct FText _interactionText; // 0x118(0x18)
	char pad_130[0x40]; // 0x130(0x40)

	void OnGardenDestroyed(uint16_t GardenId); // Function ConZ.AttachableItemComponent.OnGardenDestroyed // (Final|Native|Private) // @ game+0x2353f10
	void OnFortificationDestroyed(struct FEntityComponentId fortificationEntityComponentId); // Function ConZ.AttachableItemComponent.OnFortificationDestroyed // (Final|Native|Private) // @ game+0x2353e80
	void OnBaseElementDestroyed(struct FDbIntegerId BaseElementId); // Function ConZ.AttachableItemComponent.OnBaseElementDestroyed // (Final|Native|Private) // @ game+0x2353e00
	void NetMulticast_OnAttachActorDestroyed(); // Function ConZ.AttachableItemComponent.NetMulticast_OnAttachActorDestroyed // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x2353de0
};

// Class ConZ.AttachmentSocketMountType
// Size: 0x28 (Inherited: 0x28)
struct UAttachmentSocketMountType : UObject {
};

// Class ConZ.AttachmentSocketMountTypePrisonerHand
// Size: 0x28 (Inherited: 0x28)
struct UAttachmentSocketMountTypePrisonerHand : UAttachmentSocketMountType {
};

// Class ConZ.AudibleButtonComponent
// Size: 0x78 (Inherited: 0x28)
struct UAudibleButtonComponent : UObject {
	struct TMap<enum class EButtonEventType, struct UAkAudioEvent*> _audioEvents; // 0x28(0x50)
};

// Class ConZ.AudioDeviceDisplay
// Size: 0x270 (Inherited: 0x268)
struct UAudioDeviceDisplay : UUserWidget {
	struct UTextBlock* _deviceName; // 0x268(0x08)
};

// Class ConZ.AudioSettingsManager
// Size: 0x28 (Inherited: 0x28)
struct UAudioSettingsManager : UObject {
};

// Class ConZ.AudioStatics
// Size: 0x28 (Inherited: 0x28)
struct UAudioStatics : UBlueprintFunctionLibrary {

	void StopAkActor(struct AActor* Actor); // Function ConZ.AudioStatics.StopAkActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x23545c0
	void SetAkRTPCValue(struct FName RTPC, float Value, int32_t InterpolationTimeMs, struct AActor* Actor); // Function ConZ.AudioStatics.SetAkRTPCValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2354470
	int32_t PostAndWaitForEndOfAkEvent(struct UAkAudioEvent* akEvent, struct AActor* Actor, bool bStopWhenAttachedToDestroyed, struct FLatentActionInfo LatentInfo); // Function ConZ.AudioStatics.PostAndWaitForEndOfAkEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x23542f0
	int32_t PostAkEventAtLocation(struct UAkAudioEvent* akEvent, struct FVector Location, struct FRotator Orientation, struct UObject* WorldContextObject); // Function ConZ.AudioStatics.PostAkEventAtLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x2354170
	int32_t PostAkAudioEventToAudioComponent(struct UAkAudioEvent* akEvent, struct UAkComponent* AkComponent); // Function ConZ.AudioStatics.PostAkAudioEventToAudioComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x23540a0
	int32_t PostAkAudioEvent(struct UAkAudioEvent* akEvent, struct AActor* Actor, bool bStopWhenAttachedToDestroyed); // Function ConZ.AudioStatics.PostAkAudioEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353fa0
	struct FName GetMovementPaceSwitchValue(enum class EPrisonerMovementPace Value); // Function ConZ.AudioStatics.GetMovementPaceSwitchValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353d50
	struct FName GetMovementPaceSwitchName(); // Function ConZ.AudioStatics.GetMovementPaceSwitchName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353d10
	struct FName GetMotionIntensitySwitchValue(enum class EMotionIntensity Value); // Function ConZ.AudioStatics.GetMotionIntensitySwitchValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353c80
	struct FName GetMotionIntensitySwitchName(); // Function ConZ.AudioStatics.GetMotionIntensitySwitchName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353c40
	struct FName GetMaterialSwitchValue(enum class EPhysicalSurface Value); // Function ConZ.AudioStatics.GetMaterialSwitchValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353bb0
	struct FName GetMaterialSwitchName(); // Function ConZ.AudioStatics.GetMaterialSwitchName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353b70
	struct FName GetImpactSeveritySwitchName(); // Function ConZ.AudioStatics.GetImpactSeveritySwitchName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353b30
	struct FName GetHitSeveritySwitchValue(enum class EHitSeverity Value); // Function ConZ.AudioStatics.GetHitSeveritySwitchValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353aa0
	struct FName GetGenderSwitchValue(enum class EConZGender Value); // Function ConZ.AudioStatics.GetGenderSwitchValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353a10
	struct FName GetGenderSwitchName(); // Function ConZ.AudioStatics.GetGenderSwitchName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x23539d0
	struct FName GetEnvironmentSwitchValue(enum class EEnvironmentClass Value); // Function ConZ.AudioStatics.GetEnvironmentSwitchValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353940
	struct FName GetEnvironmentSwitchName(); // Function ConZ.AudioStatics.GetEnvironmentSwitchName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353900
	struct FName GetCharacterPainSeveritySwitchValue(enum class ECharacterPainSoundSeverity Value); // Function ConZ.AudioStatics.GetCharacterPainSeveritySwitchValue // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353870
	struct FName GetCharacterPainSeveritySwitchName(); // Function ConZ.AudioStatics.GetCharacterPainSeveritySwitchName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2353830
	void GetAkRTPCValue(struct FName RTPC, float& OutValue, enum class ERTPCValueType& outValueType, struct AActor* Actor); // Function ConZ.AudioStatics.GetAkRTPCValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x23536c0
};

// Class ConZ.ItemAnimInstance
// Size: 0x2d0 (Inherited: 0x2c0)
struct UItemAnimInstance : UAnimInstance {
	enum class EPrisonerGroundStance _owningPrisonerStance; // 0x2c0(0x01)
	bool _isOwningPrisonerInFirstPersonView; // 0x2c1(0x01)
	char pad_2C2[0xe]; // 0x2c2(0x0e)
};

// Class ConZ.WeaponAttachmentMagazineAnimInstance
// Size: 0x2e0 (Inherited: 0x2d0)
struct UWeaponAttachmentMagazineAnimInstance : UItemAnimInstance {
	int32_t _ammoCount; // 0x2d0(0x04)
	bool _hasAmmo; // 0x2d4(0x01)
	bool _isAttachedToWeapon; // 0x2d5(0x01)
	enum class EMagazineAmmoCountType _ammoCountType; // 0x2d6(0x01)
	bool ShouldPlayIdleEmpty; // 0x2d7(0x01)
	char pad_2D8[0x8]; // 0x2d8(0x08)
};

// Class ConZ.AutoCrossbowMagazineAnimInstance
// Size: 0x2f0 (Inherited: 0x2e0)
struct UAutoCrossbowMagazineAnimInstance : UWeaponAttachmentMagazineAnimInstance {
	float _followerBoneLocationOffset; // 0x2e0(0x04)
	char pad_2E4[0xc]; // 0x2e4(0x0c)
};

// Class ConZ.AvailabilityGrid
// Size: 0x225578 (Inherited: 0x28)
struct UAvailabilityGrid : UObject {
	char pad_28[0x20]; // 0x28(0x20)
	struct FGameplayTag _waterImageAssetTag; // 0x48(0x08)
	char pad_50[0x225528]; // 0x50(0x225528)
};

// Class ConZ.DexteritySkill
// Size: 0xb0 (Inherited: 0xb0)
struct UDexteritySkill : USkill {
};

// Class ConZ.VehicleHandlingSkill
// Size: 0xb0 (Inherited: 0xb0)
struct UVehicleHandlingSkill : UDexteritySkill {
};

// Class ConZ.AviationSkill
// Size: 0x5d8 (Inherited: 0xb0)
struct UAviationSkill : UVehicleHandlingSkill {
	struct FVehicleHandlingExperienceAwards NoSkillExperienceAwards; // 0xb0(0x08)
	struct FVehicleHandlingExperienceAwards BasicSkillExperienceAwards; // 0xb8(0x08)
	struct FVehicleHandlingExperienceAwards MediumSkillExperienceAwards; // 0xc0(0x08)
	struct FVehicleHandlingExperienceAwards AdvancedSkillExperienceAwards; // 0xc8(0x08)
	struct FVehicleHandlingExperienceAwards AboveAdvancedSkillExperienceAwards; // 0xd0(0x08)
	struct FAviationSkillParametersPerSkillLevel NoSkillParameters; // 0xd8(0x100)
	struct FAviationSkillParametersPerSkillLevel BasicSkillParameters; // 0x1d8(0x100)
	struct FAviationSkillParametersPerSkillLevel MediumSkillParameters; // 0x2d8(0x100)
	struct FAviationSkillParametersPerSkillLevel AdvancedSkillParameters; // 0x3d8(0x100)
	struct FAviationSkillParametersPerSkillLevel AboveAdvancedSkillParameters; // 0x4d8(0x100)
};

// Class ConZ.AwarenessSkill
// Size: 0x3c0 (Inherited: 0xb0)
struct UAwarenessSkill : UIntelligenceSkill {
	char pad_B0[0x10]; // 0xb0(0x10)
	struct UAkAudioEvent* EnterFocusModeAudioEvent; // 0xc0(0x08)
	struct UAkAudioEvent* LeaveFocusModeAudioEvent; // 0xc8(0x08)
	float _updateTime; // 0xd0(0x04)
	float _serverUpdateTime; // 0xd4(0x04)
	float _staminaConsumption; // 0xd8(0x04)
	float _focusModeActivationTime; // 0xdc(0x04)
	struct FAwarenessSkillExperienceAwards NoSkillExperienceAwards; // 0xe0(0x0c)
	struct FAwarenessSkillExperienceAwards BasicSkillExperienceAwards; // 0xec(0x0c)
	struct FAwarenessSkillExperienceAwards MediumSkillExperienceAwards; // 0xf8(0x0c)
	struct FAwarenessSkillExperienceAwards AdvancedSkillExperienceAwards; // 0x104(0x0c)
	struct FAwarenessSkillExperienceAwards AboveAdvancedSkillExperienceAwards; // 0x110(0x0c)
	struct FAwarenessSkillParametersPerSkillLevel NoSkillParameters; // 0x11c(0x54)
	struct FAwarenessSkillParametersPerSkillLevel BasicSkillParameters; // 0x170(0x54)
	struct FAwarenessSkillParametersPerSkillLevel MediumSkillParameters; // 0x1c4(0x54)
	struct FAwarenessSkillParametersPerSkillLevel AdvancedSkillParameters; // 0x218(0x54)
	struct FAwarenessSkillParametersPerSkillLevel AboveAdvancedSkillParameters; // 0x26c(0x54)
	char pad_2C0[0x100]; // 0x2c0(0x100)

	void EnterFocusMode(); // Function ConZ.AwarenessSkill.EnterFocusMode // (Final|Native|Public) // @ game+0x23536a0
};

// Class ConZ.BadAdjustableSeparator
// Size: 0x278 (Inherited: 0x268)
struct UBadAdjustableSeparator : UUserWidget {
	struct USizeBox* UpperSizeBox; // 0x268(0x08)
	float HeightOverride; // 0x270(0x04)
	bool TradingRelated; // 0x274(0x01)
	char pad_275[0x3]; // 0x275(0x03)
};

// Class ConZ.BankAccountRegistry
// Size: 0x1c8 (Inherited: 0xb0)
struct UBankAccountRegistry : UActorComponent {
	char pad_B0[0x118]; // 0xb0(0x118)

	void ResetDailyTransactionLimitsOnAllAccounts(); // Function ConZ.BankAccountRegistry.ResetDailyTransactionLimitsOnAllAccounts // (Final|Native|Private) // @ game+0x2354450
};

// Class ConZ.PlayerRpcChannelServerRequest
// Size: 0x28 (Inherited: 0x28)
struct UPlayerRpcChannelServerRequest : UObject {
};

// Class ConZ.BankAccountRegistryRequest
// Size: 0x48 (Inherited: 0x28)
struct UBankAccountRegistryRequest : UPlayerRpcChannelServerRequest {
	char pad_28[0x20]; // 0x28(0x20)
};

// Class ConZ.PlayerRpcChannelServerResponse
// Size: 0x28 (Inherited: 0x28)
struct UPlayerRpcChannelServerResponse : UObject {
};

// Class ConZ.BankAccountRegistryResponse
// Size: 0x30 (Inherited: 0x28)
struct UBankAccountRegistryResponse : UPlayerRpcChannelServerResponse {
	struct UBankAccountRegistryResponseDataObject* _payload; // 0x28(0x08)
};

// Class ConZ.BankAccountRegistryResponseDataObject
// Size: 0xa0 (Inherited: 0x28)
struct UBankAccountRegistryResponseDataObject : UObject {
	char pad_28[0x78]; // 0x28(0x78)
};

// Class ConZ.BankAccountRegistryStatics
// Size: 0x28 (Inherited: 0x28)
struct UBankAccountRegistryStatics : UBlueprintFunctionLibrary {
};

// Class ConZ.BankATMAccountInfo
// Size: 0x308 (Inherited: 0x268)
struct UBankATMAccountInfo : UUserWidget {
	char pad_268[0x18]; // 0x268(0x18)
	struct UTextBlock* _accountNumber; // 0x280(0x08)
	struct UTextBlock* _accountName; // 0x288(0x08)
	struct UTextBlock* _cardType; // 0x290(0x08)
	struct UTextBlock* _renewalAmount; // 0x298(0x08)
	struct UHorizontalBox* _goldAmountHorizontalBox; // 0x2a0(0x08)
	struct UTextBlock* _goldAmount; // 0x2a8(0x08)
	struct UBankATMPointingButton* _btnReturn; // 0x2b0(0x08)
	struct TMap<enum class EBankCardType, struct FSlateColor> _cardTypeFontColor; // 0x2b8(0x50)
};

// Class ConZ.BankATMAccountSummary
// Size: 0x290 (Inherited: 0x268)
struct UBankATMAccountSummary : UUserWidget {
	struct UTextBlock* _accountBalance; // 0x268(0x08)
	struct UHorizontalBox* _ATMOperationalTransactionLimitHorizontalBox; // 0x270(0x08)
	struct UTextBlock* _ATMOperationalTransactionLimit; // 0x278(0x08)
	struct UHorizontalBox* _cardOperationalTransactionLimitHorizontalBox; // 0x280(0x08)
	struct UTextBlock* _cardOperationalTransactionLimit; // 0x288(0x08)
};

// Class ConZ.BankATMBoughtCard
// Size: 0x3c8 (Inherited: 0x268)
struct UBankATMBoughtCard : UUserWidget {
	char pad_268[0x18]; // 0x268(0x18)
	enum class EBankATMCardUIType _cardQualityType; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
	struct TMap<enum class EBankATMCardUIType, struct FSlateBrush> _cardBrushes; // 0x288(0x50)
	struct FBankATMBoughtCardStateVisual _normalVisuals; // 0x2d8(0x40)
	struct FBankATMBoughtCardStateVisual _hoveredVisuals; // 0x318(0x40)
	struct FBankATMBoughtCardStateVisual _pressedVisuals; // 0x358(0x40)
	struct UOverlay* _visualOverlay; // 0x398(0x08)
	struct UImage* _imgCardBackground; // 0x3a0(0x08)
	struct UTextBlock* _textCardType; // 0x3a8(0x08)
	struct UTextBlock* _textCardNumber; // 0x3b0(0x08)
	struct UWidgetSwitcher* _optionsCircleSwitcher; // 0x3b8(0x08)
	char pad_3C0[0x8]; // 0x3c0(0x08)
};

// Class ConZ.BankATMBuyableCard
// Size: 0x2f0 (Inherited: 0x268)
struct UBankATMBuyableCard : UUserWidget {
	char pad_268[0x18]; // 0x268(0x18)
	enum class EBankATMCardUIType _cardQualityType; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	struct FBankATMBuyableCardStateVisual _normalVisuals; // 0x284(0x0c)
	struct FBankATMBuyableCardStateVisual _hoveredAndPressedVisuals; // 0x290(0x0c)
	struct FBankATMBuyableCardStateVisual _disabledVisuals; // 0x29c(0x0c)
	struct UWidgetSwitcher* _visualStateSwitcher; // 0x2a8(0x08)
	struct UImage* _toggleablePlusCircle; // 0x2b0(0x08)
	struct UTextBlock* _textCardType; // 0x2b8(0x08)
	struct UTextBlock* _textFreeRenewals; // 0x2c0(0x08)
	struct UTextBlock* _textDigitsOfPin; // 0x2c8(0x08)
	struct UTextBlock* _textOperationalTransactionLimit; // 0x2d0(0x08)
	struct UTextBlock* _textGoldPurchaseAvailable; // 0x2d8(0x08)
	struct UTextBlock* _textCardCost; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)
};

// Class ConZ.BankATMCardManagementOptionsScreen
// Size: 0x2d8 (Inherited: 0x268)
struct UBankATMCardManagementOptionsScreen : UUserWidget {
	char pad_268[0x50]; // 0x268(0x50)
	struct UBankATMPointingButton* _btnRenew; // 0x2b8(0x08)
	struct UBankATMPointingButton* _btnDelete; // 0x2c0(0x08)
	struct UBankATMPointingButton* _btnReturn; // 0x2c8(0x08)
	struct UBankATMErrorPopup* _popupMessage; // 0x2d0(0x08)
};

// Class ConZ.BankATMCarouselCard
// Size: 0x2f0 (Inherited: 0x268)
struct UBankATMCarouselCard : UUserWidget {
	char pad_268[0x18]; // 0x268(0x18)
	struct UWidgetSwitcher* _typeSwitcher; // 0x280(0x08)
	struct UTextBlock* _numberLabel; // 0x288(0x08)
	struct UImage* _ownershipIcon; // 0x290(0x08)
	struct UPanelWidget* _expirationNotice; // 0x298(0x08)
	struct FColor _stolenCardColor; // 0x2a0(0x04)
	char pad_2A4[0x8]; // 0x2a4(0x08)
	struct FBankATMCarouselCardStateVisual _normalVisuals; // 0x2ac(0x10)
	struct FBankATMCarouselCardStateVisual _hoveredVisuals; // 0x2bc(0x10)
	struct FBankATMCarouselCardStateVisual _pressedVisuals; // 0x2cc(0x10)
	struct FBankATMCarouselCardStateVisual _disabledVisuals; // 0x2dc(0x10)
	char pad_2EC[0x4]; // 0x2ec(0x04)
};

// Class ConZ.BankATMChooseTransaction
// Size: 0x318 (Inherited: 0x268)
struct UBankATMChooseTransaction : UUserWidget {
	char pad_268[0x78]; // 0x268(0x78)
	struct UBankATMPointingButton* _btnWithdraw; // 0x2e0(0x08)
	struct UBankATMPointingButton* _btnDeposit; // 0x2e8(0x08)
	struct UBankATMPointingButton* _btnTransfer; // 0x2f0(0x08)
	struct UBankATMPointingButton* _btnEjectCard; // 0x2f8(0x08)
	struct UBankATMPointingButton* _btnAccountInfo; // 0x300(0x08)
	struct UBankATMPointingButton* _btnBuyGold; // 0x308(0x08)
	struct UBankATMPointingButton* _btnSellGold; // 0x310(0x08)
};

// Class ConZ.BankATMEnterPin
// Size: 0x2e0 (Inherited: 0x268)
struct UBankATMEnterPin : UUserWidget {
	char pad_268[0x20]; // 0x268(0x20)
	struct UWidgetSwitcher* _pinEnteringSwitcher; // 0x288(0x08)
	struct UTextBlock* _enterPinTitleMessage; // 0x290(0x08)
	struct UPanelWidget* _pinSlotsPanel; // 0x298(0x08)
	struct UBankATMPinSlot* _pinSlotClass; // 0x2a0(0x08)
	struct UPanelWidget* _incorrectPinWarning; // 0x2a8(0x08)
	struct UTextBlock* _remainingAttemptsLabel; // 0x2b0(0x08)
	struct UBankATMPointingButton* _btnReturn; // 0x2b8(0x08)
	struct UBankATMPointingButton* _btnSubmit; // 0x2c0(0x08)
	char pad_2C8[0x18]; // 0x2c8(0x18)
};

// Class ConZ.BankATMErrorPopup
// Size: 0x288 (Inherited: 0x268)
struct UBankATMErrorPopup : UUserWidget {
	struct UTextBlock* _popupMessage; // 0x268(0x08)
	char pad_270[0x4]; // 0x270(0x04)
	float _fadeInTime; // 0x274(0x04)
	float _displayHoldTime; // 0x278(0x04)
	float _fadeOutTime; // 0x27c(0x04)
	char pad_280[0x8]; // 0x280(0x08)
};

// Class ConZ.BankATMGoldTrading
// Size: 0x370 (Inherited: 0x268)
struct UBankATMGoldTrading : UUserWidget {
	char pad_268[0x58]; // 0x268(0x58)
	struct UConZCustomInteractionButton* _btnEjectCard; // 0x2c0(0x08)
	struct UWidgetSwitcher* _buttonSwitcher; // 0x2c8(0x08)
	struct UBankATMPointingButton* _btnReturn; // 0x2d0(0x08)
	struct UBankATMPointingButton* _btnSubmit; // 0x2d8(0x08)
	struct UBankATMPointingButton* _btnNo; // 0x2e0(0x08)
	struct UBankATMPointingButton* _btnYes; // 0x2e8(0x08)
	struct UWidgetSwitcher* _subsectionSwitcher; // 0x2f0(0x08)
	struct UTextBlock* _goldBuyConversionLabel; // 0x2f8(0x08)
	struct UBankATMVirtualEditbox* _editBuyAmount; // 0x300(0x08)
	struct UTextBlock* _creditsLostLabel; // 0x308(0x08)
	struct UTextBlock* _goldSellConversionLabel; // 0x310(0x08)
	struct UBankATMVirtualEditbox* _editSellAmount; // 0x318(0x08)
	struct UTextBlock* _creditsGainedLabel; // 0x320(0x08)
	struct UTextBlock* _questionLabel; // 0x328(0x08)
	struct UTextBlock* _errorLabel; // 0x330(0x08)
	struct UBankATMGoldValueGraph* _goldValueGraph; // 0x338(0x08)
	struct UTextBlock* _goldBalanceTextBlock; // 0x340(0x08)
	struct UTextBlock* _fundsSourceWarning; // 0x348(0x08)
	char pad_350[0x20]; // 0x350(0x20)

	void HandleOnEjectClicked(); // Function ConZ.BankATMGoldTrading.HandleOnEjectClicked // (Final|Native|Private) // @ game+0x2359070
};

// Class ConZ.BankATMGoldValueGraph
// Size: 0x288 (Inherited: 0x268)
struct UBankATMGoldValueGraph : UUserWidget {
	struct UVerticalBox* _yAxisVerticalBox; // 0x268(0x08)
	struct UImage* _graphShadedAreaImg; // 0x270(0x08)
	struct UHorizontalBox* _xAxisHorizontalBox; // 0x278(0x08)
	struct UTextBlock* _graphDescriptionTextBox; // 0x280(0x08)
};

// Class ConZ.BankATMMainPanel
// Size: 0x2e8 (Inherited: 0x268)
struct UBankATMMainPanel : UUserWidget {
	struct FDelegate OnMouseMoveEvent; // 0x268(0x10)
	struct UWidget* _virtualMouseCursorWidget; // 0x278(0x08)
	char pad_280[0x10]; // 0x280(0x10)
	struct UWidgetSwitcher* _panelSwitcher; // 0x290(0x08)
	struct UBankATMWelcomeScreen* _welcomeScreen; // 0x298(0x08)
	struct UBankATMEnterPin* _enterPinScreen; // 0x2a0(0x08)
	struct UBankATMChooseTransaction* _chooseTransactionScreen; // 0x2a8(0x08)
	struct UBankATMMoneyTransfer* _moneyTransferScreen; // 0x2b0(0x08)
	struct UBankATMGoldTrading* _goldTradingScreen; // 0x2b8(0x08)
	struct UBankATMManageCards* _manageCardsScreen; // 0x2c0(0x08)
	struct UBankATMAccountInfo* _accountInfoScreen; // 0x2c8(0x08)
	struct UBankATMAccountSummary* _accountSummaryHeader; // 0x2d0(0x08)
	struct UPanelWidget* _loadingOverlay; // 0x2d8(0x08)
	char pad_2E0[0x8]; // 0x2e0(0x08)
};

// Class ConZ.BankATMManageCards
// Size: 0x318 (Inherited: 0x268)
struct UBankATMManageCards : UUserWidget {
	char pad_268[0x28]; // 0x268(0x28)
	struct UWidgetSwitcher* _screenSwitcher; // 0x290(0x08)
	struct UHorizontalBox* _boughtCardsHorizontalBox; // 0x298(0x08)
	struct UBankATMBoughtCard* _boughtCardStarter; // 0x2a0(0x08)
	struct UBankATMBoughtCard* _boughtCardGold; // 0x2a8(0x08)
	struct UBankATMBoughtCard* _boughtCardClassic; // 0x2b0(0x08)
	struct UTextBlock* _textNoCards; // 0x2b8(0x08)
	struct UHorizontalBox* _buyableCardsHorizontalBox; // 0x2c0(0x08)
	struct UBankATMBuyableCard* _buyableCardClassic; // 0x2c8(0x08)
	struct UBankATMBuyableCard* _buyableCardGold; // 0x2d0(0x08)
	struct UTextBlock* _textInventoryBalance; // 0x2d8(0x08)
	struct UTextBlock* _textAccountBalance; // 0x2e0(0x08)
	struct UBankATMPointingButton* _btnBack; // 0x2e8(0x08)
	struct UBankATMCardManagementOptionsScreen* _cardManagementOptionsScreen; // 0x2f0(0x08)
	struct UBankATMYesNoConfirmationScreen* _purchaseConfirmationScreen; // 0x2f8(0x08)
	struct UBankATMYesNoConfirmationScreen* _cancellationConfirmationScreen; // 0x300(0x08)
	struct UBankATMYesNoConfirmationScreen* _renewalConfirmationScreen; // 0x308(0x08)
	char pad_310[0x8]; // 0x310(0x08)
};

// Class ConZ.Minigame
// Size: 0x340 (Inherited: 0x220)
struct AMinigame : AActor {
	char pad_220[0x30]; // 0x220(0x30)
	int32_t _testingMode; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct USceneComponent* _rootComponent; // 0x258(0x08)
	struct USceneCaptureComponent2D* _captureCam; // 0x260(0x08)
	struct USceneCaptureComponent2D* _captureMaskCam; // 0x268(0x08)
	char pad_270[0x8]; // 0x270(0x08)
	struct UMinigameWidget* _minigameWidget; // 0x278(0x08)
	struct UMinigameWidget* _minigameWidgetClass; // 0x280(0x08)
	char pad_288[0x28]; // 0x288(0x28)
	float _introDuration; // 0x2b0(0x04)
	float _outroDurationOnFail; // 0x2b4(0x04)
	float _outroDurationOnSuccess; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct TArray<struct UBaseMinigameAnimator*> _introAnimatorClasses; // 0x2c0(0x10)
	struct TArray<struct UBaseMinigameAnimator*> _outroAnimatorClasses; // 0x2d0(0x10)
	bool _canBeCanceled; // 0x2e0(0x01)
	enum class EPrisonerMontage _simulatedMontage; // 0x2e1(0x01)
	char pad_2E2[0x6]; // 0x2e2(0x06)
	struct UAkAudioEvent* _simulatedAudioStart; // 0x2e8(0x08)
	struct UAkAudioEvent* _simulatedAudioStop; // 0x2f0(0x08)
	struct TArray<struct UBaseItemTag*> _takeInHandsItemTagClasses; // 0x2f8(0x10)
	char pad_308[0x8]; // 0x308(0x08)
	struct TArray<struct TWeakObjectPtr<struct AItem>> _currentlyUsedTools; // 0x310(0x10)
	struct TArray<struct UBaseMinigameAnimator*> _introAnimators; // 0x320(0x10)
	struct TArray<struct UBaseMinigameAnimator*> _outroAnimators; // 0x330(0x10)
};

// Class ConZ.BankATMMinigame
// Size: 0x3a0 (Inherited: 0x340)
struct ABankATMMinigame : AMinigame {
	struct UBankATMUIController* _uiController; // 0x340(0x08)
	struct UStaticMeshComponent* _bankATMMesh; // 0x348(0x08)
	struct UWidgetComponent* _bankATMWidget; // 0x350(0x08)
	struct FVector _zoomStartLocation; // 0x358(0x0c)
	struct FVector _zoomEndLocation; // 0x364(0x0c)
	struct UCurveFloat* _zoomCurve; // 0x370(0x08)
	float _virtualMouseMinSensitivityModifier; // 0x378(0x04)
	float _virtualMouseMaxSensitivityModifier; // 0x37c(0x04)
	char pad_380[0x10]; // 0x380(0x10)
	struct UStaticMesh* _atmMesh; // 0x390(0x08)
	struct UStaticMesh* _tabletMesh; // 0x398(0x08)
};

// Class ConZ.MinigameConfiguration
// Size: 0x50 (Inherited: 0x28)
struct UMinigameConfiguration : UObject {
	struct AMinigame* minigameClass; // 0x28(0x08)
	char pad_30[0x20]; // 0x30(0x20)
};

// Class ConZ.BankATMMinigameConfiguration
// Size: 0x68 (Inherited: 0x50)
struct UBankATMMinigameConfiguration : UMinigameConfiguration {
	char pad_50[0x18]; // 0x50(0x18)
};

// Class ConZ.BankATMMoneyTransfer
// Size: 0x368 (Inherited: 0x268)
struct UBankATMMoneyTransfer : UUserWidget {
	char pad_268[0x40]; // 0x268(0x40)
	struct UButton* _btnEjectCard; // 0x2a8(0x08)
	struct UWidgetSwitcher* _buttonSwitcher; // 0x2b0(0x08)
	struct UBankATMPointingButton* _btnReturn; // 0x2b8(0x08)
	struct UBankATMPointingButton* _btnSubmit; // 0x2c0(0x08)
	struct UBankATMPointingButton* _btnNo; // 0x2c8(0x08)
	struct UBankATMPointingButton* _btnYes; // 0x2d0(0x08)
	struct UWidgetSwitcher* _subsectionSwitcher; // 0x2d8(0x08)
	struct UBankATMVirtualEditbox* _editAccountNumber; // 0x2e0(0x08)
	struct UBankATMVirtualEditbox* _editTransferAmount; // 0x2e8(0x08)
	struct UBankATMVirtualEditbox* _editDepositAmount; // 0x2f0(0x08)
	struct UBankATMVirtualEditbox* _editWithdrawAmount; // 0x2f8(0x08)
	struct UTextBlock* _questionLabel; // 0x300(0x08)
	struct UTextBlock* _errorLabel; // 0x308(0x08)
	struct UTextBlock* _commissionPercentageTextBlock; // 0x310(0x08)
	struct UTextBlock* _inventoryBalanceTextBlock; // 0x318(0x08)
	char pad_320[0x48]; // 0x320(0x48)

	void HandleOnEjectCardButtonClicked(); // Function ConZ.BankATMMoneyTransfer.HandleOnEjectCardButtonClicked // (Final|Native|Private) // @ game+0x2359050
};

// Class ConZ.BankATMMyCardsButton
// Size: 0x728 (Inherited: 0x268)
struct UBankATMMyCardsButton : UUserWidget {
	char pad_268[0x18]; // 0x268(0x18)
	struct UImage* _background; // 0x280(0x08)
	struct UImage* _cardIcon; // 0x288(0x08)
	struct UTextBlock* _labelMy; // 0x290(0x08)
	struct UTextBlock* _labelCards; // 0x298(0x08)
	char pad_2A0[0x8]; // 0x2a0(0x08)
	struct FBankATMMyCardsButtonStateVisual _normalVisuals; // 0x2a8(0x120)
	struct FBankATMMyCardsButtonStateVisual _hoveredVisuals; // 0x3c8(0x120)
	struct FBankATMMyCardsButtonStateVisual _pressedVisuals; // 0x4e8(0x120)
	struct FBankATMMyCardsButtonStateVisual _disabledVisuals; // 0x608(0x120)
};

// Class ConZ.BankATMPinSlot
// Size: 0x2b8 (Inherited: 0x268)
struct UBankATMPinSlot : UUserWidget {
	char pad_268[0x10]; // 0x268(0x10)
	struct UWidgetSwitcher* _pinNumberTypeSwitcher; // 0x278(0x08)
	struct UTextBlock* _pinNumber; // 0x280(0x08)
	struct UImage* _animatedEntryBar; // 0x288(0x08)
	struct UWidgetAnimation* _enterNumber; // 0x290(0x08)
	struct UWidgetAnimation* _enterNumberLast; // 0x298(0x08)
	char pad_2A0[0x10]; // 0x2a0(0x10)
	float _caretBlinkSeconds; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)

	void OnCaretSettles(); // Function ConZ.BankATMPinSlot.OnCaretSettles // (Final|Native|Private) // @ game+0x23590b0
	void OnCaretCoversNumber(); // Function ConZ.BankATMPinSlot.OnCaretCoversNumber // (Final|Native|Private) // @ game+0x2359090
};

// Class ConZ.BankATMPointingButton
// Size: 0x528 (Inherited: 0x268)
struct UBankATMPointingButton : UUserWidget {
	char pad_268[0x28]; // 0x268(0x28)
	struct FText _titleText; // 0x290(0x18)
	bool _isPointingRight; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct UImage* _backgroundImage; // 0x2b0(0x08)
	struct UTextBlock* _titleLabel; // 0x2b8(0x08)
	char pad_2C0[0x8]; // 0x2c0(0x08)
	struct FBankATMPointingButtonStateVisual _normalVisuals; // 0x2c8(0x98)
	struct FBankATMPointingButtonStateVisual _hoveredVisuals; // 0x360(0x98)
	struct FBankATMPointingButtonStateVisual _pressedVisuals; // 0x3f8(0x98)
	struct FBankATMPointingButtonStateVisual _disabledVisuals; // 0x490(0x98)
};

// Class ConZ.BankATMUIController
// Size: 0x120 (Inherited: 0x28)
struct UBankATMUIController : UObject {
	char pad_28[0xf8]; // 0x28(0xf8)
};

// Class ConZ.BankATMVirtualEditbox
// Size: 0x2e8 (Inherited: 0x268)
struct UBankATMVirtualEditbox : UUserWidget {
	char pad_268[0x18]; // 0x268(0x18)
	struct FText _hintText; // 0x280(0x18)
	struct UImage* _outline; // 0x298(0x08)
	struct UTextBlock* _hintLabel; // 0x2a0(0x08)
	struct UTextBlock* _editboxLabel; // 0x2a8(0x08)
	char pad_2B0[0x4]; // 0x2b0(0x04)
	struct FBankATMVirtualEditboxStateVisual _inactiveVisuals; // 0x2b4(0x10)
	struct FBankATMVirtualEditboxStateVisual _activeVisuals; // 0x2c4(0x10)
	struct FBankATMVirtualEditboxStateVisual _disabledVisuals; // 0x2d4(0x10)
	char pad_2E4[0x4]; // 0x2e4(0x04)
};

// Class ConZ.BankATMWelcomeScreen
// Size: 0x2c0 (Inherited: 0x268)
struct UBankATMWelcomeScreen : UUserWidget {
	char pad_268[0x20]; // 0x268(0x20)
	struct UButton* _btnCardsPrevious; // 0x288(0x08)
	struct UButton* _btnCardsNext; // 0x290(0x08)
	struct UPanelWidget* _cardCarousel; // 0x298(0x08)
	struct UBankATMMyCardsButton* _btnMyCards; // 0x2a0(0x08)
	char pad_2A8[0x18]; // 0x2a8(0x18)

	void HandleOnCardsPreviousClicked(); // Function ConZ.BankATMWelcomeScreen.HandleOnCardsPreviousClicked // (Final|Native|Private) // @ game+0x2359030
	void HandleOnCardsNextClicked(); // Function ConZ.BankATMWelcomeScreen.HandleOnCardsNextClicked // (Final|Native|Private) // @ game+0x2359010
};

// Class ConZ.BankATMYesNoConfirmationScreen
// Size: 0x2a0 (Inherited: 0x268)
struct UBankATMYesNoConfirmationScreen : UUserWidget {
	char pad_268[0x20]; // 0x268(0x20)
	struct UTextBlock* _textDialog; // 0x288(0x08)
	struct UBankATMPointingButton* _btnCancel; // 0x290(0x08)
	struct UBankATMPointingButton* _btnYes; // 0x298(0x08)
};

// Class ConZ.BankCardItemComponent
// Size: 0xe0 (Inherited: 0xc8)
struct UBankCardItemComponent : UItemComponent {
	struct FDbIntegerId _ownerUserProfileId; // 0xc8(0x08)
	int64_t _bankAccountNumber; // 0xd0(0x08)
	enum class EBankCardType _bankCardType; // 0xd8(0x01)
	char pad_D9[0x7]; // 0xd9(0x07)
};

// Class ConZ.BankCardOperationRequest
// Size: 0x40 (Inherited: 0x28)
struct UBankCardOperationRequest : UPlayerRpcChannelServerRequest {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class ConZ.BankCardOperationResponse
// Size: 0x30 (Inherited: 0x28)
struct UBankCardOperationResponse : UPlayerRpcChannelServerResponse {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class ConZ.BankCardOwnershipRequest
// Size: 0x30 (Inherited: 0x28)
struct UBankCardOwnershipRequest : UPlayerRpcChannelServerRequest {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class ConZ.BankCardOwnershipResponse
// Size: 0x80 (Inherited: 0x28)
struct UBankCardOwnershipResponse : UPlayerRpcChannelServerResponse {
	char pad_28[0x58]; // 0x28(0x58)
};

// Class ConZ.SedentaryNPC
// Size: 0x9a0 (Inherited: 0x830)
struct ASedentaryNPC : AConZCharacter {
	struct USkeletalMeshComponent* _headMesh; // 0x828(0x08)
	struct FVector _originalLocation; // 0x830(0x0c)
	struct ATradeOutpostBuilding* _tradeOutpostBuilding; // 0x840(0x08)
	char pad_84C[0x34]; // 0x84c(0x34)
	struct FVector _animationHeadScale; // 0x880(0x0c)
	char pad_88C[0x4]; // 0x88c(0x04)
	struct UAnimSequenceBase* _faceIdleAnimation; // 0x890(0x08)
	struct FFloatRange _headYawClampValues; // 0x898(0x10)
	struct FFloatRange _headPitchClampValues; // 0x8a8(0x10)
	float _headPitchClampCorrectionValueLower; // 0x8b8(0x04)
	float _headPitchClampCorrectionValueUpper; // 0x8bc(0x04)
	float _headRotationSpeedLerpFactor; // 0x8c0(0x04)
	struct FFloatRange _eyesYawAngleRange; // 0x8c4(0x10)
	struct FFloatRange _eyesPitchAngleRange; // 0x8d4(0x10)
	float _eyesPitchClampCorrectionValueLower; // 0x8e4(0x04)
	float _eyesPitchClampCorrectionValueUpper; // 0x8e8(0x04)
	float _eyesRotationSpeedLerpFactor; // 0x8ec(0x04)
	struct FFloatRange _blinkingPeriodRange; // 0x8f0(0x10)
	float _timeToBlinkInSeconds; // 0x900(0x04)
	char pad_904[0x4]; // 0x904(0x04)
	struct TArray<struct USedentaryNPCBackgroundInteraction*> _backgroundInteractions; // 0x908(0x10)
	struct USedentaryNPCBackgroundInteraction* _activeBackgroundInteraction; // 0x918(0x08)
	float _interactionDistance; // 0x920(0x04)
	float _timeWithoutFocusPawnToClearBackgroundInteractions; // 0x924(0x04)
	char pad_928[0x58]; // 0x928(0x58)
	float _backgroundInteractionCooldownTime; // 0x980(0x04)
	char pad_984[0x1c]; // 0x984(0x1c)

	void OnRep_TradeOutpostBuilding(); // Function ConZ.SedentaryNPC.OnRep_TradeOutpostBuilding // (Final|Native|Private) // @ game+0x24e9000
};

// Class ConZ.Banker
// Size: 0x9c0 (Inherited: 0x9a0)
struct ABanker : ASedentaryNPC {
	float _bankTransactionCooldownTime; // 0x9a0(0x04)
	char pad_9A4[0x4]; // 0x9a4(0x04)
	struct ABankATMMinigame* _bankMinigameClass; // 0x9a8(0x08)
	char pad_9B0[0x10]; // 0x9b0(0x10)
};

// Class ConZ.InteractionAssetData
// Size: 0x30 (Inherited: 0x28)
struct UInteractionAssetData : UAssetUserData {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class ConZ.BankTransactionAssetData
// Size: 0x38 (Inherited: 0x30)
struct UBankTransactionAssetData : UInteractionAssetData {
	struct ABankATMMinigame* BankATMMinigame; // 0x30(0x08)
};

// Class ConZ.BankTransactionRequest
// Size: 0x60 (Inherited: 0x28)
struct UBankTransactionRequest : UPlayerRpcChannelServerRequest {
	char pad_28[0x38]; // 0x28(0x38)
};

// Class ConZ.BankTransactionResponse
// Size: 0x30 (Inherited: 0x28)
struct UBankTransactionResponse : UPlayerRpcChannelServerResponse {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class ConZ.BaseMenu
// Size: 0x268 (Inherited: 0x268)
struct UBaseMenu : UUserWidget {
};

// Class ConZ.BarberShopMenuWidget
// Size: 0x458 (Inherited: 0x268)
struct UBarberShopMenuWidget : UBaseMenu {
	char pad_268[0x8]; // 0x268(0x08)
	struct UOverlay* _overlayMenu; // 0x270(0x08)
	struct UTrashNamedSliderWidget* _sliderHairStyle; // 0x278(0x08)
	struct UCCGameUpgradeConditionDisplayWidget* _hairStyleUpgradeConditionDisplay; // 0x280(0x08)
	struct UVerticalBox* _facialHairVerticalBox; // 0x288(0x08)
	struct UTrashNamedSliderWidget* _sliderMoustacheStyle; // 0x290(0x08)
	struct UCCGameUpgradeConditionDisplayWidget* _moustacheStyleUpgradeConditionDisplay; // 0x298(0x08)
	struct UTrashNamedSliderWidget* _sliderBeardStyle; // 0x2a0(0x08)
	struct UCCGameUpgradeConditionDisplayWidget* _beardStyleUpgradeConditionDisplay; // 0x2a8(0x08)
	struct UPresetColorPicker* _presetColorPickerHairColor; // 0x2b0(0x08)
	struct UCollapsableColorPicker* _dropdownColorPickerEyeshadow; // 0x2b8(0x08)
	struct UCollapsableColorPicker* _dropdownColorPickerEyeliner; // 0x2c0(0x08)
	struct UVerticalBox* _makeupVerticalBox; // 0x2c8(0x08)
	struct UTrashNamedSliderWidget* _sliderEyesMakeupMetalness; // 0x2d0(0x08)
	struct UTrashNamedSliderWidget* _sliderEyesMakeupIntensity; // 0x2d8(0x08)
	struct UCollapsableColorPicker* _dropdownColorPickerLipstickColor; // 0x2e0(0x08)
	struct UTrashNamedSliderWidget* _sliderLipstickGlossiness; // 0x2e8(0x08)
	struct UTrashNamedSliderWidget* _sliderLipstickIntensity; // 0x2f0(0x08)
	struct UConZStandardButton* _buttonRandomize; // 0x2f8(0x08)
	struct UConZStandardButton* _buttonApply; // 0x300(0x08)
	struct UOverlay* _overlayConfirmation; // 0x308(0x08)
	struct UConZStandardButton* _buttonCancelConfirmation; // 0x310(0x08)
	struct UConZStandardButton* _buttonContinueConfirmation; // 0x318(0x08)
	struct UScrollBox* _faceOptionsScrollbox; // 0x320(0x08)
	char pad_328[0x130]; // 0x328(0x130)

	void OnRandomizeClicked(); // Function ConZ.BarberShopMenuWidget.OnRandomizeClicked // (Final|Native|Private) // @ game+0x235d0a0
	void OnContinueClickedInConfirmationPanel(); // Function ConZ.BarberShopMenuWidget.OnContinueClickedInConfirmationPanel // (Final|Native|Private) // @ game+0x235cbb0
	void OnCancelClickedInConfirmationPanel(); // Function ConZ.BarberShopMenuWidget.OnCancelClickedInConfirmationPanel // (Final|Native|Private) // @ game+0x235cb90
	void OnApplyClicked(); // Function ConZ.BarberShopMenuWidget.OnApplyClicked // (Final|Native|Private) // @ game+0x235cb70
};

// Class ConZ.BaseBuildingBaseEntitySetup
// Size: 0x80 (Inherited: 0x80)
struct UBaseBuildingBaseEntitySetup : UEntitySetup {
};

// Class ConZ.BaseBuildingComponent
// Size: 0x750 (Inherited: 0x500)
struct UBaseBuildingComponent : UStaticMeshComponent {
	struct FString _name; // 0x4f8(0x10)
	enum class EBaseElementType _baseElementType; // 0x508(0x04)
	bool _forbidPlacementOfOtherElements; // 0x50c(0x01)
	bool _useBoxOverlapTypeWhitelist; // 0x50d(0x01)
	int32_t _boxOverlapTypeWhitelist; // 0x510(0x04)
	bool _isClimbable; // 0x514(0x01)
	bool _isBlockingItemPlacement; // 0x515(0x01)
	struct TArray<struct UStaticMesh*> _staticMeshVariations; // 0x518(0x10)
	struct UChoppingRecipeDataAsset* _choppingRecipeAsset; // 0x528(0x08)
	float _healthPoints; // 0x530(0x04)
	bool _canBeDamaged; // 0x534(0x01)
	float _hoursToDecay; // 0x538(0x04)
	float _hoursToDecayOutsideFlagArea; // 0x53c(0x04)
	int32_t _startDecayingIfFlagAreaHasMoreThan; // 0x540(0x04)
	bool _isUsedForRespawn; // 0x544(0x01)
	char pad_546[0x2]; // 0x546(0x02)
	float _explosionResistance; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct UCurveFloat* _collisionDamageModifierFromEnergy; // 0x550(0x08)
	struct UStaticMesh* _weatherMaskMesh; // 0x558(0x08)
	bool _canBePlacedWithoutFlag; // 0x560(0x01)
	bool _canBePlacedInBuilding; // 0x561(0x01)
	bool _canBePlacedInRestrictedArea; // 0x562(0x01)
	bool _canBePlacedInAbandonedBunker; // 0x563(0x01)
	bool _canBePainted; // 0x564(0x01)
	char pad_565[0x3]; // 0x565(0x03)
	int32_t _maxInstancesPerFlagArea; // 0x568(0x04)
	struct FGameplayTag _maxInstancesServerSettingTag; // 0x56c(0x08)
	bool _shouldUseParentClassForMaxInstances; // 0x574(0x01)
	char pad_575[0x3]; // 0x575(0x03)
	struct UPlaceableCraftingRecipe* _upgradeRecipe; // 0x578(0x08)
	bool _cascadeDestroySnappedElementsOnUpgrade; // 0x580(0x01)
	bool _checkOverlapsBelowOnUpgrade; // 0x581(0x01)
	bool _ignoreDisabledBaseBuildingFlag; // 0x582(0x01)
	bool _isTileable; // 0x583(0x01)
	bool _mustBePlacedOnFoundation; // 0x584(0x01)
	bool _canEverBePlacedOnFoundation; // 0x585(0x01)
	bool _canBePlacedOnOtherBaseElements; // 0x586(0x01)
	bool _canBePlacedWithoutSnapping; // 0x587(0x01)
	bool _shouldIgnoreSelfWhilePlacing; // 0x588(0x01)
	bool _canBeGroundedOnOtherElements; // 0x589(0x01)
	char _maxHeightLevel; // 0x58a(0x01)
	char pad_58B[0x1]; // 0x58b(0x01)
	float _maxHeightDifference; // 0x58c(0x04)
	bool _addRandomRotation; // 0x590(0x01)
	bool _mustGroundAllPoints; // 0x591(0x01)
	bool _mustBePlacedUpright; // 0x592(0x01)
	enum class EConZPlacementHeightType _placementHeightType; // 0x593(0x01)
	bool _useSimpleCollisionForOverlaps; // 0x594(0x01)
	bool _markedForBoundsBoundsCheck; // 0x595(0x01)
	char pad_596[0x2]; // 0x596(0x02)
	struct FRotator _maxRotationWhilePlacing; // 0x598(0x0c)
	bool _useEncapsulationTestWhenSnapping; // 0x5a4(0x01)
	char pad_5A5[0x3]; // 0x5a5(0x03)
	struct TArray<struct FElementSnapMarker> _elementSnapMarkers; // 0x5a8(0x10)
	struct TArray<struct FBaseBuildingSizeVariation> _sizeVariations; // 0x5b8(0x10)
	char pad_5C8[0x4]; // 0x5c8(0x04)
	float _sizeVariationsSpacing; // 0x5cc(0x04)
	float _repairTime; // 0x5d0(0x04)
	char pad_5D4[0x4]; // 0x5d4(0x04)
	struct FRepairableParams _repairableParams; // 0x5d8(0x38)
	float _experienceAwardForBuilding; // 0x610(0x04)
	char pad_614[0x4]; // 0x614(0x04)
	struct TArray<struct UParticleSystem*> _destructionParticles; // 0x618(0x10)
	struct TArray<struct FTransform> _destructionParticlesSpawnTransforms; // 0x628(0x10)
	struct UAkAudioEvent* _destructionSound; // 0x638(0x08)
	bool _isDoor; // 0x640(0x01)
	char pad_641[0x7]; // 0x641(0x07)
	struct ADoor* _doorClass; // 0x648(0x08)
	bool _hasLadder; // 0x650(0x01)
	char pad_651[0x7]; // 0x651(0x07)
	struct TArray<struct FLadderMarker> _ladderMarkers; // 0x658(0x10)
	bool _hasWindows; // 0x668(0x01)
	char pad_669[0x7]; // 0x669(0x07)
	struct TArray<struct FWindowMarker> _windowMarkers; // 0x670(0x10)
	struct TArray<struct FBaseElementDamageZone> _damageZones; // 0x680(0x10)
	bool _shouldDestroyElementsOnTopWhenDestroyed; // 0x690(0x01)
	bool _disableBeingDestroyedByOtherElement; // 0x691(0x01)
	char pad_692[0x2]; // 0x692(0x02)
	float _destructionTime; // 0x694(0x04)
	bool _shouldRemoveIntersectingElementsOnDestroy; // 0x698(0x01)
	char pad_699[0x7]; // 0x699(0x07)
	struct TArray<struct FBaseElementDestructionZone> _destructionZones; // 0x6a0(0x10)
	bool _useAsReplenishableResource; // 0x6b0(0x01)
	char pad_6B1[0x7]; // 0x6b1(0x07)
	struct FReplenishableResourceDescription _replenishableResourceDescription; // 0x6b8(0x88)
	bool _shouldCheckBaseBuildingElementsInFirstBoxOverlap; // 0x740(0x01)
	bool _shouldLogStateChanges; // 0x741(0x01)
	char pad_742[0x2]; // 0x742(0x02)
	struct FName _collisionChannelName; // 0x744(0x08)
	char pad_74C[0x4]; // 0x74c(0x04)
};

// Class ConZ.BaseBuildingItemComponent
// Size: 0x760 (Inherited: 0x750)
struct UBaseBuildingItemComponent : UBaseBuildingComponent {
	struct AItem* _itemClass; // 0x750(0x08)
	bool _shouldDestroyAssociatedItemWhenMovedOutOfFlag; // 0x758(0x01)
	bool _shouldDestroyElementWhenMovedOutOfFlag; // 0x759(0x01)
	char pad_75A[0x6]; // 0x75a(0x06)
};

// Class ConZ.ModularBaseBuildingComponent
// Size: 0x7b0 (Inherited: 0x750)
struct UModularBaseBuildingComponent : UBaseBuildingComponent {
	struct TArray<struct FRotator> _availableOrientations; // 0x750(0x10)
	float MinStabilityForPlacement; // 0x760(0x04)
	char pad_764[0x4]; // 0x764(0x04)
	struct TArray<struct FElementQueryMarker> _elementStabilityMarkers; // 0x768(0x10)
	struct TArray<struct FModularElementSnapMarker> _modularElementSnapMarkers; // 0x778(0x10)
	struct TArray<struct FElementMorphQuery> _elementMorphQueries; // 0x788(0x10)
	struct TArray<struct FVector> _floatingCheckLocations; // 0x798(0x10)
	bool _adjustSnappingLocation; // 0x7a8(0x01)
	bool _canBePlacedOverOtherModularElement; // 0x7a9(0x01)
	char pad_7AA[0x6]; // 0x7aa(0x06)

	struct TArray<struct FName> GetModularMarkerNameOptions(); // Function ConZ.ModularBaseBuildingComponent.GetModularMarkerNameOptions // (Final|Native|Protected|Const) // @ game+0x235c630
};

// Class ConZ.BaseBuildingDetailsPanel
// Size: 0x360 (Inherited: 0x268)
struct UBaseBuildingDetailsPanel : UUserWidget {
	char pad_268[0x8]; // 0x268(0x08)
	struct UBigItemCraftingButton* _bigItemCraftingButton; // 0x270(0x08)
	struct UTextBlock* _descriptionTextBlock; // 0x278(0x08)
	struct UCheckBox* _expandIngredientsCheckBox; // 0x280(0x08)
	struct UWrapBox* _recipeIngredientButtonsWrapBox; // 0x288(0x08)
	struct UOverlay* _possibleIngredientsOverlay; // 0x290(0x08)
	struct UWrapBox* _possibleRecipeIngredientButtonsWrapBox; // 0x298(0x08)
	struct URecipeIngredientButton* _recipeIngredientButtonClass; // 0x2a0(0x08)
	struct URecipeIngredientButton* _possibleRecipeIngredientButtonClass; // 0x2a8(0x08)
	char pad_2B0[0xb0]; // 0x2b0(0xb0)

	void OnDropdownStateChanged(bool isCollapsed); // Function ConZ.BaseBuildingDetailsPanel.OnDropdownStateChanged // (Final|Native|Private) // @ game+0x235cff0
};

// Class ConZ.BaseBuildingPanel
// Size: 0x398 (Inherited: 0x268)
struct UBaseBuildingPanel : UUserWidget {
	char pad_268[0x8]; // 0x268(0x08)
	struct UCraftingCategoriesTabButtonsContainer* _craftingCategoriesTabButtonsContainer; // 0x270(0x08)
	struct USearchBox* _searchBox; // 0x278(0x08)
	struct UWidgetSwitcher* _categoriesDetailsSwitcher; // 0x280(0x08)
	struct UTextBlock* _selectedCategoryTitle; // 0x288(0x08)
	struct UScrollBox* _categoriesScrollBox; // 0x290(0x08)
	struct UBaseBuildingDetailsPanel* _baseBuildingDetailsPanel; // 0x298(0x08)
	struct UPrimaryButton* _detailsAndBackButton; // 0x2a0(0x08)
	struct FText _detailsTooltipText; // 0x2a8(0x18)
	struct FText _backTooltipText; // 0x2c0(0x18)
	struct UPrimaryButton* _placeButton; // 0x2d8(0x08)
	struct FText _placeTooltipText; // 0x2e0(0x18)
	struct UPlacedPlaceableWidget* _placedPlaceablesContainer; // 0x2f8(0x08)
	struct UConZCustomInteractionButton* _collapseAllButton; // 0x300(0x08)
	struct UConZCustomInteractionButton* _expandAllButton; // 0x308(0x08)
	struct UCraftingRecipeButtonsContainer* _craftingRecipeButtonsContainerClass; // 0x310(0x08)
	struct FMargin _categoriesPadding; // 0x318(0x10)
	struct UTextOnlyTooltip* _tooltipClass; // 0x328(0x08)
	char pad_330[0x68]; // 0x330(0x68)

	void OnPlaceButtonClicked(); // Function ConZ.BaseBuildingPanel.OnPlaceButtonClicked // (Final|Native|Private) // @ game+0x235d080
	void OnDetailsAndBackButtonClicked(); // Function ConZ.BaseBuildingPanel.OnDetailsAndBackButtonClicked // (Final|Native|Private) // @ game+0x235cbd0
	void OnAnyButtonHovered(); // Function ConZ.BaseBuildingPanel.OnAnyButtonHovered // (Final|Native|Private) // @ game+0x235cb50
	void HandleOnExpandAllClicked(); // Function ConZ.BaseBuildingPanel.HandleOnExpandAllClicked // (Final|Native|Private) // @ game+0x235ca90
	void HandleOnCollapseAllClicked(); // Function ConZ.BaseBuildingPanel.HandleOnCollapseAllClicked // (Final|Native|Private) // @ game+0x235ca70
};

// Class ConZ.BaseBuildingStatics
// Size: 0x28 (Inherited: 0x28)
struct UBaseBuildingStatics : UBlueprintFunctionLibrary {
};

// Class ConZ.UIContext
// Size: 0x28 (Inherited: 0x28)
struct UUIContext : UObject {
};

// Class ConZ.BaseBuildingUIContext
// Size: 0x28 (Inherited: 0x28)
struct UBaseBuildingUIContext : UUIContext {
};

// Class ConZ.CraftingUIControllerBase
// Size: 0x390 (Inherited: 0x28)
struct UCraftingUIControllerBase : UObject {
	char pad_28[0x90]; // 0x28(0x90)
	struct FCraftingRecipeAndIngredientButtonVisualData _craftingRecipeAndIngredientButtonVisualData; // 0xb8(0x278)
	char pad_330[0x58]; // 0x330(0x58)
	struct UCraftingUIData* _dataAsset; // 0x388(0x08)
};

// Class ConZ.BaseBuildingUIController
// Size: 0x3c0 (Inherited: 0x390)
struct UBaseBuildingUIController : UCraftingUIControllerBase {
	char pad_390[0x30]; // 0x390(0x30)
};

// Class ConZ.BaseInteractionComponent
// Size: 0x220 (Inherited: 0x200)
struct UBaseInteractionComponent : USceneComponent {
	char pad_200[0x8]; // 0x200(0x08)
	float _capsuleRadius; // 0x208(0x04)
	float _capsuleHalfHeight; // 0x20c(0x04)
	char pad_210[0x10]; // 0x210(0x10)
};

// Class ConZ.BaseItemContainerWidget
// Size: 0x2a0 (Inherited: 0x268)
struct UBaseItemContainerWidget : UUserWidget {
	struct FMulticastInlineDelegate ObjectAddedToContainer; // 0x268(0x10)
	char pad_278[0x4]; // 0x278(0x04)
	int32_t Columns; // 0x27c(0x04)
	int32_t Rows; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
	struct UGridPanel* GridPanel; // 0x288(0x08)
	struct UUserWidget* HighlightBorder; // 0x290(0x08)
	char pad_298[0x8]; // 0x298(0x08)

	void RefreshSize(); // Function ConZ.BaseItemContainerWidget.RefreshSize // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void OnObjectAddedToContainerEvent__DelegateSignature(struct UObject* Object); // DelegateFunction ConZ.BaseItemContainerWidget.OnObjectAddedToContainerEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x297fc00
	void OnDropEvent(struct UInventorySlotUserWidget* inventorySlot, struct UBaseItemWidget* Item); // Function ConZ.BaseItemContainerWidget.OnDropEvent // (Native|Public|BlueprintCallable) // @ game+0x235cf20
	void OnDragStartEvent(struct UBaseItemWidget* Widget, struct FGeometry& Geometry); // Function ConZ.BaseItemContainerWidget.OnDragStartEvent // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x235ce20
	void OnDragLeaveEvent(struct UInventorySlotUserWidget* inventorySlot, struct UBaseItemWidget* Widget); // Function ConZ.BaseItemContainerWidget.OnDragLeaveEvent // (Native|Public|BlueprintCallable) // @ game+0x235cd50
	void OnDragEnterEvent(struct UInventorySlotUserWidget* inventorySlot, struct UBaseItemWidget* Widget); // Function ConZ.BaseItemContainerWidget.OnDragEnterEvent // (Native|Public|BlueprintCallable) // @ game+0x235cc80
	void OnDragCancelledEvent(struct UBaseItemWidget* Widget); // Function ConZ.BaseItemContainerWidget.OnDragCancelledEvent // (Native|Public|BlueprintCallable) // @ game+0x235cbf0
	void InitGrid(struct FMargin& gridPadding); // Function ConZ.BaseItemContainerWidget.InitGrid // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x235cab0
	bool GetSlotsForPanel(struct UGridSlot* GridSlot, int32_t Width, int32_t Height, struct TArray<struct UInventorySlotUserWidget*>& Slots, struct UGridPanel* panel, int32_t numColumns, int32_t numRows); // Function ConZ.BaseItemContainerWidget.GetSlotsForPanel // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x235c830
	bool GetSlots(struct UGridSlot* GridSlot, int32_t Width, int32_t Height, struct TArray<struct UInventorySlotUserWidget*>& Slots); // Function ConZ.BaseItemContainerWidget.GetSlots // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x235c6b0
	struct TArray<struct UItemUserWidget*> GetItemWidgets(); // Function ConZ.BaseItemContainerWidget.GetItemWidgets // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x235c5b0
};

// Class ConZ.BaseItemWidget
// Size: 0x288 (Inherited: 0x268)
struct UBaseItemWidget : UUserWidget {
	struct UBaseItemContainerWidget* ParentInventory; // 0x268(0x08)
	char pad_270[0x8]; // 0x270(0x08)
	int32_t Width; // 0x278(0x04)
	int32_t Height; // 0x27c(0x04)
	struct UImage* _imageWidget; // 0x280(0x08)

	void SetStacksCount(int32_t Count); // Function ConZ.BaseItemWidget.SetStacksCount // (Event|Public|BlueprintEvent) // @ game+0x297fc00
	int32_t GetStacksCount(); // Function ConZ.BaseItemWidget.GetStacksCount // (Event|Public|BlueprintEvent) // @ game+0x297fc00
	void GetDragImage(struct FGeometry Geometry, struct UInventorySlotUserWidget* widgetImage); // Function ConZ.BaseItemWidget.GetDragImage // (Final|Native|Protected|BlueprintCallable) // @ game+0x235c480
	void DragCancelled(); // Function ConZ.BaseItemWidget.DragCancelled // (Final|Native|Public|BlueprintCallable) // @ game+0x235c460
};

// Class ConZ.BaseMountPathBlocker
// Size: 0x30 (Inherited: 0x28)
struct UBaseMountPathBlocker : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class ConZ.BasicGameResourceContainerComponent
// Size: 0x1f0 (Inherited: 0xc8)
struct UBasicGameResourceContainerComponent : UItemComponent {
	char pad_C8[0x20]; // 0xc8(0x20)
	struct UGameResourceType* _repResourceType; // 0xe8(0x08)
	float _repResourceAmount; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct FGameplayTagContainer _resourceFillingInSocketTypes; // 0xf8(0x20)
	struct FGameplayTagContainer _resourceFillingOutSocketTypes; // 0x118(0x20)
	struct TArray<struct UBaseItemTag*> _requiredItemTagsForFilling; // 0x138(0x10)
	bool _shouldUpdateOwningItemUses; // 0x148(0x01)
	bool _amountDependsOnItemWeight; // 0x149(0x01)
	bool _canDrink; // 0x14a(0x01)
	bool _canSpill; // 0x14b(0x01)
	bool _canCheck; // 0x14c(0x01)
	bool _canFill; // 0x14d(0x01)
	bool _showResourcePercentageOnCheck; // 0x14e(0x01)
	bool _shouldUncraftWhenEmpty; // 0x14f(0x01)
	bool _shouldSpillWhenPickedUp; // 0x150(0x01)
	bool _shouldSpillWhenAddedToContainer; // 0x151(0x01)
	bool _shouldTakeInHandsWhenDrinking; // 0x152(0x01)
	char pad_153[0x5]; // 0x153(0x05)
	struct FText _interactionText; // 0x158(0x18)
	struct UAnimMontage* _resourceFillingMontage; // 0x170(0x08)
	struct UAkAudioEvent* _resourceStartFillingAudioEvent; // 0x178(0x08)
	struct UAkAudioEvent* _resourceStopFillingAudioEvent; // 0x180(0x08)
	float _resourceFillingDurationPerAmountFilled; // 0x188(0x04)
	float _resourceFillingExperiencePerAmount; // 0x18c(0x04)
	enum class EPrisonerGroundStance _targetStanceWhenFilling; // 0x190(0x01)
	bool _shouldTakeInHandsWhenFilling; // 0x191(0x01)
	char pad_192[0x6]; // 0x192(0x06)
	struct UAkAudioEvent* _spillStartAudioEvent; // 0x198(0x08)
	struct UAkAudioEvent* _spillStopAudioEvent; // 0x1a0(0x08)
	struct UAnimMontage* _spillMontage; // 0x1a8(0x08)
	struct UAnimMontage* _spillMontageEnd; // 0x1b0(0x08)
	struct UParticleSystem* _particles; // 0x1b8(0x08)
	float _minSpillTime; // 0x1c0(0x04)
	float _maxSpillTime; // 0x1c4(0x04)
	float _spillTimePerKg; // 0x1c8(0x04)
	char pad_1CC[0x4]; // 0x1cc(0x04)
	struct UAkAudioEvent* _drinkStartAudioEvent; // 0x1d0(0x08)
	struct UAkAudioEvent* _drinkStopAudioEvent; // 0x1d8(0x08)
	float _EMInterferenceDisabledTime; // 0x1e0(0x04)
	char pad_1E4[0xc]; // 0x1e4(0x0c)

	void OnRep_ResourceType(); // Function ConZ.BasicGameResourceContainerComponent.OnRep_ResourceType // (Final|Native|Private) // @ game+0x2361430
	void OnRep_ResourceAmount(); // Function ConZ.BasicGameResourceContainerComponent.OnRep_ResourceAmount // (Final|Native|Private) // @ game+0x2361430
};

// Class ConZ.BasicGameResourceSlotItemComponent
// Size: 0x120 (Inherited: 0xc8)
struct UBasicGameResourceSlotItemComponent : UItemComponent {
	char pad_C8[0x38]; // 0xc8(0x38)
	float _EMInterferenceDisabledTime; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	bool _disableInteractions; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct AItem* _repResourceClass; // 0x110(0x08)
	float _repResourceAmountRatio; // 0x118(0x04)
	float _repResourceUsageRateNormalized; // 0x11c(0x04)

	void OnRep_RepResourceAmountRatio(); // Function ConZ.BasicGameResourceSlotItemComponent.OnRep_RepResourceAmountRatio // (Final|Native|Private) // @ game+0x2361410
};

// Class ConZ.EntityComponentSetup
// Size: 0x48 (Inherited: 0x40)
struct UEntityComponentSetup : UEntitySystemObjectSetup {
	float BoundsRadius; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class ConZ.BasicItemDecayEntityComponentSetup
// Size: 0x50 (Inherited: 0x48)
struct UBasicItemDecayEntityComponentSetup : UEntityComponentSetup {
	float LifeTime; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class ConZ.BasicLadder
// Size: 0x248 (Inherited: 0x220)
struct ABasicLadder : AActor {
	struct UStaticMeshComponent* _mesh; // 0x220(0x08)
	struct TArray<struct FLadderMarker> _ladderMarkers; // 0x228(0x10)
	char pad_238[0x10]; // 0x238(0x10)
};

// Class ConZ.ConZNotification
// Size: 0x30 (Inherited: 0x28)
struct UConZNotification : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class ConZ.BasicNotification
// Size: 0x30 (Inherited: 0x30)
struct UBasicNotification : UConZNotification {
};

// Class ConZ.NotificationDescription
// Size: 0x40 (Inherited: 0x28)
struct UNotificationDescription : UObject {
	enum class ENotificationTarget Target; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct FDbIntegerId TargetUserProfileId; // 0x30(0x08)
	bool ShouldSendIfClientOffline; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ConZ.BasicNotificationDescription
// Size: 0x78 (Inherited: 0x40)
struct UBasicNotificationDescription : UNotificationDescription {
	struct FText Message; // 0x40(0x18)
	int32_t FontSize; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct UTexture2D* Icon; // 0x60(0x08)
	int32_t IconSize; // 0x68(0x04)
	float Duration; // 0x6c(0x04)
	bool Ping; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class ConZ.BasicTextWidget
// Size: 0x270 (Inherited: 0x268)
struct UBasicTextWidget : UUserWidget {
	int32_t MaxTextRows; // 0x268(0x04)
	int32_t MaxCharactersPerTextRow; // 0x26c(0x04)

	void SetCurrentText(struct FText& Text); // Function ConZ.BasicTextWidget.SetCurrentText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x297fc00
};

// Class ConZ.FueledHeatSource
// Size: 0x220 (Inherited: 0x28)
struct UFueledHeatSource : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FHeatSourceParameters _heatSourceParams; // 0x30(0x24)
	char pad_54[0x4]; // 0x54(0x04)
	struct UStaticMeshComponent* _interactionHitComponent; // 0x58(0x08)
	char pad_60[0x8]; // 0x60(0x08)
	struct UParticleSystemComponent* _fireParticlesComponent; // 0x68(0x08)
	struct UNiagaraComponent* _niagaraFireParticlesComponent; // 0x70(0x08)
	struct TArray<struct FParameterInt32> _particleParametersInt32; // 0x78(0x10)
	struct TArray<struct FParameterFloat> _particleParametersFloat; // 0x88(0x10)
	struct TArray<struct FParameterVector> _particleParametersVector; // 0x98(0x10)
	struct TArray<struct FParameterVector4> _particleParametersVector4; // 0xa8(0x10)
	struct UPointLightComponent* _fireLightComponent; // 0xb8(0x08)
	float _maxFireLightIntensity; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct UAkAudioEvent* _startBurningAudioEvent; // 0xc8(0x08)
	struct UAkAudioEvent* _stopBurningAudioEvent; // 0xd0(0x08)
	struct UAkComponent* _fireAudioComponent; // 0xd8(0x08)
	struct FTransform _fireTransform; // 0xe0(0x30)
	char pad_110[0x8]; // 0x110(0x08)
	struct UStaticMeshComponent* _meshComponent; // 0x118(0x08)
	struct TArray<struct UStaticMesh*> _swapMeshes; // 0x120(0x10)
	int32_t _materialSwitchIndex; // 0x130(0x04)
	char pad_134[0x4]; // 0x134(0x04)
	struct UMaterialInterface* _litMaterial; // 0x138(0x08)
	struct UMaterialInterface* _unlitMaterial; // 0x140(0x08)
	char pad_148[0x8]; // 0x148(0x08)
	struct FTransform _meshTransform; // 0x150(0x30)
	char pad_180[0x4]; // 0x180(0x04)
	float _fireDamageProcessingPeriod; // 0x184(0x04)
	char pad_188[0x4]; // 0x188(0x04)
	float _fireBaseDamageToItemsPerSecond; // 0x18c(0x04)
	uint16_t _repTemperature; // 0x190(0x02)
	char pad_192[0x6]; // 0x192(0x06)
	char _isAvailableForCooking; // 0x198(0x01)
	bool _yieldStateControlToDisableableComponent; // 0x199(0x01)
	char pad_19A[0xa]; // 0x19a(0x0a)
	float _temperatureReplicationInterval; // 0x1a4(0x04)
	char pad_1A8[0x4]; // 0x1a8(0x04)
	float _temperatureReplicationRadius; // 0x1ac(0x04)
	char pad_1B0[0x70]; // 0x1b0(0x70)

	void OnRep_Temperature(); // Function ConZ.FueledHeatSource.OnRep_Temperature // (Final|Native|Private) // @ game+0x23e7cf0
};

// Class ConZ.BatchFuelHeatSource
// Size: 0x260 (Inherited: 0x220)
struct UBatchFuelHeatSource : UFueledHeatSource {
	float _fuelMassCapacity; // 0x220(0x04)
	struct FCombustibleItemParams _initialFuelCombustionParams; // 0x224(0x08)
	float _initialFuelMass; // 0x22c(0x04)
	float _temperatureMultiplierRain; // 0x230(0x04)
	enum class EBlowAirAnimHeight _heightForBlowAirAnimation; // 0x234(0x01)
	char pad_235[0x3]; // 0x235(0x03)
	float _distanceForBlowAirAnimation; // 0x238(0x04)
	bool _isBurning; // 0x23c(0x01)
	char pad_23D[0x3]; // 0x23d(0x03)
	int32_t _burningStage; // 0x240(0x04)
	float _repFuelMass; // 0x244(0x04)
	char pad_248[0x18]; // 0x248(0x18)

	void OnRep_IsBurning(); // Function ConZ.BatchFuelHeatSource.OnRep_IsBurning // (Final|Native|Private) // @ game+0x23613d0
	void OnRep_BurningStage(); // Function ConZ.BatchFuelHeatSource.OnRep_BurningStage // (Final|Native|Private) // @ game+0x2361390
};

// Class ConZ.EquipmentItem
// Size: 0x9c0 (Inherited: 0x9b0)
struct AEquipmentItem : AItem {
	uint32_t MinRange; // 0x9a8(0x04)
	uint32_t MaxRange; // 0x9ac(0x04)
	uint32_t MinDamage; // 0x9b0(0x04)
	uint32_t MaxDamage; // 0x9b4(0x04)
	uint32_t AP; // 0x9b8(0x04)
};

// Class ConZ.BatteryChargerItem
// Size: 0x9e0 (Inherited: 0x9c0)
struct ABatteryChargerItem : AEquipmentItem {
	struct UInventoryContainer2D* _inventoryContainer2D; // 0x9c0(0x08)
	struct URangedResourceConsumerComponentMultipleProviders* _rangedResourceConsumerComponent; // 0x9c8(0x08)
	uint32_t _capacityX; // 0x9d0(0x04)
	uint32_t _capacityY; // 0x9d4(0x04)
	float _chargingRate; // 0x9d8(0x04)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	void OnRangedResourceConsumerComponentDeactivated(struct UActorComponent* Component); // Function ConZ.BatteryChargerItem.OnRangedResourceConsumerComponentDeactivated // (Final|Native|Private) // @ game+0x2361300
};

// Class ConZ.GameResourceContainerEntityComponentSave
// Size: 0x40 (Inherited: 0x28)
struct UGameResourceContainerEntityComponentSave : UObject {
	struct UGameResourceType* ResourceType; // 0x28(0x08)
	float ResourceAmount; // 0x30(0x04)
	float MaxResourceAmount; // 0x34(0x04)
	float ResourceUsageRate; // 0x38(0x04)
	bool ResourceUsageEnabled; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// Class ConZ.BatteryEntityComponentSave
// Size: 0x40 (Inherited: 0x40)
struct UBatteryEntityComponentSave : UGameResourceContainerEntityComponentSave {
};

// Class ConZ.GameResourceContainerEntityComponentSetup
// Size: 0x70 (Inherited: 0x48)
struct UGameResourceContainerEntityComponentSetup : UEntityComponentSetup {
	struct UGameResourceType* AcceptedResourceType; // 0x48(0x08)
	struct UGameResourceType* DefaultResourceType; // 0x50(0x08)
	float MaxResourceAmount; // 0x58(0x04)
	float ResourceAmount; // 0x5c(0x04)
	float ResourceUsageRate; // 0x60(0x04)
	float MinTickInterval; // 0x64(0x04)
	float MinResourceAmountRatioChangeToTick; // 0x68(0x04)
	bool ShouldRemoveResourceTypeWhenEmptied; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
};

// Class ConZ.BatteryEntityComponentSetup
// Size: 0x80 (Inherited: 0x70)
struct UBatteryEntityComponentSetup : UGameResourceContainerEntityComponentSetup {
	float Voltage; // 0x70(0x04)
	float BaseDrainRate; // 0x74(0x04)
	bool IsRechargeable; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class ConZ.BatteryItemComponent
// Size: 0x1f8 (Inherited: 0x1f0)
struct UBatteryItemComponent : UBasicGameResourceContainerComponent {
	float _repResourceUsageRate; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)

	void OnRep_ResourceUsageRate(); // Function ConZ.BatteryItemComponent.OnRep_ResourceUsageRate // (Final|Native|Private) // @ game+0x2361450
};

// Class ConZ.BCULockable
// Size: 0x28 (Inherited: 0x28)
struct UBCULockable : UInterface {
};

// Class ConZ.BCULockItem
// Size: 0x9c0 (Inherited: 0x9b0)
struct ABCULockItem : AItem {
	struct UBasicGameResourceSlotItemComponent* _batterySlot; // 0x9b0(0x08)
	struct FDbIntegerId _connectedServerUserProfileId; // 0x9b8(0x08)

	void OnResourceObjectDeactivated(struct UActorComponent* containerComponent); // Function ConZ.BCULockItem.OnResourceObjectDeactivated // (Final|Native|Private) // @ game+0x2361490
	void OnRep_ConnectionPrisonerId(); // Function ConZ.BCULockItem.OnRep_ConnectionPrisonerId // (Final|Native|Private) // @ game+0x23613b0
};

// Class ConZ.BCULockRegistry
// Size: 0x2a0 (Inherited: 0x220)
struct ABCULockRegistry : AActor {
	char pad_220[0x80]; // 0x220(0x80)

	void UpdateBCULockRegistryOnClientWithUserProfileId(struct FDbIntegerId ServerUserProfileId); // Function ConZ.BCULockRegistry.UpdateBCULockRegistryOnClientWithUserProfileId // (Final|Native|Private|Const) // @ game+0x2361660
};

// Class ConZ.BCUMemoryModuleItem
// Size: 0xa00 (Inherited: 0x9b0)
struct ABCUMemoryModuleItem : AItem {
	float _intelligenceReward; // 0x9a8(0x04)
	struct UAkAudioEvent* _upgradeStartAudio; // 0x9b0(0x08)
	struct UAkAudioEvent* _upgradeStopAudio; // 0x9b8(0x08)
	struct UAkAudioEvent* _upgradeSuccessAudio; // 0x9c0(0x08)
	struct UAkAudioEvent* _upgradeFailureAudio; // 0x9c8(0x08)
	float _upgradeActionDuration; // 0x9d0(0x04)
	struct TSoftClassPtr<UObject> _tradeableServiceClass; // 0x9d8(0x28)
};

// Class ConZ.TraderService
// Size: 0x38 (Inherited: 0x28)
struct UTraderService : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct UTexture2D* _storeIcon; // 0x30(0x08)
};

// Class ConZ.BCUUpgradeService
// Size: 0x38 (Inherited: 0x38)
struct UBCUUpgradeService : UTraderService {
};

// Class ConZ.VirtualizedItemUserData
// Size: 0x28 (Inherited: 0x28)
struct UVirtualizedItemUserData : UObject {
};

// Class ConZ.BedrollVirtualizedItemUserData
// Size: 0x48 (Inherited: 0x28)
struct UBedrollVirtualizedItemUserData : UVirtualizedItemUserData {
	struct FDbIntegerId Occupant; // 0x28(0x08)
	struct FDateTime TimerStart; // 0x30(0x08)
	struct FTimespan TimerDuration; // 0x38(0x08)
	bool ShouldLoad; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class ConZ.Bedroll
// Size: 0xab0 (Inherited: 0xa50)
struct ABedroll : AClothesItem {
	struct FDbIntegerId _occupiedUserProfileId; // 0xa48(0x08)
	bool _occupantOnline; // 0xa50(0x01)
	bool _isRolledUpRep; // 0xa51(0x01)
	struct UStaticMesh* _meshInHands; // 0xa58(0x08)
	struct UMaterialInterface* _materialInHands; // 0xa60(0x08)
	struct UStaticMesh* _meshOnGround; // 0xa68(0x08)
	struct UMaterialInterface* _materialOnGround; // 0xa70(0x08)
	float _maxRestHeight; // 0xa78(0x04)
	float _damageOverTimeWhenOccupied; // 0xa7c(0x04)
	float _autoDestructTimeWhenOccupied; // 0xa80(0x04)
	char pad_A86[0x2a]; // 0xa86(0x2a)

	void VirtualizeTimerCallback(); // Function ConZ.Bedroll.VirtualizeTimerCallback // (Final|Native|Private) // @ game+0x2361790
	void SetOccupantOfflineTimerCallback(); // Function ConZ.Bedroll.SetOccupantOfflineTimerCallback // (Final|Native|Private) // @ game+0x2361640
	void OnUserLogout(struct FDbIntegerId UserId); // Function ConZ.Bedroll.OnUserLogout // (Native|Protected) // @ game+0x23615b0
	void OnUserLogin(struct FDbIntegerId UserId); // Function ConZ.Bedroll.OnUserLogin // (Native|Protected) // @ game+0x2361520
	void OnRep_IsRolledUpRep(); // Function ConZ.Bedroll.OnRep_IsRolledUpRep // (Final|Native|Private) // @ game+0x23613f0
	void OnOccupantRemoved(); // Function ConZ.Bedroll.OnOccupantRemoved // (Native|Protected) // @ game+0x23612e0
	void OnOccupantKilled(struct AConZCharacter* ConZCharacter); // Function ConZ.Bedroll.OnOccupantKilled // (Native|Protected) // @ game+0x2361250
};

// Class ConZ.BedrollItemEntitySave
// Size: 0x30 (Inherited: 0x28)
struct UBedrollItemEntitySave : UObject {
	bool IsRolledUp; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class ConZ.ItemEntitySetup
// Size: 0x90 (Inherited: 0x80)
struct UItemEntitySetup : UEntitySetup {
	float MaxHealth; // 0x80(0x04)
	float MaxHealthRatioAfterReachingBadQuality; // 0x84(0x04)
	bool ShouldCarryStopOnOwnerLeavingGame; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
};

// Class ConZ.BedrollItemEntitySetup
// Size: 0x90 (Inherited: 0x90)
struct UBedrollItemEntitySetup : UItemEntitySetup {
};

// Class ConZ.BigItemCraftingButton
// Size: 0x330 (Inherited: 0x268)
struct UBigItemCraftingButton : UUserWidget {
	char pad_268[0x78]; // 0x268(0x78)
	struct UCheckBox* _favouriteStar; // 0x2e0(0x08)
	struct UOverlay* _quantityDataOverlay; // 0x2e8(0x08)
	struct UImage* _icon; // 0x2f0(0x08)
	struct UTextBlock* _title; // 0x2f8(0x08)
	struct UTextBlock* _quantity; // 0x300(0x08)
	struct UTextBlock* _quantityFadeout; // 0x308(0x08)
	struct UImage* _quantityBackground; // 0x310(0x08)
	struct UImage* _quantityBackgroundFadeout; // 0x318(0x08)
	struct UWidgetAnimation* _changeQuantity; // 0x320(0x08)
	char pad_328[0x8]; // 0x328(0x08)

	void OnFavouritesStateChanged(bool IsChecked); // Function ConZ.BigItemCraftingButton.OnFavouritesStateChanged // (Final|Native|Private) // @ game+0x23611c0
	void OnChangeQuantityAnimationMidway(); // Function ConZ.BigItemCraftingButton.OnChangeQuantityAnimationMidway // (Final|Native|Private) // @ game+0x23611a0
	void OnChangeQuantityAnimationEnded(); // Function ConZ.BigItemCraftingButton.OnChangeQuantityAnimationEnded // (Final|Native|Private) // @ game+0x2361180
};

// Class ConZ.BioChemSkill
// Size: 0xb0 (Inherited: 0xb0)
struct UBioChemSkill : UIntelligenceSkill {
};

// Class ConZ.Biome
// Size: 0x270 (Inherited: 0x220)
struct ABiome : AActor {
	struct USceneComponent* _root; // 0x220(0x08)
	struct UStaticMeshComponent* _visualizationSphere; // 0x228(0x08)
	float _radius; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct FHuntingBiomeParameters _parameters; // 0x238(0x38)
};

// Class ConZ.BiomeData
// Size: 0x90 (Inherited: 0x30)
struct UBiomeData : UDataAsset {
	struct FGameplayTag BiomeTag; // 0x30(0x08)
	struct UMaterialInstance* VisualizationMaterial; // 0x38(0x08)
	struct TMap<struct TSoftClassPtr<UObject>, struct FAnimalSpawnData> AnimalSpawnData; // 0x40(0x50)
};

// Class ConZ.Bird2
// Size: 0xa00 (Inherited: 0x9d0)
struct ABird2 : AAnimal2 {
	bool IsStaringPerched; // 0x9c8(0x01)
	float MinFlightAltitude; // 0x9cc(0x04)
	float MaxFlightAltitude; // 0x9d0(0x04)
	bool _isLanding; // 0x9d4(0x01)
	bool _isTakingOff; // 0x9d5(0x01)
	bool _isPerched; // 0x9d6(0x01)
	bool _isFlying; // 0x9d7(0x01)
	struct TArray<bool> _states; // 0x9d8(0x10)
	char _repStates; // 0x9e8(0x01)
	char pad_9EE[0x12]; // 0x9ee(0x12)

	void OnRep_States(); // Function ConZ.Bird2.OnRep_States // (Native|Protected) // @ game+0x2361470
	bool GetIsTakingOff(); // Function ConZ.Bird2.GetIsTakingOff // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2361150
	bool GetIsStaringPerched(); // Function ConZ.Bird2.GetIsStaringPerched // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2361120
	bool GetIsPerched(); // Function ConZ.Bird2.GetIsPerched // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x23610f0
	bool GetIsLanding(); // Function ConZ.Bird2.GetIsLanding // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x23610c0
	bool GetIsFlying(); // Function ConZ.Bird2.GetIsFlying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2361090
	void CapsuleComponent_OnComponentHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function ConZ.Bird2.CapsuleComponent_OnComponentHit // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x2360ea0
};

// Class ConZ.Bird2AIController
// Size: 0x4a8 (Inherited: 0x450)
struct ABird2AIController : AConZAIController {
	float FlyDurationMin; // 0x450(0x04)
	float FlyDurationMax; // 0x454(0x04)
	float RemainOnGroundDurationMin; // 0x458(0x04)
	float RemainOnGroundDurationMax; // 0x45c(0x04)
	float TurnSpeed; // 0x460(0x04)
	float FlightSegmentDistance; // 0x464(0x04)
	float LandingDistance; // 0x468(0x04)
	char pad_46C[0x3c]; // 0x46c(0x3c)

	void UpdatePerception(struct TArray<struct AActor*>& actorsPercepted); // Function ConZ.Bird2AIController.UpdatePerception // (Final|Native|Private|HasOutParms) // @ game+0x23616e0
};

// Class ConZ.Bird2AnimInstance
// Size: 0x2d0 (Inherited: 0x2c0)
struct UBird2AnimInstance : UAnimInstance {
	float ABPSpeed; // 0x2b8(0x04)
	bool IsLanding; // 0x2bc(0x01)
	bool IsTakingOff; // 0x2bd(0x01)
	bool IsPerched; // 0x2be(0x01)
	bool IsFlying; // 0x2bf(0x01)
	bool IsStaringPerched; // 0x2c0(0x01)
	struct FRotator SlopeRootTiltRotation; // 0x2c4(0x0c)
};

// Class ConZ.BirdTargetPoint
// Size: 0x228 (Inherited: 0x220)
struct ABirdTargetPoint : AActor {
	bool IsOccupied; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)
};

// Class ConZ.BloodStain
// Size: 0x2b8 (Inherited: 0x220)
struct ABloodStain : AActor {
	char pad_220[0x8]; // 0x220(0x08)
	struct UStaticMeshComponent* _mesh; // 0x228(0x08)
	struct FText _name; // 0x230(0x18)
	struct FText _sampleExtractionText; // 0x248(0x18)
	struct AItem* _sampleExtractionTool; // 0x260(0x08)
	struct AItem* _sampleExtractionProduct; // 0x268(0x08)
	struct UAnimMontage* _sampleExtractionMontage; // 0x270(0x08)
	struct UAkAudioEvent* _sampleExtractionStartAudioEvent; // 0x278(0x08)
	struct UAkAudioEvent* _sampleExtractionStopAudioEvent; // 0x280(0x08)
	float _sampleExtractionBaseDuration; // 0x288(0x04)
	bool _isSampleBeingExtracted; // 0x28c(0x01)
	char pad_28D[0x13]; // 0x28d(0x13)
	float _timeBeforeDecayStarts; // 0x2a0(0x04)
	float _decayDuration; // 0x2a4(0x04)
	float _fallThroughGroundRateWhenDecaying; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	bool _isDecaying; // 0x2b0(0x01)
	char pad_2B1[0x7]; // 0x2b1(0x07)
};

// Class ConZ.BluntMeleeWeaponItemTag
// Size: 0x30 (Inherited: 0x30)
struct UBluntMeleeWeaponItemTag : UBaseItemTag {
};

// Class ConZ.Boat
// Size: 0x1b60 (Inherited: 0x12f0)
struct ABoat : AVehicleBase {
	char pad_12F0[0x10]; // 0x12f0(0x10)
	struct UAdvancedBuoyancyComponent* _advancedBuoyancyComponent; // 0x1300(0x08)
	struct UVehiclePowertrainComponent* _powertrainComponent; // 0x1308(0x08)
	struct UParticleSystemComponent* _motorWaterSplashParticleComponent; // 0x1310(0x08)
	char pad_1318[0x4]; // 0x1318(0x04)
	float _throttleForceMagnitude; // 0x131c(0x04)
	struct FVector _forcePosition; // 0x1320(0x0c)
	float _yawImpulse; // 0x132c(0x04)
	float _rollImpulse; // 0x1330(0x04)
	float _pitchImpulse; // 0x1334(0x04)
	struct FRuntimeFloatCurve _driverActionDifficultyVsSpeed; // 0x1338(0x88)
	struct FRuntimeFloatCurve _driverActionDifficultyVsForce; // 0x13c0(0x88)
	struct FRuntimeFloatCurve _driverConstitutionChangeRateModifierVsSpeed; // 0x1448(0x88)
	struct FRuntimeFloatCurve _driverStrengthChangeRateModifierVsSpeed; // 0x14d0(0x88)
	struct FBoatParametersPerMovementPace _parametersPerMovementPace[0x3]; // 0x1558(0x48)
	struct FFloatInterval _maxSpeedModifierInterpedWithDriverDexterity; // 0x15a0(0x08)
	float _throttleInterpSpeed; // 0x15a8(0x04)
	char pad_15AC[0x4]; // 0x15ac(0x04)
	float _brakeInterpSpeed; // 0x15b0(0x04)
	char pad_15B4[0x4]; // 0x15b4(0x04)
	float _steerInterpSpeed; // 0x15b8(0x04)
	char pad_15BC[0x4]; // 0x15bc(0x04)
	float _maxSteeringAngle; // 0x15c0(0x04)
	float _motorSteeringForce; // 0x15c4(0x04)
	float _motorSteerTurnMultiplier; // 0x15c8(0x04)
	float _maxSpeedForBase; // 0x15cc(0x04)
	struct FRuntimeFloatCurve _rudderEfficiencyBySpeedKmH; // 0x15d0(0x88)
	struct FRuntimeFloatCurve _sidewaysVelocityFalloff; // 0x1658(0x88)
	struct FRuntimeFloatCurve _speedKmhVsDensityMultiplier; // 0x16e0(0x88)
	float _maxMotorSpeed; // 0x1768(0x04)
	float _throttleToRpmMultiplier; // 0x176c(0x04)
	char pad_1770[0x10]; // 0x1770(0x10)
	enum class EBoatPaddlingState _paddlingState; // 0x1780(0x01)
	char pad_1781[0x3]; // 0x1781(0x03)
	float _maxRowingSpeed; // 0x1784(0x04)
	float _rowingForce; // 0x1788(0x04)
	char pad_178C[0x4]; // 0x178c(0x04)
	struct FRuntimeFloatCurve _rowForceMultiplierPerKph; // 0x1790(0x88)
	float _rowTurnMultiplier; // 0x1818(0x04)
	char pad_181C[0x4]; // 0x181c(0x04)
	struct FRuntimeFloatCurve _rowTurnMultiplierPerKph; // 0x1820(0x88)
	struct UAkAudioEvent* _rowingAudioEvent; // 0x18a8(0x08)
	float _desiredDriftMultiplier; // 0x18b0(0x04)
	float _paddleDriftSteerMultiplier; // 0x18b4(0x04)
	uint32_t _numPaddleSwingsInOneHand; // 0x18b8(0x04)
	bool _hasSails; // 0x18bc(0x01)
	char pad_18BD[0x3]; // 0x18bd(0x03)
	struct FName _sailCollisionShapeName; // 0x18c0(0x08)
	float _sailingForceMultiplier; // 0x18c8(0x04)
	struct FFloatInterval _windIntensityInterval; // 0x18cc(0x08)
	char pad_18D4[0x4]; // 0x18d4(0x04)
	struct FRuntimeFloatCurve _sailingForceMultiplierPerKph; // 0x18d8(0x88)
	float _sailingTurnMultiplier; // 0x1960(0x04)
	char pad_1964[0x4]; // 0x1964(0x04)
	struct FRuntimeFloatCurve _sailingTurnMultiplierPerKph; // 0x1968(0x88)
	struct UAkAudioEvent* _sailingRudderStartAudioEvent; // 0x19f0(0x08)
	struct UAkAudioEvent* _sailingRudderEndAudioEvent; // 0x19f8(0x08)
	struct UAkAudioEvent* _sailsTautAudioEvent; // 0x1a00(0x08)
	int32_t _sailsDeploySteps; // 0x1a08(0x04)
	float _sailsDeploySpeedMultiplier; // 0x1a0c(0x04)
	uint32_t _sailsTurnSteps; // 0x1a10(0x04)
	float _sailsTurnSpeedMultiplier; // 0x1a14(0x04)
	float _sailsMaxTurnAngle; // 0x1a18(0x04)
	float _maxSailingSpeed; // 0x1a1c(0x04)
	struct FRuntimeFloatCurve _sailsDeploymentRatioVsForceMultiplier; // 0x1a20(0x88)
	float _sailingSteerSoundMultiplier; // 0x1aa8(0x04)
	char pad_1AAC[0x20]; // 0x1aac(0x20)
	enum class EBoatSDFType _sdfType; // 0x1acc(0x04)
	struct UParticleSystemComponent* _LOarWaterParticles; // 0x1ad0(0x08)
	struct UParticleSystemComponent* _ROarWaterParticles; // 0x1ad8(0x08)
	struct FBox _dryVolume; // 0x1ae0(0x1c)
	float _EMInterferenceMaxDisabledTime; // 0x1afc(0x04)
	char pad_1B00[0x60]; // 0x1b00(0x60)
};

// Class ConZ.VehicleBaseMountSlot
// Size: 0x190 (Inherited: 0x28)
struct UVehicleBaseMountSlot : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct UVehicleAttachment* AttachmentOwner; // 0x30(0x08)
	struct FName MountSocketName; // 0x38(0x08)
	struct FName MountedCollisionShapeName; // 0x40(0x08)
	enum class EVehicleMountType Type; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct UPhysicalMaterial* InteractionMaterial; // 0x50(0x08)
	struct UAnimInstance* MountedAnimInstanceClass; // 0x58(0x08)
	struct UAnimSequenceBase* MountedAnimation; // 0x60(0x08)
	struct UBlendSpace* MountedBlendspace; // 0x68(0x08)
	struct UBlendSpace* MountedBlendspaceFP; // 0x70(0x08)
	char pad_78[0x8]; // 0x78(0x08)
	struct FPrisonerRestingParameters DefaultPrisonerRestingParameters; // 0x80(0x60)
	struct FGameplayTag SlotId; // 0xe0(0x08)
	struct FText MountInteractionCaption; // 0xe8(0x18)
	float ForceUnmountDuration; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct UObject* _mountee; // 0x108(0x08)
	struct UObject* _reservee; // 0x110(0x08)
	char pad_118[0x8]; // 0x118(0x08)
	struct UVehicleWeaponAimingParameters* _weaponAimingParametersClass; // 0x120(0x08)
	float _forceUnmountAngle; // 0x128(0x04)
	struct FGameplayTag _reachabilityFromSkyStateTag; // 0x12c(0x08)
	bool _shouldHideAttachedItems; // 0x134(0x01)
	char pad_135[0x3]; // 0x135(0x03)
	struct FVector _prisonerViewpointOffset; // 0x138(0x0c)
	struct FVector _prisonerFeetOffset; // 0x144(0x0c)
	struct TArray<struct UExternalMountPath*> _externalMountPaths; // 0x150(0x10)
	struct TArray<struct UExternalMountPath*> _emergencyMountPaths; // 0x160(0x10)
	struct TArray<struct UInternalMountPath*> _internalMountPaths; // 0x170(0x10)
	char pad_180[0x10]; // 0x180(0x10)

	void OnRep_AttachmentOwner(struct UVehicleAttachment* oldAttachmentOwner); // Function ConZ.VehicleBaseMountSlot.OnRep_AttachmentOwner // (Final|Native|Private) // @ game+0x2522c20
};

// Class ConZ.BoatMountSlot
// Size: 0x1b0 (Inherited: 0x190)
struct UBoatMountSlot : UVehicleBaseMountSlot {
	enum class EBoatControlType _controlType; // 0x188(0x01)
	struct UAnimSequence* _startEngineStartAnimation; // 0x190(0x08)
	struct UAnimSequence* _startEngineLoopAnimation; // 0x198(0x08)
	struct UAnimSequence* _startEngineLongLoopAnimation; // 0x1a0(0x08)
	struct UAnimSequence* _startEngineEndAnimation; // 0x1a8(0x08)
};

// Class ConZ.BombDefusalMinigameBase
// Size: 0x530 (Inherited: 0x340)
struct ABombDefusalMinigameBase : AMinigame {
	struct UStaticMeshComponent* _timeBomb; // 0x340(0x08)
	struct UStaticMesh* _splineConnectorMesh; // 0x348(0x08)
	char pad_350[0x8]; // 0x350(0x08)
	struct FVector _wireButtonsSize; // 0x358(0x0c)
	char pad_364[0x4]; // 0x364(0x04)
	struct USkeletalMeshComponent* _defusalTool; // 0x368(0x08)
	float _toolMovementSensitivity; // 0x370(0x04)
	struct FVector _minDefusingToolOffsetFromCenter; // 0x374(0x0c)
	struct FVector _maxDefusingToolOffsetFromCenter; // 0x380(0x0c)
	char pad_38C[0x4]; // 0x38c(0x04)
	struct UMaterialInterface* _greenLedLight; // 0x390(0x08)
	struct UMaterialInterface* _redLedLight; // 0x398(0x08)
	struct UMaterialInterface* _yellowLedLight; // 0x3a0(0x08)
	struct TArray<struct UStaticMeshComponent*> _ledLights; // 0x3a8(0x10)
	struct UStaticMesh* _ledLightMesh; // 0x3b8(0x08)
	char pad_3C0[0x8]; // 0x3c0(0x08)
	struct UStaticMesh* _wireMesh; // 0x3c8(0x08)
	struct TArray<enum class EWireType> _wiresEndPositions; // 0x3d0(0x10)
	struct TArray<struct FWireDescription> _wires; // 0x3e0(0x10)
	char pad_3F0[0x10]; // 0x3f0(0x10)
	struct TArray<struct FSplineDescription> _splines; // 0x400(0x10)
	char pad_410[0x10]; // 0x410(0x10)
	int32_t _numberOfWires; // 0x420(0x04)
	int32_t _numberOfWirePoints; // 0x424(0x04)
	int32_t _wiresShuffleIntensity; // 0x428(0x04)
	int32_t _minWiresComplexity; // 0x42c(0x04)
	enum class ESplineAxis _wiresForwardAxis; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	float _wiresStartSmoothness; // 0x434(0x04)
	float _wiresEndSmoothness; // 0x438(0x04)
	float _wiresMiddleSmoothness; // 0x43c(0x04)
	float _wiresSharpCornerSmoothness; // 0x440(0x04)
	float _maxSegmentSize; // 0x444(0x04)
	float _wirePointsSpreadPositive; // 0x448(0x04)
	float _wirePointsSpreadNegative; // 0x44c(0x04)
	float _wireHeight; // 0x450(0x04)
	float _wireVerticalSpacing; // 0x454(0x04)
	struct FVector _wirePointsOffset; // 0x458(0x0c)
	float _wireEndOffset; // 0x464(0x04)
	struct FVector _additionalWireEndPointOffset; // 0x468(0x0c)
	char pad_474[0x4]; // 0x474(0x04)
	struct UStaticMeshComponent* _cutWireSegment0; // 0x478(0x08)
	struct UStaticMeshComponent* _cutWireSegment1; // 0x480(0x08)
	struct UStaticMeshComponent* _cutWireSegment2; // 0x488(0x08)
	struct UStaticMeshComponent* _cutWireSegment3; // 0x490(0x08)
	struct UStaticMeshComponent* _cutWireSegment4; // 0x498(0x08)
	struct UStaticMeshComponent* _cutWireSegment5; // 0x4a0(0x08)
	struct UStaticMeshComponent* _uncutWireSegment0; // 0x4a8(0x08)
	struct UStaticMeshComponent* _uncutWireSegment1; // 0x4b0(0x08)
	struct UStaticMeshComponent* _uncutWireSegment2; // 0x4b8(0x08)
	struct UStaticMeshComponent* _uncutWireSegment3; // 0x4c0(0x08)
	struct UStaticMeshComponent* _uncutWireSegment4; // 0x4c8(0x08)
	struct UStaticMeshComponent* _uncutWireSegment5; // 0x4d0(0x08)
	struct UBoxComponent* _wireBox1; // 0x4d8(0x08)
	struct UBoxComponent* _wireBox2; // 0x4e0(0x08)
	struct UBoxComponent* _wireBox3; // 0x4e8(0x08)
	struct UBoxComponent* _wireBox4; // 0x4f0(0x08)
	struct UBoxComponent* _wireBox5; // 0x4f8(0x08)
	struct UBoxComponent* _wireBox6; // 0x500(0x08)
	struct UAkAudioEvent* _bombDefusalTimerStartSound; // 0x508(0x08)
	struct UAkAudioEvent* _bombDefusalTimerStopSound; // 0x510(0x08)
	struct UAkAudioEvent* _cutWireSound; // 0x518(0x08)
	struct UAkAudioEvent* _bombDefusedSound; // 0x520(0x08)
	char pad_528[0x8]; // 0x528(0x08)

	void PlayCutWireMontage(); // Function ConZ.BombDefusalMinigameBase.PlayCutWireMontage // (Final|Native|Protected|BlueprintCallable) // @ game+0x2364870
};

// Class ConZ.BombDefusalMinigame
// Size: 0x540 (Inherited: 0x530)
struct ABombDefusalMinigame : ABombDefusalMinigameBase {
	char pad_530[0x10]; // 0x530(0x10)
};

// Class ConZ.BombDefusalMinigameConfiguration
// Size: 0x70 (Inherited: 0x50)
struct UBombDefusalMinigameConfiguration : UMinigameConfiguration {
	char pad_50[0x20]; // 0x50(0x20)
};

// Class ConZ.MinigameWidget
// Size: 0x280 (Inherited: 0x268)
struct UMinigameWidget : UUserWidget {
	char pad_268[0x18]; // 0x268(0x18)
};

// Class ConZ.BombDefusalWidget
// Size: 0x2a0 (Inherited: 0x280)
struct UBombDefusalWidget : UMinigameWidget {
	struct UTextBlock* _remainingTimeMinutes1; // 0x280(0x08)
	struct UTextBlock* _remainingTimeMinutes2; // 0x288(0x08)
	struct UTextBlock* _remainingTimeSeconds1; // 0x290(0x08)
	struct UTextBlock* _remainingTimeSeconds2; // 0x298(0x08)

	void ShowInfo(); // Function ConZ.BombDefusalWidget.ShowInfo // (Native|Event|Public|BlueprintEvent) // @ game+0x23648c0
	bool ShouldShowChangeDurationInfo(); // Function ConZ.BombDefusalWidget.ShouldShowChangeDurationInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2364890
	void OnSuccess(); // Function ConZ.BombDefusalWidget.OnSuccess // (Native|Event|Public|BlueprintEvent) // @ game+0x2364850
	void HideInfo(); // Function ConZ.BombDefusalWidget.HideInfo // (Native|Event|Public|BlueprintEvent) // @ game+0x23644f0
	int32_t GetNumTries(); // Function ConZ.BombDefusalWidget.GetNumTries // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x23644c0
};

// Class ConZ.BondageComponent
// Size: 0xef0 (Inherited: 0xee0)
struct UBondageComponent : USkeletalMeshComponent {
	struct AItem* _bondageItem; // 0xed8(0x08)
	enum class EBoundBodyPart _boundBodyPart; // 0xee0(0x01)
	float _tightness; // 0xee4(0x04)
	char pad_EED[0x3]; // 0xeed(0x03)

	void UpdateVisuals(); // Function ConZ.BondageComponent.UpdateVisuals // (Final|Native|Public|BlueprintCallable) // @ game+0x23648e0
	void OnRep_BoundBodyPart(); // Function ConZ.BondageComponent.OnRep_BoundBodyPart // (Final|Native|Private) // @ game+0x23647b0
	void OnRep_BondageItem(); // Function ConZ.BondageComponent.OnRep_BondageItem // (Final|Native|Private) // @ game+0x2364790
	struct AItem* GetBondageItem(); // Function ConZ.BondageComponent.GetBondageItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2364450
};

// Class ConZ.BondageItemTag
// Size: 0x98 (Inherited: 0x30)
struct UBondageItemTag : UBaseItemTag {
	struct USkeletalMesh* BondageMesh; // 0x30(0x08)
	float BaseStruggleDuration; // 0x38(0x04)
	float StruggleStrengthModifier; // 0x3c(0x04)
	float StruggleDexterityModifier; // 0x40(0x04)
	float GroundMovementSpeedMultiplier; // 0x44(0x04)
	float WaterMovementSpeedMultiplier; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UAnimSequenceBase* HandsBoundIdleFPAnimation; // 0x50(0x08)
	struct UAnimSequenceBase* HandsBoundIdleTPAnimation; // 0x58(0x08)
	struct UAnimMontage* HandsBoundMontage; // 0x60(0x08)
	struct UAnimMontage* HandsAdjustMontage; // 0x68(0x08)
	struct UAnimMontage* HandsBoundStruggleMontage; // 0x70(0x08)
	struct UAnimMontage* HandsFreedMontage; // 0x78(0x08)
	struct UAnimMontage* BindingHandsMontage; // 0x80(0x08)
	struct UAnimMontage* AdjustingHandsMontage; // 0x88(0x08)
	struct UAnimMontage* HandsBoundSuicideMontage; // 0x90(0x08)
};

// Class ConZ.WeaponAttachment
// Size: 0x9e0 (Inherited: 0x9b0)
struct AWeaponAttachment : AItem {
	struct FName LowestMiddleSocketName; // 0x9a8(0x08)
	struct FName HighestMiddleSocketName; // 0x9b0(0x08)
	struct UStaticMesh* _staticMeshWhenAttached; // 0x9c0(0x08)
	char pad_9C8[0x18]; // 0x9c8(0x18)

	void Unequip(); // Function ConZ.WeaponAttachment.Unequip // (Final|Native|Public|BlueprintCallable) // @ game+0x253a2d0
	struct FWeaponMalfunctionProbability GetWeaponMalfunctionProbabilityForMalfunctionEvent(struct AWeapon* Weapon, enum class EWeaponMalfunctionEvent malfunctionEvent); // Function ConZ.WeaponAttachment.GetWeaponMalfunctionProbabilityForMalfunctionEvent // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2539930
	struct UStaticMesh* GetStaticMeshWhenAttached(); // Function ConZ.WeaponAttachment.GetStaticMeshWhenAttached // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2539810
	struct USkeletalMesh* GetSkeletalMeshWhenAttached(); // Function ConZ.WeaponAttachment.GetSkeletalMeshWhenAttached // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x25397e0
	float GetShakinessModifier(); // Function ConZ.WeaponAttachment.GetShakinessModifier // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x25397a0
	struct AWeapon* GetOwningWeapon(); // Function ConZ.WeaponAttachment.GetOwningWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2539740
	void Equip(struct AWeapon* Weapon); // Function ConZ.WeaponAttachment.Equip // (Native|Public|BlueprintCallable) // @ game+0x23dc470
	bool CanBeRemovedIfAttachedToWeapon(); // Function ConZ.WeaponAttachment.CanBeRemovedIfAttachedToWeapon // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2539100
};

// Class ConZ.BowAttachmentSilencer
// Size: 0x9e0 (Inherited: 0x9e0)
struct ABowAttachmentSilencer : AWeaponAttachment {
	float _noiseMultiplier; // 0x9d8(0x04)
};

// Class ConZ.BowAttachmentStabilizer
// Size: 0x9f0 (Inherited: 0x9e0)
struct ABowAttachmentStabilizer : ABowAttachmentSilencer {
	float _shakinessModifier; // 0x9e0(0x04)
	char pad_9E4[0xc]; // 0x9e4(0x0c)
};

// Class ConZ.MeleeSkill
// Size: 0x108 (Inherited: 0xb0)
struct UMeleeSkill : UStrengthSkill {
	struct UMeleeSkillAnimationsPreset* AnimationsPreset; // 0xb0(0x08)
	struct FMeleeSkillExperienceAwards _noSkillExperienceAwards; // 0xb8(0x10)
	struct FMeleeSkillExperienceAwards _basicSkillExperienceAwards; // 0xc8(0x10)
	struct FMeleeSkillExperienceAwards _mediumSkillExperienceAwards; // 0xd8(0x10)
	struct FMeleeSkillExperienceAwards _advancedSkillExperienceAwards; // 0xe8(0x10)
	struct FMeleeSkillExperienceAwards _aboveAdvancedSkillExperienceAwards; // 0xf8(0x10)

	struct UAnimSequenceBase* GetWalkingIdleAnimationTP(); // Function ConZ.MeleeSkill.GetWalkingIdleAnimationTP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242eae0
	struct UAnimSequenceBase* GetWalkingIdleAnimationFP(); // Function ConZ.MeleeSkill.GetWalkingIdleAnimationFP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242eab0
	struct UAnimSequenceBase* GetTiredIdleAnimationTP(); // Function ConZ.MeleeSkill.GetTiredIdleAnimationTP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242ea80
	struct UAnimSequenceBase* GetTiredIdleAnimationFP(); // Function ConZ.MeleeSkill.GetTiredIdleAnimationFP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242ea50
	float GetStaminaMultiplier(float excessGearWeight); // Function ConZ.MeleeSkill.GetStaminaMultiplier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e9b0
	struct UAnimSequenceBase* GetPrimaryIdleAnimationTP(); // Function ConZ.MeleeSkill.GetPrimaryIdleAnimationTP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e980
	struct UAnimSequenceBase* GetPrimaryIdleAnimationFP(); // Function ConZ.MeleeSkill.GetPrimaryIdleAnimationFP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e950
	struct UAnimMontage* GetLeaveCombatModeMontage(); // Function ConZ.MeleeSkill.GetLeaveCombatModeMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e920
	struct TArray<struct UAnimSequenceBase*> GetInactivityIdleAnimations(); // Function ConZ.MeleeSkill.GetInactivityIdleAnimations // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e8e0
	float GetIdleToBlockBlendDuration(); // Function ConZ.MeleeSkill.GetIdleToBlockBlendDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e8b0
	struct UAnimMontage* GetEnterCombatModeMontage(); // Function ConZ.MeleeSkill.GetEnterCombatModeMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e880
	float GetBlockToIdleBlendDuration(); // Function ConZ.MeleeSkill.GetBlockToIdleBlendDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e850
	struct UAnimSequenceBase* GetBlockIdleAnimationTP(); // Function ConZ.MeleeSkill.GetBlockIdleAnimationTP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e820
	struct UAnimSequenceBase* GetBlockIdleAnimationFP(); // Function ConZ.MeleeSkill.GetBlockIdleAnimationFP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e7f0
	struct UBlendSpace* GetAimOffsetBlendSpaceTP(); // Function ConZ.MeleeSkill.GetAimOffsetBlendSpaceTP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e7c0
	struct UBlendSpace* GetAimOffsetBlendSpaceFP(); // Function ConZ.MeleeSkill.GetAimOffsetBlendSpaceFP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x242e790
};

// Class ConZ.BoxingSkill
// Size: 0x108 (Inherited: 0x108)
struct UBoxingSkill : UMeleeSkill {
};

// Class ConZ.TriggerComponent
// Size: 0x4e0 (Inherited: 0x460)
struct UTriggerComponent : UPrimitiveComponent {
	char pad_460[0x70]; // 0x460(0x70)
	struct FObjectConditionContainer _triggeringActorConditions; // 0x4d0(0x10)
};

// Class ConZ.MotionTriggerComponent
// Size: 0x530 (Inherited: 0x4e0)
struct UMotionTriggerComponent : UTriggerComponent {
	struct FVector TriggerForwardVector; // 0x4e0(0x0c)
	float TriggerAngle; // 0x4ec(0x04)
	float MotionDetectionSensitivity; // 0x4f0(0x04)
	float MotionDetectionDepletionSpeed; // 0x4f4(0x04)
	float _motionDetector; // 0x4f8(0x04)
	char pad_4FC[0x4]; // 0x4fc(0x04)
	struct UAkAudioEvent* _motionDetectorStartSound; // 0x500(0x08)
	struct UAkAudioEvent* _motionDetectorEndSound; // 0x508(0x08)
	char pad_510[0x20]; // 0x510(0x20)
};

// Class ConZ.BoxMotionTriggerComponent
// Size: 0x540 (Inherited: 0x530)
struct UBoxMotionTriggerComponent : UMotionTriggerComponent {
	struct UBoxComponent* BoxCollisionComponent; // 0x528(0x08)
	struct FVector _triggerSize; // 0x530(0x0c)

	void BoxComponent_OnComponentEndOverlap(struct UPrimitiveComponent* activatedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function ConZ.BoxMotionTriggerComponent.BoxComponent_OnComponentEndOverlap // (Final|Native|Private) // @ game+0x23642f0
	void BoxComponent_OnComponentBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function ConZ.BoxMotionTriggerComponent.BoxComponent_OnComponentBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x23640c0
};

// Class ConZ.Brenner
// Size: 0x960 (Inherited: 0x830)
struct ABrenner : AConZCharacter {
	char pad_830[0x40]; // 0x830(0x40)
	struct UNavigationInvokerComponent* _navigationInvokerComponent; // 0x870(0x08)
	struct UHitReactComponent* _hitReactComponent; // 0x878(0x08)
	struct UFlamethrowerComponent* _flamethrowerComponent; // 0x880(0x08)
	struct UBrennerCommonData* _brennerCommonData; // 0x888(0x08)
	char pad_890[0x88]; // 0x890(0x88)
	enum class EBrennerState _state; // 0x918(0x01)
	char pad_919[0x1]; // 0x919(0x01)
	bool _aimFlamethrower; // 0x91a(0x01)
	char pad_91B[0x1]; // 0x91b(0x01)
	struct TWeakObjectPtr<struct AActor> _flamethrowerTarget; // 0x91c(0x08)
	char pad_924[0x3c]; // 0x924(0x3c)

	void OnRep_State(enum class EBrennerState oldState); // Function ConZ.Brenner.OnRep_State // (Final|Native|Private) // @ game+0x23647d0
	void OnMontageEnded(struct UAnimMontage* Montage, bool interrupted); // Function ConZ.Brenner.OnMontageEnded // (Final|Native|Private) // @ game+0x23646c0
	void NetMulticast_StopAttack(enum class EBrennerAttackType AttackType); // Function ConZ.Brenner.NetMulticast_StopAttack // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x234bba0
	void NetMulticast_StopAnimation(enum class EBrennerAnimation Animation); // Function ConZ.Brenner.NetMulticast_StopAnimation // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2364640
	void NetMulticast_StartBleeding(); // Function ConZ.Brenner.NetMulticast_StartBleeding // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x234bb80
	void NetMulticast_StartAttack(struct FBrennerAttackDescription attackDescription); // Function ConZ.Brenner.NetMulticast_StartAttack // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2364590
	void NetMulticast_PlayHitReact(enum class EHitDirectionType hitDirectionType); // Function ConZ.Brenner.NetMulticast_PlayHitReact // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x234bca0
	void NetMulticast_PlayAnimation(enum class EBrennerAnimation Animation); // Function ConZ.Brenner.NetMulticast_PlayAnimation // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2364510
	struct FVector GetFlamethrowerAimLocation(); // Function ConZ.Brenner.GetFlamethrowerAimLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x2364480
};

// Class ConZ.BrennerAIController
// Size: 0x5d0 (Inherited: 0x450)
struct ABrennerAIController : AConZAIController {
	struct UAISenseConfig_Sight* _sightSenseConfigCombat; // 0x450(0x08)
	struct UAISenseConfig_Hearing* _hearingSenseConfigCombat; // 0x458(0x08)
	struct UAISenseConfig_Touch* _touchSenseConfig; // 0x460(0x08)
	struct TMap<struct FName, float> _noiseAccumulationMultiplierPerNoiseTag; // 0x468(0x50)
	struct FVector _hibernateLocation; // 0x4b8(0x0c)
	float _genericAcceptanceRadius; // 0x4c4(0x04)
	char pad_4C8[0x8]; // 0x4c8(0x08)
	struct UNPCControllerStateBrennerBase* _statesByEnum[0xa]; // 0x4d0(0x50)
	char pad_520[0xb0]; // 0x520(0xb0)

	void SensingComponent_OnActorSensed(struct TArray<struct AActor*>& actorsPercepted); // Function ConZ.BrennerAIController.SensingComponent_OnActorSensed // (Final|Native|Private|HasOutParms) // @ game+0x23681a0
};

// Class ConZ.BrennerAnimInstance
// Size: 0x300 (Inherited: 0x2c0)
struct UBrennerAnimInstance : UAnimInstance {
	char pad_2C0[0x8]; // 0x2c0(0x08)
	enum class EBrennerState _brennerState; // 0x2c8(0x01)
	enum class EBrennerMovementPace _desiredMovementPace; // 0x2c9(0x01)
	char pad_2CA[0x2]; // 0x2ca(0x02)
	struct FVector _acceleration; // 0x2cc(0x0c)
	bool _wantsToMove; // 0x2d8(0x01)
	bool _wantsToWalk; // 0x2d9(0x01)
	bool _wantsToJog; // 0x2da(0x01)
	bool _wantsToCharge; // 0x2db(0x01)
	struct FVector _velocity; // 0x2dc(0x0c)
	float _speed; // 0x2e8(0x04)
	float _speedXY; // 0x2ec(0x04)
	bool _isUsingFlamethrower; // 0x2f0(0x01)
	bool _isAimingFlamethrower; // 0x2f1(0x01)
	char pad_2F2[0x2]; // 0x2f2(0x02)
	struct FVector _flamethrowerAimLocation; // 0x2f4(0x0c)
};

// Class ConZ.BrennerCommonData
// Size: 0x160 (Inherited: 0x30)
struct UBrennerCommonData : UDataAsset {
	float AlertedSoundThreshold; // 0x30(0x04)
	float TwitchSoundThreshold; // 0x34(0x04)
	struct FFloatInterval SightAndAwarenessRange; // 0x38(0x08)
	float TwitchCooldown; // 0x40(0x04)
	float HopForwardSpeed; // 0x44(0x04)
	float PostHopCooldown; // 0x48(0x04)
	float InvestigateAlarmDuration; // 0x4c(0x04)
	struct FFloatInterval FlamethrowerRange; // 0x50(0x08)
	float HalfAngleAtMinRange; // 0x58(0x04)
	float HalfAngleAtMaxRange; // 0x5c(0x04)
	struct UAnimMontage* _animationsForEvents[0x6]; // 0x60(0x30)
	struct TArray<struct UAnimMontage*> FrontAttacks; // 0x90(0x10)
	struct TArray<struct UAnimMontage*> BackAttacks; // 0xa0(0x10)
	struct TArray<struct UAnimMontage*> LegAttacks; // 0xb0(0x10)
	struct TArray<struct UAnimMontage*> AllAroundAttacks; // 0xc0(0x10)
	struct TArray<struct UAnimMontage*> ChargeAttacks; // 0xd0(0x10)
	struct FName HeadBoneName; // 0xe0(0x08)
	struct FGameplayTag HitReactTypeStanding; // 0xe8(0x08)
	float HeadShotDamageHitReactThreshold; // 0xf0(0x04)
	float AccumulatedDamageHitReactThreshold; // 0xf4(0x04)
	float BleedingChance; // 0xf8(0x04)
	float BleedingCooldown; // 0xfc(0x04)
	int32_t NumBleedsToEnterLongCooldown; // 0x100(0x04)
	float BleedingLongCooldown; // 0x104(0x04)
	float BleedingDuration; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct TArray<struct FBrennerCommonData_BleedingParticles> BleedingParticles; // 0x110(0x10)
	struct TArray<struct TSoftClassPtr<UObject>> PossibleBloodStains; // 0x120(0x10)
	float BloodStainsOffsetAlongHitNormal; // 0x130(0x04)
	float DamageThresholdForRageMode; // 0x134(0x04)
	float DamageDepletionRate; // 0x138(0x04)
	float RageModeDuration; // 0x13c(0x04)
	struct UAkAudioEvent* HibernateAudioEvent; // 0x140(0x08)
	struct UAkAudioEvent* AlertedAudioEvent; // 0x148(0x08)
	struct UAkAudioEvent* CombatAudioEvent; // 0x150(0x08)
	struct UAkAudioEvent* ChargeAudioEvent; // 0x158(0x08)
};

// Class ConZ.BrennerMovementComponent
// Size: 0xdc0 (Inherited: 0xda0)
struct UBrennerMovementComponent : UConZCharacterMovementComponent {
	float _speedForPace[0x3]; // 0xda0(0x0c)
	float _accelerationForPace[0x3]; // 0xdac(0x0c)
	char pad_DB8[0x8]; // 0xdb8(0x08)
};

// Class ConZ.BrokenArrow
// Size: 0x9b0 (Inherited: 0x9b0)
struct ABrokenArrow : AItem {
};

// Class ConZ.BruisingComponent
// Size: 0x128 (Inherited: 0xb0)
struct UBruisingComponent : UActorComponent {
	struct UBruisingData* BruisingData; // 0xb0(0x08)
	bool FadeBruises; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	float BruisesLifeTime; // 0xbc(0x04)
	float BruisesFadeUpdateInterval; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct UTextureRenderTarget2D* _renderTargetByLayer[0x3]; // 0xc8(0x18)
	char pad_E0[0x48]; // 0xe0(0x48)

	void MakeCompletelyBruised(); // Function ConZ.BruisingComponent.MakeCompletelyBruised // (Final|Native|Public|BlueprintCallable) // @ game+0x2368030
	struct UTextureRenderTarget2D* GetBruiseLayerRenderTarget(enum class EBruiseLayer Layer); // Function ConZ.BruisingComponent.GetBruiseLayerRenderTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2367fa0
	void ClearBruises(); // Function ConZ.BruisingComponent.ClearBruises // (Final|Native|Public|BlueprintCallable) // @ game+0x2367f80
	void AddBruise(enum class EBruiseZone zone); // Function ConZ.BruisingComponent.AddBruise // (Final|Native|Public|BlueprintCallable) // @ game+0x2367f00
};

// Class ConZ.BruisingData
// Size: 0x40 (Inherited: 0x30)
struct UBruisingData : UDataAsset {
	struct TArray<struct FBruisePatch> Patches; // 0x30(0x10)
};

// Class ConZ.BuildingHelperComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UBuildingHelperComponent : UActorComponent {
};

// Class ConZ.Building
// Size: 0x4c8 (Inherited: 0x220)
struct ABuilding : AActor {
	char pad_220[0x20]; // 0x220(0x20)
	struct TArray<struct FLadderMarker> _ladderMarkers; // 0x240(0x10)
	char pad_250[0x10]; // 0x250(0x10)
	struct TArray<struct FWindowMarker> _windowMarkers; // 0x260(0x10)
	char pad_270[0xa0]; // 0x270(0xa0)
	bool _isClaimable; // 0x310(0x01)
	char pad_311[0xb7]; // 0x311(0xb7)
	struct TMap<int32_t, struct FBuildingNavLinkData> _generatedNavLinkDataByWindowIndex; // 0x3c8(0x50)
	struct TMap<struct FString, struct FBuildingNavLinkData> _generatedNavLinkDataByDoorRuntimeId; // 0x418(0x50)
	struct UNavArea* _doorNavArea; // 0x468(0x08)
	struct UNavArea* _windowNavArea; // 0x470(0x08)
	char pad_478[0x50]; // 0x478(0x50)
};

// Class ConZ.BuildingEntitySave
// Size: 0x30 (Inherited: 0x28)
struct UBuildingEntitySave : UObject {
	struct FBuildingEntityData BuildingData; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class ConZ.BuildingEntitySetup
// Size: 0x80 (Inherited: 0x80)
struct UBuildingEntitySetup : UEntitySetup {
};

// Class ConZ.BuildingInterior
// Size: 0x220 (Inherited: 0x220)
struct ABuildingInterior : AActor {
};

// Class ConZ.BuildingManager
// Size: 0x3a8 (Inherited: 0x220)
struct ABuildingManager : AActor {
	char pad_220[0x48]; // 0x220(0x48)
	struct TMap<struct ABuilding*, struct FBox2D> _buildings; // 0x268(0x50)
	char pad_2B8[0x8]; // 0x2b8(0x08)
	struct FBuildingsReplicationHelper _buildingsDataRepHelper; // 0x2c0(0x70)
	char pad_330[0x78]; // 0x330(0x78)

	void NetMulticast_UpdateBuildingData(int32_t dataVersion, struct FString runtimeId, struct FBuildingData BuildingData); // Function ConZ.BuildingManager.NetMulticast_UpdateBuildingData // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2368050
};

// Class ConZ.BunkerBoundsTagActor
// Size: 0x238 (Inherited: 0x220)
struct ABunkerBoundsTagActor : AActor {
	struct FName _bunkerId; // 0x220(0x08)
	struct UBoxComponent* _bounds; // 0x228(0x08)
	bool _tagAsSentryLocation; // 0x230(0x01)
	bool _tagAsNormalBunker; // 0x231(0x01)
	char pad_232[0x6]; // 0x232(0x06)
};

// Class ConZ.Buriable
// Size: 0x28 (Inherited: 0x28)
struct UBuriable : UInterface {
};

// Class ConZ.ItemComponentStateBase
// Size: 0x40 (Inherited: 0x28)
struct UItemComponentStateBase : UObject {
	struct FDbIntegerId ID; // 0x28(0x08)
	struct FString ComponentName; // 0x30(0x10)
};

// Class ConZ.BuriableItemComponentState
// Size: 0x50 (Inherited: 0x40)
struct UBuriableItemComponentState : UItemComponentStateBase {
	bool IsBuried; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FDbIntegerId BurierUserId; // 0x48(0x08)
};

// Class ConZ.BuriableChestItemComponentState
// Size: 0x58 (Inherited: 0x50)
struct UBuriableChestItemComponentState : UBuriableItemComponentState {
	float StoredAutoDestructTime; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
};

// Class ConZ.BuriableItemComponent
// Size: 0x180 (Inherited: 0xc8)
struct UBuriableItemComponent : UItemComponent {
	char pad_C8[0x8]; // 0xc8(0x08)
	bool _canEverShowMarker; // 0xd0(0x01)
	char pad_D1[0x10]; // 0xd1(0x10)
	bool _canBeBuried; // 0xe1(0x01)
	bool _canBeBuriedInEnemyFlagArea; // 0xe2(0x01)
	char pad_E3[0x5]; // 0xe3(0x05)
	struct FBurialInformation _repBurialInformation; // 0xe8(0x18)
	char pad_100[0x8]; // 0x100(0x08)
	struct UStaticMesh* _buriedMesh; // 0x108(0x08)
	struct FVector _buriedMeshScale; // 0x110(0x0c)
	struct FVector _buriedMeshRelativeLocation; // 0x11c(0x0c)
	char pad_128[0x10]; // 0x128(0x10)
	struct UMaterialBillboardComponent* _spriteMarkerBillboard; // 0x138(0x08)
	struct FMaterialSpriteElement _spriteMarkerData; // 0x140(0x28)
	struct FVector _spriteMarkerRelativeLocation; // 0x168(0x0c)
	bool _applyBuryMaterial; // 0x174(0x01)
	char pad_175[0x3]; // 0x175(0x03)
	float _startMeshFadeDistance; // 0x178(0x04)
	float _endMeshFadeDistance; // 0x17c(0x04)

	void OnRep_UpdateBurialInformation(); // Function ConZ.BuriableItemComponent.OnRep_UpdateBurialInformation // (Final|Native|Private) // @ game+0x2368180
};

// Class ConZ.BuriableChestItemComponent
// Size: 0x190 (Inherited: 0x180)
struct UBuriableChestItemComponent : UBuriableItemComponent {
	int64_t _decayInDaysWhenBuried; // 0x180(0x08)
	char pad_188[0x8]; // 0x188(0x08)
};

// Class ConZ.BuriableTrapItemComponent
// Size: 0x180 (Inherited: 0x180)
struct UBuriableTrapItemComponent : UBuriableItemComponent {
};

// Class ConZ.BurnDamageType
// Size: 0x40 (Inherited: 0x40)
struct UBurnDamageType : UDamageType {
};

// Class ConZ.BuryData
// Size: 0x88 (Inherited: 0x30)
struct UBuryData : UDataAsset {
	struct TMap<enum class EPhysicalSurface, struct FBuryMaterialData> AllowedBuryMaterials; // 0x30(0x50)
	float StaminaDrain; // 0x80(0x04)
	float RecoveredStaminaThreshold; // 0x84(0x04)
};

// Class ConZ.BuryToolItemTag
// Size: 0x60 (Inherited: 0x30)
struct UBuryToolItemTag : UBaseItemTag {
	bool IsSmallSizedTool; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	int32_t BuryItemUsage; // 0x34(0x04)
	float BuryDurationModifier; // 0x38(0x04)
	struct FName BladeTipSocket; // 0x3c(0x08)
	struct FName BladeCenterSocket; // 0x44(0x08)
	float ShortToolMinBuryTime; // 0x4c(0x04)
	float ShortToolMaxBuryTime; // 0x50(0x04)
	float LongToolMinBuryTime; // 0x54(0x04)
	float LongToolMaxBuryTime; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class ConZ.C4PartTag
// Size: 0x30 (Inherited: 0x30)
struct UC4PartTag : UBaseItemTag {
};

// Class ConZ.CamouflageSkill
// Size: 0x258 (Inherited: 0xb0)
struct UCamouflageSkill : UIntelligenceSkill {
	float _activationTime; // 0xb0(0x04)
	float _standingPenalty; // 0xb4(0x04)
	float _crouchingPenalty; // 0xb8(0x04)
	float _pronePenalty; // 0xbc(0x04)
	float _slowMovingStandingPenalty; // 0xc0(0x04)
	float _slowMovingCrouchingPenalty; // 0xc4(0x04)
	float _slowMovingPronePenalty; // 0xc8(0x04)
	float _mediumMovingStandingPenalty; // 0xcc(0x04)
	float _mediumMovingCrouchingPenalty; // 0xd0(0x04)
	float _fastMovingStandingPenalty; // 0xd4(0x04)
	float _standingAIPerceptionMultiplier; // 0xd8(0x04)
	float _crouchingAIPerceptionMultiplier; // 0xdc(0x04)
	float _proneAIPerceptionMultiplier; // 0xe0(0x04)
	float _maxRelevantAIPerceptionRadius; // 0xe4(0x04)
	char pad_E8[0x6c]; // 0xe8(0x6c)
	struct FCamouflageSkillExperienceAwards NoSkillExperienceAwards; // 0x154(0x04)
	struct FCamouflageSkillExperienceAwards BasicSkillExperienceAwards; // 0x158(0x04)
	struct FCamouflageSkillExperienceAwards MediumSkillExperienceAwards; // 0x15c(0x04)
	struct FCamouflageSkillExperienceAwards AdvancedSkillExperienceAwards; // 0x160(0x04)
	struct FCamouflageSkillExperienceAwards AboveAdvancedSkillExperienceAwards; // 0x164(0x04)
	struct FCamouflageSkillParametersPerSkillLevel NoSkillParameters; // 0x168(0x30)
	struct FCamouflageSkillParametersPerSkillLevel BasicSkillParameters; // 0x198(0x30)
	struct FCamouflageSkillParametersPerSkillLevel MediumSkillParameters; // 0x1c8(0x30)
	struct FCamouflageSkillParametersPerSkillLevel AdvancedSkillParameters; // 0x1f8(0x30)
	struct FCamouflageSkillParametersPerSkillLevel AboveAdvancedSkillParameters; // 0x228(0x30)

	float GetHidePenaltyForCharacter(struct AConZCharacter* Character); // Function ConZ.CamouflageSkill.GetHidePenaltyForCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x236c400
};

// Class ConZ.CargoDropContainer
// Size: 0x318 (Inherited: 0x220)
struct ACargoDropContainer : AActor {
	float DelayDuration; // 0x220(0x04)
	float FallDuration; // 0x224(0x04)
	float DetonationTime; // 0x228(0x04)
	float DetonationCountdown; // 0x22c(0x04)
	struct UAkAudioEvent* LandSound; // 0x230(0x08)
	struct UAkAudioEvent* WarningSound; // 0x238(0x08)
	struct UAkAudioEvent* DetonationSound; // 0x240(0x08)
	struct UParticleSystem* DetonationParticles; // 0x248(0x08)
	struct UMatineeCameraShake* CameraShakeClass; // 0x250(0x08)
	struct TArray<struct UItemSpawnerPreset*> MajorSpawnerOptions; // 0x258(0x10)
	struct TArray<struct UItemSpawnerPreset2*> MajorSpawnerPresetOptions; // 0x268(0x10)
	struct TArray<struct FCargoDropSpawnerPreset> MinorSpawnerOptions; // 0x278(0x10)
	struct UAkAudioEvent* UnlockLockersAudioEvent; // 0x288(0x08)
	struct UStaticMeshComponent* _parachuteMesh; // 0x290(0x08)
	struct UParticleSystemComponent* _flareParticles; // 0x298(0x08)
	struct UParticleSystemComponent* _dustParticles; // 0x2a0(0x08)
	struct UKillBoxTimerWidget* _timerWidget; // 0x2a8(0x08)
	struct UDiegeticLockState* _lockStateWidget; // 0x2b0(0x08)
	char pad_2B8[0x10]; // 0x2b8(0x10)
	struct FVector _endLocation; // 0x2c8(0x0c)
	struct FRotator _rotation; // 0x2d4(0x0c)
	bool _landed; // 0x2e0(0x01)
	char pad_2E1[0x3]; // 0x2e1(0x03)
	float _fallingSpeed; // 0x2e4(0x04)
	int32_t _timeRemaining; // 0x2e8(0x04)
	bool _flareParticlesEnabled; // 0x2ec(0x01)
	char pad_2ED[0x3]; // 0x2ed(0x03)
	struct TArray<struct UStaticMeshComponent*> _cargoLockers; // 0x2f0(0x10)
	char pad_300[0x18]; // 0x300(0x18)

	void SetTimerWidget(struct UKillBoxTimerWidget* timerWidget); // Function ConZ.CargoDropContainer.SetTimerWidget // (Final|Native|Private|BlueprintCallable) // @ game+0x236cde0
	void SetLockStateWidget(struct UDiegeticLockState* Value); // Function ConZ.CargoDropContainer.SetLockStateWidget // (Final|Native|Private|BlueprintCallable) // @ game+0x236cd50
	void OnWarning(); // Function ConZ.CargoDropContainer.OnWarning // (Event|Public|BlueprintEvent) // @ game+0x297fc00
	void OnTouchdown(); // Function ConZ.CargoDropContainer.OnTouchdown // (Event|Public|BlueprintEvent) // @ game+0x297fc00
	void OnRep_FlareParticlesEnabled(); // Function ConZ.CargoDropContainer.OnRep_FlareParticlesEnabled // (Final|Native|Private) // @ game+0x236c9c0
	void OnDetonate(); // Function ConZ.CargoDropContainer.OnDetonate // (Event|Public|BlueprintEvent) // @ game+0x297fc00
	void Multicast_StartDetonation(); // Function ConZ.CargoDropContainer.Multicast_StartDetonation // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1537780
	void Multicast_Detonate(); // Function ConZ.CargoDropContainer.Multicast_Detonate // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x236c4d0
	void DropToLocation(struct FVector EndLocation, float fallingTime); // Function ConZ.CargoDropContainer.DropToLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x236c320
	void AddCargoLocker(struct UStaticMeshComponent* cargoLocker); // Function ConZ.CargoDropContainer.AddCargoLocker // (Final|Native|Private|BlueprintCallable) // @ game+0x236c250
};

// Class ConZ.WorldEvent
// Size: 0x248 (Inherited: 0x220)
struct AWorldEvent : AActor {
	struct FVector Location; // 0x220(0x0c)
	float Radius; // 0x22c(0x04)
	struct UTexture* IconTexture; // 0x230(0x08)
	char pad_238[0x10]; // 0x238(0x10)

	void StartEvent(); // Function ConZ.WorldEvent.StartEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x2547470
};

// Class ConZ.CargoDropEvent
// Size: 0x390 (Inherited: 0x248)
struct ACargoDropEvent : AWorldEvent {
	struct TArray<struct ACargoDropContainer*> CargoDropClasses; // 0x248(0x10)
	char pad_258[0x58]; // 0x258(0x58)
	struct TMap<struct UEncounterBase*, struct FCargoDropEncounterData> _encounterClasses; // 0x2b0(0x50)
	struct FGameplayTag _zombieEncounterTag; // 0x300(0x08)
	struct FGameplayTag _dropshipEncounterTag; // 0x308(0x08)
	char pad_310[0x80]; // 0x310(0x80)

	void Multicast_DisplayNotification(struct FString SectorName, float FallDuration); // Function ConZ.CargoDropEvent.Multicast_DisplayNotification // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x236c4f0
};

// Class ConZ.Carousel
// Size: 0x1df8 (Inherited: 0x268)
struct UCarousel : UUserWidget {
	char pad_268[0x20]; // 0x268(0x20)
	struct UTextBlock* _selectionDisplay; // 0x288(0x08)
	struct UButton* _leftArrow; // 0x290(0x08)
	struct UButton* _rightArrow; // 0x298(0x08)
	struct TArray<struct FText> _carouselValues; // 0x2a0(0x10)
	bool _canWrap; // 0x2b0(0x01)
	char pad_2B1[0x7]; // 0x2b1(0x07)
	struct FCarouselStyle _selectedAndFocusedCarouselStyle; // 0x2b8(0x570)
	struct FCarouselStyle _selectedAndUnfocusedCarouselStyle; // 0x828(0x570)
	struct FCarouselStyle _unselectedCarouselStyle; // 0xd98(0x570)
	struct FCarouselStyle _highlightedCarouselStyle; // 0x1308(0x570)
	struct FCarouselStyle _disabledCarouselStyle; // 0x1878(0x570)
	bool _controlWithMouseWheel; // 0x1de8(0x01)
	bool _controlWithKeyboard; // 0x1de9(0x01)
	char pad_1DEA[0xe]; // 0x1dea(0x0e)

	void ClickRight(); // Function ConZ.Carousel.ClickRight // (Final|Native|Private) // @ game+0x236c300
	void ClickLeft(); // Function ConZ.Carousel.ClickLeft // (Final|Native|Private) // @ game+0x236c2e0
};

// Class ConZ.CarouselWithLabel
// Size: 0x2360 (Inherited: 0x1df8)
struct UCarouselWithLabel : UCarousel {
	char pad_1DF8[0x18]; // 0x1df8(0x18)
	struct UTextBlock* _name; // 0x1e10(0x08)
	struct UImage* _focusBackgroundImage; // 0x1e18(0x08)
	struct FText _label; // 0x1e20(0x18)
	struct FCarouselWithLabelStyle _selectedAndFocusedCWLStyle; // 0x1e38(0x108)
	struct FCarouselWithLabelStyle _selectedAndUnfocusedCWLStyle; // 0x1f40(0x108)
	struct FCarouselWithLabelStyle _unselectedCWLStyle; // 0x2048(0x108)
	struct FCarouselWithLabelStyle _highlightedCWLStyle; // 0x2150(0x108)
	struct FCarouselWithLabelStyle _disabledCWLStyle; // 0x2258(0x108)
};

// Class ConZ.CCGameUpgradeConditionDisplayWidget
// Size: 0x2d0 (Inherited: 0x268)
struct UCCGameUpgradeConditionDisplayWidget : UUserWidget {
	struct UBorder* _border; // 0x268(0x08)
	struct UTextBlock* _text; // 0x270(0x08)
	struct TMap<enum class EDeluxeVersion, struct FText> _requirementTextPerGameUpgrade; // 0x278(0x50)
	char pad_2C8[0x8]; // 0x2c8(0x08)
};

// Class ConZ.TabMenuPanel
// Size: 0x268 (Inherited: 0x268)
struct UTabMenuPanel : UUserWidget {
};

// Class ConZ.CentralBuildingPanel
// Size: 0x270 (Inherited: 0x268)
struct UCentralBuildingPanel : UTabMenuPanel {
	struct UPlacedPlaceableWidget* _placedPlaceableWidget; // 0x268(0x08)
};

// Class ConZ.WeaponItem
// Size: 0x9b0 (Inherited: 0x9b0)
struct AWeaponItem : AItem {
	uint32_t MaxRange; // 0x9a8(0x04)
	uint32_t ROF; // 0x9ac(0x04)
};

// Class ConZ.Chainsaw
// Size: 0x1e20 (Inherited: 0x9b0)
struct AChainsaw : AWeaponItem {
	char pad_9B0[0x8]; // 0x9b0(0x08)
	struct USkeletalMeshComponent* SkeletalMesh; // 0x9b8(0x08)
	struct FCharacterAndItemAnimation AnimationsStartEngine; // 0x9c0(0x10)
	struct FCharacterAndItemAnimation AnimationsCheckFuelStatus; // 0x9d0(0x10)
	struct UBaseItemTag* ChoppingToolItemTag; // 0x9e0(0x08)
	struct UAkAudioEvent* TurnOnAudioEvent; // 0x9e8(0x08)
	struct UAkAudioEvent* TurnOffAudioEvent; // 0x9f0(0x08)
	struct UGameResourceType* _fuelType; // 0x9f8(0x08)
	struct FGameplayTagContainer _inFuelingSocketTypes; // 0xa00(0x20)
	float _maxFuelAmount; // 0xa20(0x04)
	float _initialFuelAmount; // 0xa24(0x04)
	float _fuelUsagePerHour; // 0xa28(0x04)
	float _fuelUsagePerHourMultiplierWhenActive; // 0xa2c(0x04)
	float _fuelFillingDurationPerAmountFilled; // 0xa30(0x04)
	float _fuelFillingExperiencePerAmount; // 0xa34(0x04)
	struct UAnimMontage* _fuelFillingMontage; // 0xa38(0x08)
	struct UMeleeSkillAnimationsPreset* _meleeSkillAnimationsPresetWhenTurnedOff; // 0xa40(0x08)
	struct UMeleeSkillAnimationsPreset* _meleeSkillAnimationsPresetWhenTurnedOn; // 0xa48(0x08)
	struct UAkAudioEvent* _fuelStartFillingAudioEvent; // 0xa50(0x08)
	struct UAkAudioEvent* _fuelStopFillingAudioEvent; // 0xa58(0x08)
	float _noiseLoudnessWhileStarting; // 0xa60(0x04)
	float _noiseLoudnessWhileRunning; // 0xa64(0x04)
	float _noiseLoudnessUpdateFrequencyPerHour; // 0xa68(0x04)
	float _currentFuelAmount; // 0xa6c(0x04)
	bool _turnedOn; // 0xa70(0x01)
	char pad_A71[0x13af]; // 0xa71(0x13af)

	void SetUseFuelUsagePerHourMultiplierWhenActive(bool Value); // Function ConZ.Chainsaw.SetUseFuelUsagePerHourMultiplierWhenActive // (Final|Native|Public|BlueprintCallable) // @ game+0x236ce70
	void Server_SetUseFuelUsagePerHourMultiplierWhenActive(bool Value); // Function ConZ.Chainsaw.Server_SetUseFuelUsagePerHourMultiplierWhenActive // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x236ccc0
	void Server_SetTurnedOn(bool Value); // Function ConZ.Chainsaw.Server_SetTurnedOn // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x236cc30
	void OnRep_TurnedOn(bool oldValue); // Function ConZ.Chainsaw.OnRep_TurnedOn // (Final|Native|Private) // @ game+0x236c9e0
	bool GetUseFuelUsagePerHourMultiplierWhenActive(); // Function ConZ.Chainsaw.GetUseFuelUsagePerHourMultiplierWhenActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x236c4a0
};

// Class ConZ.ChainsawAnimInstance
// Size: 0x2e0 (Inherited: 0x2d0)
struct UChainsawAnimInstance : UItemAnimInstance {
	bool _isTurnedOn; // 0x2d0(0x01)
	char pad_2D1[0xf]; // 0x2d1(0x0f)
};

// Class ConZ.Weapon
// Size: 0x3010 (Inherited: 0x9b0)
struct AWeapon : AWeaponItem {
	struct FMulticastInlineDelegate AttachmentAdded; // 0x9b0(0x10)
	struct FMulticastInlineDelegate AttachmentRemoved; // 0x9c0(0x10)
	char pad_9D0[0x48]; // 0x9d0(0x48)
	struct USkeletalMeshComponent* SkeletalMesh; // 0xa18(0x08)
	enum class EWeaponFiringStateType WeaponFiringStateType; // 0xa20(0x01)
	char pad_A21[0x7]; // 0xa21(0x07)
	struct UWeaponStateFiring* TempWeaponStateFiringAutomatic; // 0xa28(0x08)
	struct UWeaponStateFiring* TempWeaponStateFiringSemiAutomatic; // 0xa30(0x08)
	struct UWeaponStateFiring* TempWeaponStateFiringManual; // 0xa38(0x08)
	struct UWeaponStateFiring* TempWeaponStateFiringBurst; // 0xa40(0x08)
	struct UWeaponStateActiveManualFiring* TempWeaponStateActiveManualFiring; // 0xa48(0x08)
	struct UWeaponStateFiring* FiringState; // 0xa50(0x08)
	struct TArray<enum class EWeaponFiringMode> SupportedFiringModes; // 0xa58(0x10)
	struct TArray<struct UStaticMeshComponent*> CartridgeMeshComponents; // 0xa68(0x10)
	struct TArray<struct UWeaponActionReloadSequence*> ReloadActionSequenceClasses; // 0xa78(0x10)
	struct TArray<struct UWeaponActionUnloadAmmoSequence*> UnloadAmmoActionSequenceClasses; // 0xa88(0x10)
	struct TArray<struct UWeaponActionCheckAmmoSequence*> CheckAmmoActionSequenceClasses; // 0xa98(0x10)
	struct TArray<struct UWeaponActionReloadSequence*> ReloadActionSequences; // 0xaa8(0x10)
	struct TArray<struct UWeaponActionClearMalfunctionSequence*> ClearMalfunctionActionSequences; // 0xab8(0x10)
	struct TArray<struct UWeaponActionUnloadAmmoSequence*> UnloadAmmoActionSequences; // 0xac8(0x10)
	struct TArray<struct UWeaponActionCheckAmmoSequence*> CheckAmmoActionSequences; // 0xad8(0x10)
	struct FGameplayTagContainer AmmunitionTags; // 0xae8(0x20)
	struct AAmmunitionItem* DefaultAmmunitionItemClass; // 0xb08(0x08)
	int32_t RequiredAmmoForShot; // 0xb10(0x04)
	int32_t MaxLoadedAmmo; // 0xb14(0x04)
	int32_t EventMaxAmmo; // 0xb18(0x04)
	int32_t InitialAmmo; // 0xb1c(0x04)
	int32_t InternalMagazineCapacity; // 0xb20(0x04)
	bool UseChamberAsInternalMagazine; // 0xb24(0x01)
	char pad_B25[0x3]; // 0xb25(0x03)
	int32_t BurstShotsCount; // 0xb28(0x04)
	bool IgnoreProceduralDownTheSightFiringAnimation; // 0xb2c(0x01)
	char pad_B2D[0x3]; // 0xb2d(0x03)
	struct UAnimMontage* FireAnimation; // 0xb30(0x08)
	struct UAnimMontage* FireAnimationLastRound; // 0xb38(0x08)
	struct UAnimMontage* FireAnimationBody; // 0xb40(0x08)
	struct UAnimMontage* FirstPersonFireAnimationBody; // 0xb48(0x08)
	struct UAnimMontage* FireAutomaticAnimationBody; // 0xb50(0x08)
	struct FBodyWeaponAnimation BodyWeaponAnimationChamber; // 0xb58(0x10)
	struct UAnimMontage* CheckFiringModeAnimationBody; // 0xb68(0x08)
	struct UAnimMontage* ChangeFiringModeAnimationBody; // 0xb70(0x08)
	struct TMap<struct AWeaponAttachment*, struct FWeaponAttachmentAnimations> AttachmentsAnimations; // 0xb78(0x50)
	struct FName MuzzleSocketName; // 0xbc8(0x08)
	struct FName GripCorrectionSocketName; // 0xbd0(0x08)
	struct FName AimingDownTheSightsCenterSocketName; // 0xbd8(0x08)
	struct FName EjectCasingSocketName; // 0xbe0(0x08)
	bool IgnoreSupportingHandIK; // 0xbe8(0x01)
	char pad_BE9[0x3]; // 0xbe9(0x03)
	struct FName SupportingHandIKSocketName; // 0xbec(0x08)
	struct FVector SupportingHandIKLocation; // 0xbf4(0x0c)
	struct FVector AimingDownTheSightsLocationOffset; // 0xc00(0x0c)
	char pad_C0C[0x4]; // 0xc0c(0x04)
	struct FTransform HolsteredOnPrisonerLeftOffset; // 0xc10(0x30)
	struct FTransform HolsteredOnPrisonerRightOffset; // 0xc40(0x30)
	bool UseWeaponFOVWhileScoping; // 0xc70(0x01)
	char pad_C71[0x3]; // 0xc71(0x03)
	float WeaponFOVWhileScoping; // 0xc74(0x04)
	struct FVector WeaponCameraOffsetWhileScoping; // 0xc78(0x0c)
	char pad_C84[0x4]; // 0xc84(0x04)
	struct FRuntimeFloatCurve OffsetPerAspectRatioWhileScoping; // 0xc88(0x88)
	bool IgnoreZeroRangeChange; // 0xd10(0x01)
	char pad_D11[0x3]; // 0xd11(0x03)
	int32_t ZeroRange; // 0xd14(0x04)
	int32_t ZeroRangeStep; // 0xd18(0x04)
	int32_t ZeroRangeMax; // 0xd1c(0x04)
	struct UProjectileImpactEffects* InstantHitImpactEffects; // 0xd20(0x08)
	float FieldOfView; // 0xd28(0x04)
	float DepthOfFieldFocalDistance; // 0xd2c(0x04)
	float DepthOfFieldFstop; // 0xd30(0x04)
	float ObstaclesDetectionOffset; // 0xd34(0x04)
	bool UseFiringModeBoneRotation; // 0xd38(0x01)
	char pad_D39[0x3]; // 0xd39(0x03)
	struct FRotator FiringModeBoneRotations[0x3]; // 0xd3c(0x24)
	struct FPostProcessSettings PostProcessSettings; // 0xd60(0x560)
	struct UAnimSequenceBase* RelaxedGripCorrectionAnimationPose[0x3]; // 0x12c0(0x18)
	struct UAnimSequenceBase* AimingHipAnimationPose[0x3]; // 0x12d8(0x18)
	struct UAnimSequenceBase* AimingDownTheSightsAnimationPose[0x3]; // 0x12f0(0x18)
	struct UAnimSequenceBase* AimingDownTheSightsStillAnimationPose[0x3]; // 0x1308(0x18)
	struct UAnimSequenceBase* AimingDownTheSightsWalkingAnimationPose[0x3]; // 0x1320(0x18)
	struct UAnimSequenceBase* AimingDownTheSightsLimpingWalkingAnimationPose[0x3]; // 0x1338(0x18)
	struct UBlendSpace* WeaponAimOffsets[0x7]; // 0x1350(0x38)
	struct UBlendSpace1D* AimingDownTheSightsZeroRangeBlendSpace; // 0x1388(0x08)
	enum class EWeaponCategory WeaponCategory; // 0x1390(0x01)
	bool IgnoreAimingSpread; // 0x1391(0x01)
	bool UseCustomWeaponSpreadData; // 0x1392(0x01)
	char pad_1393[0x1]; // 0x1393(0x01)
	struct FWeaponSpreadData WeaponSpreadData; // 0x1394(0x34)
	bool UseCustomWeaponViewKickData; // 0x13c8(0x01)
	char pad_13C9[0x3]; // 0x13c9(0x03)
	struct FWeaponViewKickData WeaponViewKickData; // 0x13cc(0x18)
	float ViewKickMultiplier; // 0x13e4(0x04)
	float MaxRecoilOffset; // 0x13e8(0x04)
	float RecoilRecoverySpeed; // 0x13ec(0x04)
	float MuzzleEffectsScaleDistanceStart; // 0x13f0(0x04)
	float MuzzleEffectsScaleDistanceRange; // 0x13f4(0x04)
	float MuzzleEffectsScaleByDistanceFactor; // 0x13f8(0x04)
	float ChamberBulletDelay; // 0x13fc(0x04)
	bool ChamberBulletAutomatically; // 0x1400(0x01)
	bool ChamberBulletWhenMagazineIsAttached; // 0x1401(0x01)
	char pad_1402[0x2]; // 0x1402(0x02)
	float DamagePerShot; // 0x1404(0x04)
	bool TestWeapon; // 0x1408(0x01)
	char pad_1409[0x7]; // 0x1409(0x07)
	struct TArray<struct FFireAnimationData> WornOutFiringAnimations; // 0x1410(0x10)
	bool CanBeInspectedWhenMalfunctioned; // 0x1420(0x01)
	char pad_1421[0x7]; // 0x1421(0x07)
	struct UAnimMontage* InspectModeAnimation; // 0x1428(0x08)
	bool UseCustomMalfunctionChances; // 0x1430(0x01)
	char pad_1431[0x3]; // 0x1431(0x03)
	struct FWeaponMalfunctionChances MalfunctionChances; // 0x1434(0x38)
	struct FName StovePipeSocketName; // 0x146c(0x08)
	char pad_1474[0x4]; // 0x1474(0x04)
	struct UStaticMesh* StovePipeMesh; // 0x1478(0x08)
	struct FName DoubleFeedSocketName; // 0x1480(0x08)
	struct UStaticMesh* DoubleFeedMesh; // 0x1488(0x08)
	bool ShouldClearInspectModeWhenClearingMalfunction; // 0x1490(0x01)
	char pad_1491[0x7]; // 0x1491(0x07)
	struct TArray<struct UWeaponActionClearMalfunctionSequence*> ClearMalfunctionSequenceClasses; // 0x1498(0x10)
	struct TMap<enum class EWeaponMalfunction, struct FWeaponMalfunctionData> MalfunctionsData; // 0x14a8(0x50)
	float DTSModeLerpDurationIn; // 0x14f8(0x04)
	float DTSModeLerpDurationOut; // 0x14fc(0x04)
	struct UCurveFloat* DownTheSightsModeLerpCurveOverride; // 0x1500(0x08)
	struct UWeaponState* _currentState; // 0x1508(0x08)
	struct UWeaponState* _activeState; // 0x1510(0x08)
	struct UWeaponStateEquipping* _equippingState; // 0x1518(0x08)
	struct UWeaponState* _unequippingStateDefault; // 0x1520(0x08)
	struct UWeaponState* _unequippingState; // 0x1528(0x08)
	struct UWeaponState* _inactiveState; // 0x1530(0x08)
	struct UWeaponState* _chamberBulletState; // 0x1538(0x08)
	struct UWeaponStateReload* _reloadState2; // 0x1540(0x08)
	struct UWeaponStateClearMalfunction* _clearMalfunctionState; // 0x1548(0x08)
	struct UWeaponStateUnloadAmmo* _unloadAmmoState; // 0x1550(0x08)
	struct UWeaponStateCheckAmmo* _checkAmmoState; // 0x1558(0x08)
	enum class EWeaponMuzzleEffectsSpawType _muzzleEffectsSpawnType; // 0x1560(0x01)
	char pad_1561[0x7]; // 0x1561(0x07)
	struct UParticleSystem* _muzzlePS; // 0x1568(0x08)
	struct UParticleSystem* _suppressorMuzzlePS; // 0x1570(0x08)
	struct UParticleSystemComponent* _muzzlePSC; // 0x1578(0x08)
	struct UParticleSystem* _smokeAfterShotFiredPS; // 0x1580(0x08)
	struct UParticleSystemComponent* _smokeAfterShotFiredPSC; // 0x1588(0x08)
	struct UParticleSystem* _ejectCasingPS; // 0x1590(0x08)
	struct UParticleSystem* _ejectLiveRoundPS; // 0x1598(0x08)
	struct UWeaponPaintjobItemComponent* _paintjobComponent; // 0x15a0(0x08)
	struct AActor* _weaponOwner; // 0x15a8(0x08)
	char pad_15B0[0x10]; // 0x15b0(0x10)
	struct TArray<struct FAmmunitionData> _loadedAmmoData; // 0x15c0(0x10)
	char pad_15D0[0x2]; // 0x15d0(0x02)
	bool _shouldOverrideUseMuzzleDirectionForShooting; // 0x15d2(0x01)
	bool _useMuzzleDirectionForShootingOverride; // 0x15d3(0x01)
	struct TWeakObjectPtr<struct AActor> _projectileTargetLocationOverride; // 0x15d4(0x08)
	char pad_15DC[0x80]; // 0x15dc(0x80)
	enum class EWeaponFiringMode _firingMode; // 0x165c(0x01)
	char pad_165D[0x13]; // 0x165d(0x13)
	struct TArray<struct AWeaponAttachment*> _weaponAttachmentsReplicated; // 0x1670(0x10)
	char pad_1680[0x28]; // 0x1680(0x28)
	struct TArray<struct FAmmunitionData> _internalMagazineAmmoData; // 0x16a8(0x10)
	int32_t _usedAmmoCount; // 0x16b8(0x04)
	char pad_16BC[0x1]; // 0x16bc(0x01)
	bool _shouldPlayChamberOpenedIdle; // 0x16bd(0x01)
	char pad_16BE[0x12]; // 0x16be(0x12)
	struct UAkAudioEvent* _fireSingleShotAudioEvent; // 0x16d0(0x08)
	struct UAkAudioEvent* _startAutoFireAudioEvent; // 0x16d8(0x08)
	struct UAkAudioEvent* _stopAutoFireAudioEvent; // 0x16e0(0x08)
	struct UAkAudioEvent* _suppressorFireSingleShotAudioEvent; // 0x16e8(0x08)
	struct UAkAudioEvent* _suppressorStartAutoFireAudioEvent; // 0x16f0(0x08)
	struct UAkAudioEvent* _suppressorStopAutoFireAudioEvent; // 0x16f8(0x08)
	struct UAkAudioEvent* _improvisedSuppressorFireSingleShotAudioEvent; // 0x1700(0x08)
	struct UAkAudioEvent* _improvisedSuppressorStartAutoFireAudioEvent; // 0x1708(0x08)
	struct UAkAudioEvent* _improvisedSuppressorStopAutoFireAudioEvent; // 0x1710(0x08)
	struct UAkAudioEvent* _noAmmoAudioEvent; // 0x1718(0x08)
	struct UAkAudioEvent* _dryFireUncockedAudioEvent; // 0x1720(0x08)
	struct UAkAudioEvent* _zeroRangeClickAudioEvent; // 0x1728(0x08)
	struct UAkAudioEvent* _changeFiringModeAudioEvent; // 0x1730(0x08)
	struct UAkAudioEvent* _onMalfunctionAudioEvent; // 0x1738(0x08)
	struct UAkAudioEvent* _switchADSStateAudioEvent; // 0x1740(0x08)
	struct UAkAudioEvent* _indoorSmallHearingDamageAudioEvent; // 0x1748(0x08)
	struct UAkAudioEvent* _indoorMediumHearingDamageAudioEvent; // 0x1750(0x08)
	struct UAkAudioEvent* _indoorLargeHearingDamageAudioEvent; // 0x1758(0x08)
	struct UAkAudioEvent* _outdoorLargeHearingDamageAudioEvent; // 0x1760(0x08)
	float _makeNoiseLoudness; // 0x1768(0x04)
	char pad_176C[0x10]; // 0x176c(0x10)
	float _staminaDrainMultiplier; // 0x177c(0x04)
	char pad_1780[0xc]; // 0x1780(0x0c)
	enum class EWeaponMalfunction _malfunction; // 0x178c(0x01)
	enum class EWeaponBehaviourMode _behaviourMode; // 0x178d(0x01)
	char pad_178E[0x22]; // 0x178e(0x22)
	struct UObject* _loadedAmmunitionItemClass; // 0x17b0(0x08)
	char pad_17B8[0x8]; // 0x17b8(0x08)
	struct AProjectile* _loadedProjectileClass; // 0x17c0(0x08)
	struct AProjectile* _defaultProjectileClass; // 0x17c8(0x08)
	char pad_17D0[0xc]; // 0x17d0(0x0c)
	float _totalControllerPitchAmountToAdd; // 0x17dc(0x04)
	float _controllerPitchAddTimeFrame; // 0x17e0(0x04)
	char pad_17E4[0x1784]; // 0x17e4(0x1784)
	struct FWeaponStateSyncData _ownerWeaponStateSyncData; // 0x2f68(0x48)
	char pad_2FB0[0x50]; // 0x2fb0(0x50)
	struct UArmedNPCWeaponManual* _armedNPCWeaponManualClass; // 0x3000(0x08)
	char pad_3008[0x8]; // 0x3008(0x08)

	void UpdateReloadData(struct FWeaponReloadData& reloadDataIn, struct FWeaponReloadData& reloadDataOut); // Function ConZ.Weapon.UpdateReloadData // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2531f00
	void UpdateAmmunitionMeshes(struct TArray<int32_t>& ammoIndices, bool showReversed); // Function ConZ.Weapon.UpdateAmmunitionMeshes // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2531e00
	void UpdateActiveSightAndScopeComponents(); // Function ConZ.Weapon.UpdateActiveSightAndScopeComponents // (Final|Native|Public|BlueprintCallable) // @ game+0x2531de0
	void Unequip(); // Function ConZ.Weapon.Unequip // (Final|Native|Public|BlueprintCallable) // @ game+0x2531dc0
	void StopFiringEffects(); // Function ConZ.Weapon.StopFiringEffects // (Final|Native|Public|BlueprintCallable) // @ game+0x2531da0
	void StopFire(); // Function ConZ.Weapon.StopFire // (Final|Native|Public|BlueprintCallable) // @ game+0x2531d80
	void StartFire(); // Function ConZ.Weapon.StartFire // (Final|Native|Public|BlueprintCallable) // @ game+0x2531d60
	bool ShouldPlayChamberOpenedIdle(); // Function ConZ.Weapon.ShouldPlayChamberOpenedIdle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2531d30
	bool ShouldPlayCasingEjectedSound(); // Function ConZ.Weapon.ShouldPlayCasingEjectedSound // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2531d00
	bool ShouldClearMalfunctionOnEvent(enum class EWeaponMalfunction malfunction, enum class EWeaponMalfunctionEvent malfunctionEvent); // Function ConZ.Weapon.ShouldClearMalfunctionOnEvent // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2531c20
	void SetZeroRangeOnServer(int32_t ZeroRange); // Function ConZ.Weapon.SetZeroRangeOnServer // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2531b90
	void SetUseWeaponAnimationPose(bool Value); // Function ConZ.Weapon.SetUseWeaponAnimationPose // (Final|Native|Public|BlueprintCallable) // @ game+0x2531b00
	void SetUseMuzzleDirectionForShooting(bool Value); // Function ConZ.Weapon.SetUseMuzzleDirectionForShooting // (Final|Native|Public|BlueprintCallable) // @ game+0x2531a70
	void SetShouldPlayChamberOpenedIdle(bool Value); // Function ConZ.Weapon.SetShouldPlayChamberOpenedIdle // (Final|Native|Public|BlueprintCallable) // @ game+0x25319e0
	void SetOverrideUseWeaponAnimationPose(bool Value); // Function ConZ.Weapon.SetOverrideUseWeaponAnimationPose // (Final|Native|Public|BlueprintCallable) // @ game+0x2531950
	void SetMalfunction(enum class EWeaponMalfunction Type); // Function ConZ.Weapon.SetMalfunction // (Final|Native|Public|BlueprintCallable) // @ game+0x25318d0
	void SetMakeNoiseLoudness(bool Value); // Function ConZ.Weapon.SetMakeNoiseLoudness // (Final|Native|Public|BlueprintCallable) // @ game+0x2531840
	void SetLoadedProjectileClass(struct AProjectile* projectileClass); // Function ConZ.Weapon.SetLoadedProjectileClass // (Final|Native|Public|BlueprintCallable) // @ game+0x25317b0
	void SetIsScopingAllowed(bool Value); // Function ConZ.Weapon.SetIsScopingAllowed // (Final|Native|Public|BlueprintCallable) // @ game+0x2531720
	void SetIsChambering(bool Value); // Function ConZ.Weapon.SetIsChambering // (Final|Native|Public|BlueprintCallable) // @ game+0x2531690
	void SetFiringModeOnServer(enum class EWeaponFiringMode Value); // Function ConZ.Weapon.SetFiringModeOnServer // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2531610
	void SetFiringMode(enum class EWeaponFiringMode Value); // Function ConZ.Weapon.SetFiringMode // (Final|Native|Public|BlueprintCallable) // @ game+0x2531590
	void Server_SwapAttachments(struct AWeaponAttachment* oldAttachment, struct AWeaponAttachment* newAttachment); // Function ConZ.Weapon.Server_SwapAttachments // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x25314c0
	void Server_StopFiringEffects(); // Function ConZ.Weapon.Server_StopFiringEffects // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x23dc600
	void Server_StopChamberEffects(); // Function ConZ.Weapon.Server_StopChamberEffects // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x25314a0
	void Server_SetMalfunction(enum class EWeaponMalfunction Type); // Function ConZ.Weapon.Server_SetMalfunction // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2531420
	void Server_SetBehaviourMode(enum class EWeaponBehaviourMode mode); // Function ConZ.Weapon.Server_SetBehaviourMode // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x25313a0
	void Server_RemoveCartridgeFromWeapon(); // Function ConZ.Weapon.Server_RemoveCartridgeFromWeapon // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2531380
	void Server_PlayFiringEffects(bool isLastShot); // Function ConZ.Weapon.Server_PlayFiringEffects // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x25312f0
	void Server_PlayDryFireSound(); // Function ConZ.Weapon.Server_PlayDryFireSound // (Final|Net|Native|Event|Private|NetServer) // @ game+0x237a360
	void Server_PlayChamberEffects(); // Function ConZ.Weapon.Server_PlayChamberEffects // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2347110
	void Server_OnChamberOpenedClosed(); // Function ConZ.Weapon.Server_OnChamberOpenedClosed // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x25312d0
	void Server_OnChamberOpened(); // Function ConZ.Weapon.Server_OnChamberOpened // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x25312b0
	void Server_OnChamberClosed(); // Function ConZ.Weapon.Server_OnChamberClosed // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2531290
	void Server_InsertCartridgeIntoWeapon(struct AAmmunitionItem* ammo, struct FAmmunitionData AmmunitionData); // Function ConZ.Weapon.Server_InsertCartridgeIntoWeapon // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2531190
	void Server_FireShotProjectile(struct FFireShotProjectileData Data, struct FFireShotDescription desc); // Function ConZ.Weapon.Server_FireShotProjectile // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2531090
	void Server_DropAttachment(struct AWeaponAttachment* Attachment); // Function ConZ.Weapon.Server_DropAttachment // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2531000
	void Server_CancelFiringEffects(); // Function ConZ.Weapon.Server_CancelFiringEffects // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2383ac0
	void ResetZeroRange(); // Function ConZ.Weapon.ResetZeroRange // (Final|Native|Public|BlueprintCallable) // @ game+0x2530fe0
	void RequestClearMalfunction(enum class EWeaponMalfunction malfunction); // Function ConZ.Weapon.RequestClearMalfunction // (Final|Native|Public|BlueprintCallable) // @ game+0x2530f60
	void RemoveAttachmentOnServer(struct AWeaponAttachment* Attachment); // Function ConZ.Weapon.RemoveAttachmentOnServer // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2530ed0
	void RemoveAttachmentLocal(struct AWeaponAttachment* Attachment); // Function ConZ.Weapon.RemoveAttachmentLocal // (Final|Native|Private|BlueprintCallable) // @ game+0x2530e40
	void RemoveAttachment(struct AWeaponAttachment* Attachment); // Function ConZ.Weapon.RemoveAttachment // (Final|Native|Public|BlueprintCallable) // @ game+0x2530db0
	void RemoveAmmo(int32_t Amount); // Function ConZ.Weapon.RemoveAmmo // (Final|Native|Public|BlueprintCallable) // @ game+0x2530d20
	void PlayFiringEffects(bool isLastShot); // Function ConZ.Weapon.PlayFiringEffects // (Native|Public|BlueprintCallable) // @ game+0x2530c90
	void OnWeaponActionAnimNotify(enum class EWeaponActionNotifyType notifyType); // Function ConZ.Weapon.OnWeaponActionAnimNotify // (Native|Event|Public|BlueprintEvent) // @ game+0x2530c10
	void OnStaminaDrained(); // Function ConZ.Weapon.OnStaminaDrained // (Native|Event|Public|BlueprintEvent) // @ game+0x2530bf0
	void OnShotFired(bool isLastShot); // Function ConZ.Weapon.OnShotFired // (Native|Event|Public|BlueprintEvent) // @ game+0x2530b60
	void OnRep_WeaponAttachmentsReplicated(); // Function ConZ.Weapon.OnRep_WeaponAttachmentsReplicated // (Final|Native|Private) // @ game+0x2530b40
	void OnRep_OwnerWeaponStateSyncData(); // Function ConZ.Weapon.OnRep_OwnerWeaponStateSyncData // (Final|Native|Private) // @ game+0x2530b20
	void OnRep_Malfunction(); // Function ConZ.Weapon.OnRep_Malfunction // (Final|Native|Private) // @ game+0x2530b00
	void OnRep_FireShotCounterEffectsSync(); // Function ConZ.Weapon.OnRep_FireShotCounterEffectsSync // (Native|Public) // @ game+0x2530ae0
	void OnRep_BehaviourMode(); // Function ConZ.Weapon.OnRep_BehaviourMode // (Final|Native|Private) // @ game+0x2530ac0
	void OnChamberOpened(); // Function ConZ.Weapon.OnChamberOpened // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2530a10
	void OnChamberClosed(); // Function ConZ.Weapon.OnChamberClosed // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x246feb0
	void OnAttachmentRemoved(struct AWeaponAttachment* Attachment); // Function ConZ.Weapon.OnAttachmentRemoved // (Native|Event|Protected|BlueprintEvent) // @ game+0x2530980
	void OnAttachmentAdded(struct AWeaponAttachment* Attachment); // Function ConZ.Weapon.OnAttachmentAdded // (Native|Event|Protected|BlueprintEvent) // @ game+0x25308f0
	void NotifyMissOnServer(struct FVector_NetQuantizeNormal shootDirection, int32_t randomSeed, float reticleSpread); // Function ConZ.Weapon.NotifyMissOnServer // (Final|Net|Native|Event|Private|NetServer) // @ game+0x25307c0
	void NotifyHitOnServer(struct FHitResult HitResult, struct FVector_NetQuantizeNormal shootDirection, int32_t randomSeed, float reticleSpread); // Function ConZ.Weapon.NotifyHitOnServer // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x2530620
	void NetMulticast_StopFiringEffects(); // Function ConZ.Weapon.NetMulticast_StopFiringEffects // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x23dbf20
	void NetMulticast_StopChamberEffects(); // Function ConZ.Weapon.NetMulticast_StopChamberEffects // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x246f4b0
	void NetMulticast_PlayFiringEffects(bool isLastShot); // Function ConZ.Weapon.NetMulticast_PlayFiringEffects // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2530590
	void NetMulticast_PlayDryFireSound(); // Function ConZ.Weapon.NetMulticast_PlayDryFireSound // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x23dc2d0
	void NetMulticast_PlayChamberEffects(); // Function ConZ.Weapon.NetMulticast_PlayChamberEffects // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2530570
	void NetMulticast_CancelFiringEffects(); // Function ConZ.Weapon.NetMulticast_CancelFiringEffects // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2383ae0
	bool IsMalfunctionSupported(enum class EWeaponMalfunction malfunction); // Function ConZ.Weapon.IsMalfunctionSupported // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x25304b0
	bool IsInGameEvent(); // Function ConZ.Weapon.IsInGameEvent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530480
	bool IsFiring(); // Function ConZ.Weapon.IsFiring // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530450
	bool IsChamberOpened(); // Function ConZ.Weapon.IsChamberOpened // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530420
	bool IsAmmoInMagazineCompatible(struct AWeaponAttachmentMagazine* magazine); // Function ConZ.Weapon.IsAmmoInMagazineCompatible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530350
	bool IsAmmoCompatible(struct FGameplayTag& AmmunitionTag); // Function ConZ.Weapon.IsAmmoCompatible // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x25302b0
	void IncrementZeroRange(); // Function ConZ.Weapon.IncrementZeroRange // (Final|Native|Public|BlueprintCallable) // @ game+0x2530290
	bool HasEnoughAmmo(); // Function ConZ.Weapon.HasEnoughAmmo // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530260
	bool HasAmmoToUnload(); // Function ConZ.Weapon.HasAmmoToUnload // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x2530230
	int32_t GetZeroRange(); // Function ConZ.Weapon.GetZeroRange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530200
	struct APrisoner* GetWeaponOwningPrisoner(); // Function ConZ.Weapon.GetWeaponOwningPrisoner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x25301d0
	struct AConZCharacter* GetWeaponOwningCharacter(); // Function ConZ.Weapon.GetWeaponOwningCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x25301a0
	struct AActor* GetWeaponOwner(); // Function ConZ.Weapon.GetWeaponOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530170
	bool GetUseWeaponAnimationPose(); // Function ConZ.Weapon.GetUseWeaponAnimationPose // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530110
	bool GetUseMuzzleDirectionForShooting(); // Function ConZ.Weapon.GetUseMuzzleDirectionForShooting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x25300e0
	int32_t GetUsedAmmoCount(); // Function ConZ.Weapon.GetUsedAmmoCount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530140
	enum class EWeaponType GetType(); // Function ConZ.Weapon.GetType // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x25300b0
	float GetSpread(); // Function ConZ.Weapon.GetSpread // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530040
	float GetShakiness(); // Function ConZ.Weapon.GetShakiness // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2530000
	struct UWeaponActionReloadSequence* GetReloadActionSequenceForData(struct FWeaponReloadData& reloadData); // Function ConZ.Weapon.GetReloadActionSequenceForData // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x252ff40
	struct URangedWeaponsSkill* GetRangedWeaponsSkill(); // Function ConZ.Weapon.GetRangedWeaponsSkill // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x252ff10
	float GetProbabilityForMalfunction(enum class EWeaponMalfunction malfunction, float normalizedHealth); // Function ConZ.Weapon.GetProbabilityForMalfunction // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x252fe30
	bool GetOverrideUseWeaponAnimationPose(); // Function ConZ.Weapon.GetOverrideUseWeaponAnimationPose // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x252fe00
	struct FVector GetMuzzleLocation(); // Function ConZ.Weapon.GetMuzzleLocation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x252fdc0
	struct FVector GetMuzzleDirection(); // Function ConZ.Weapon.GetMuzzleDirection // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x252fd80
	int32_t GetMaxAmmoCount(); // Function ConZ.Weapon.GetMaxAmmoCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x252fd50
