// BlueprintGeneratedClass Team_01_5_Players_Equipment_Set.Team_01_5_Players_Equipment_Set_C
// Size: 0x4c8 (Inherited: 0x238)
struct ATeam_01_5_Players_Equipment_Set_C : ADropZoneEquipmentTable {
	struct USceneComponent* Item_Bandage_01_T5; // 0x238(0x08)
	struct USceneComponent* Item_Bandage_01_T4; // 0x240(0x08)
	struct USceneComponent* Item_Bandage_01_T3; // 0x248(0x08)
	struct USceneComponent* Item_Bandage_01_T2; // 0x250(0x08)
	struct USceneComponent* Item_Bandage_01_T1; // 0x258(0x08)
	struct USceneComponent* Item_15_Dragunov_Scope_01_T5; // 0x260(0x08)
	struct USceneComponent* Item_14_Dragunov_Rail_01_T4; // 0x268(0x08)
	struct USceneComponent* Item_13_Backpack_01_T5; // 0x270(0x08)
	struct USceneComponent* Item_12_Pants_01_T5; // 0x278(0x08)
	struct USceneComponent* Item_11_Jacket_01_T5; // 0x280(0x08)
	struct USceneComponent* Item_10_SmokeGrenade_01_T5; // 0x288(0x08)
	struct USceneComponent* Item_07_HandGenade_03_T5; // 0x290(0x08)
	struct USceneComponent* Item_07_HandGenade_02_T5; // 0x298(0x08)
	struct USceneComponent* Item_07_HandGenade_01_T5; // 0x2a0(0x08)
	struct USceneComponent* Item_06_FlashGrenade_01_T5; // 0x2a8(0x08)
	struct USceneComponent* Item_05_Boots_01_T5; // 0x2b0(0x08)
	struct USceneComponent* Item_04_Helmet_01_T5; // 0x2b8(0x08)
	struct USceneComponent* Item_03_Beretta_01_T5; // 0x2c0(0x08)
	struct USceneComponent* Item_02_Dragunov_01_T5; // 0x2c8(0x08)
	struct USceneComponent* Item_01_NightVision_T5; // 0x2d0(0x08)
	struct USceneComponent* Item_02_AK_47_Scope_01_T4; // 0x2d8(0x08)
	struct USceneComponent* Item_02_AK_47_Rail_01_T4; // 0x2e0(0x08)
	struct USceneComponent* Item_13_Backpack_01_T4; // 0x2e8(0x08)
	struct USceneComponent* Item_12_Pants_01_T4; // 0x2f0(0x08)
	struct USceneComponent* Item_11_Jacket_01_T4; // 0x2f8(0x08)
	struct USceneComponent* Item_10_SmokeGrenade_01_T4; // 0x300(0x08)
	struct USceneComponent* Item_07_HandGenade_03_T4; // 0x308(0x08)
	struct USceneComponent* Item_07_HandGenade_02_T4; // 0x310(0x08)
	struct USceneComponent* Item_07_HandGenade_01_T4; // 0x318(0x08)
	struct USceneComponent* Item_06_FlashGrenade_01_T4; // 0x320(0x08)
	struct USceneComponent* Item_05_Boots_01_T4; // 0x328(0x08)
	struct USceneComponent* Item_04_Helmet_01_T4; // 0x330(0x08)
	struct USceneComponent* Item_03_Beretta_01_T4; // 0x338(0x08)
	struct USceneComponent* Item_02_AK_47_01_T4; // 0x340(0x08)
	struct USceneComponent* Item_01_NightVision_T4; // 0x348(0x08)
	struct USceneComponent* Item_13_Backpack_01_T3; // 0x350(0x08)
	struct USceneComponent* Item_12_Pants_01_T3; // 0x358(0x08)
	struct USceneComponent* Item_11_Jacket_01_T3; // 0x360(0x08)
	struct USceneComponent* Item_10_SmokeGrenade_01_T3; // 0x368(0x08)
	struct USceneComponent* Item_07_HandGenade_03_T3; // 0x370(0x08)
	struct USceneComponent* Item_07_HandGenade_02_T3; // 0x378(0x08)
	struct USceneComponent* Item_07_HandGenade_01_T3; // 0x380(0x08)
	struct USceneComponent* Item_06_FlashGrenade_01_T3; // 0x388(0x08)
	struct USceneComponent* Item_05_Boots_01_T3; // 0x390(0x08)
	struct USceneComponent* Item_04_Helmet_01_T3; // 0x398(0x08)
	struct USceneComponent* Item_03_Beretta_01_T3; // 0x3a0(0x08)
	struct USceneComponent* Item_02_AK_47_01_T3; // 0x3a8(0x08)
	struct USceneComponent* Item_01_NightVision_01_T3; // 0x3b0(0x08)
	struct USceneComponent* Item_13_Backpack_01_T2; // 0x3b8(0x08)
	struct USceneComponent* Item_12_Pants_01_T2; // 0x3c0(0x08)
	struct USceneComponent* Item_11_Jacket_01_T2; // 0x3c8(0x08)
	struct USceneComponent* Item_10_SmokeGrenade_01_T2; // 0x3d0(0x08)
	struct USceneComponent* Item_07_HandGenade_03_T2; // 0x3d8(0x08)
	struct USceneComponent* Item_07_HandGenade_02_T2; // 0x3e0(0x08)
	struct USceneComponent* Item_07_HandGenade_01_T2; // 0x3e8(0x08)
	struct USceneComponent* Item_06_FlashGrenade_01_T2; // 0x3f0(0x08)
	struct USceneComponent* Item_05_Boots_01_T2; // 0x3f8(0x08)
	struct USceneComponent* Item_04_Helmet_01_T2; // 0x400(0x08)
	struct USceneComponent* Item_03_Beretta_01_T2; // 0x408(0x08)
	struct USceneComponent* Item_02_AK_47_01_T2; // 0x410(0x08)
	struct USceneComponent* Item_01_NightVision_01_T2; // 0x418(0x08)
	struct USceneComponent* Item_13_Backpack_01_T1; // 0x420(0x08)
	struct USceneComponent* Item_12_Pants_01_T1; // 0x428(0x08)
	struct USceneComponent* Item_11_Jacket_01_T1; // 0x430(0x08)
	struct USceneComponent* Item_10_SmokeGrenade_01_T1; // 0x438(0x08)
	struct USceneComponent* Item_09_HandGrenade_03_T1; // 0x440(0x08)
	struct USceneComponent* Item_08_HandGrenade_02_T1; // 0x448(0x08)
	struct USceneComponent* Item_07_HandGenade_01_T1; // 0x450(0x08)
	struct USceneComponent* Item_06_FlashGrenade_01_T1; // 0x458(0x08)
	struct USceneComponent* Item_05_Boots_01_T1; // 0x460(0x08)
	struct USceneComponent* Item_04_Helmet_01_T1; // 0x468(0x08)
	struct USceneComponent* Item_03_Beretta_01_T1; // 0x470(0x08)
	struct USceneComponent* Item_02_AK_47_01_T1; // 0x478(0x08)
	struct USceneComponent* Item_01_NightVision_T1; // 0x480(0x08)
	struct UStaticMeshComponent* Desk_03; // 0x488(0x08)
	struct UStaticMeshComponent* Desk_04; // 0x490(0x08)
	struct UStaticMeshComponent* Desk_05; // 0x498(0x08)
	struct UStaticMeshComponent* Desk_02; // 0x4a0(0x08)
	struct UStaticMeshComponent* Desk_01; // 0x4a8(0x08)
	struct USceneComponent* SharedRoot; // 0x4b0(0x08)
	struct TArray<struct AItem*> NewVar_1; // 0x4b8(0x10)
};

