// WidgetBlueprintGeneratedClass UI_FoodTooltipPanelSingleUse.UI_FoodTooltipPanelSingleUse_C
// Size: 0x450 (Inherited: 0x2b8)
struct UUI_FoodTooltipPanelSingleUse_C : UItemTooltipPanel {
	struct UImage* Image_1; // 0x2b8(0x08)
	struct UImage* Image_2; // 0x2c0(0x08)
	struct UImage* Image_3; // 0x2c8(0x08)
	struct UImage* Image_5; // 0x2d0(0x08)
	struct UImage* Image_6; // 0x2d8(0x08)
	struct UImage* Image_7; // 0x2e0(0x08)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement; // 0x2e8(0x08)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_1; // 0x2f0(0x08)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_2; // 0x2f8(0x08)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_3; // 0x300(0x08)
	struct UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_4; // 0x308(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement; // 0x310(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_2; // 0x318(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_1; // 0x320(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_2; // 0x328(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_3; // 0x330(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_4; // 0x338(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_5; // 0x340(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_6; // 0x348(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_7; // 0x350(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_8; // 0x358(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_9; // 0x360(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_10; // 0x368(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_11; // 0x370(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_12; // 0x378(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_13; // 0x380(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_14; // 0x388(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_15; // 0x390(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_16; // 0x398(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_17; // 0x3a0(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_18; // 0x3a8(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_19; // 0x3b0(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_20; // 0x3b8(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_21; // 0x3c0(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_22; // 0x3c8(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_23; // 0x3d0(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_24; // 0x3d8(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_25; // 0x3e0(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_26; // 0x3e8(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_27; // 0x3f0(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_28; // 0x3f8(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_37; // 0x400(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_39; // 0x408(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_40; // 0x410(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_41; // 0x418(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_42; // 0x420(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_43; // 0x428(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_44; // 0x430(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_45; // 0x438(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_46; // 0x440(0x08)
	struct UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_47; // 0x448(0x08)
};

