// WidgetBlueprintGeneratedClass UI_SquadEditor.UI_SquadEditor_C
// Size: 0x3c0 (Inherited: 0x378)
struct UUI_SquadEditor_C : USquadEditor {
	struct UImage* Image; // 0x378(0x08)
	struct UImage* Image_2; // 0x380(0x08)
	struct UImage* Image_4; // 0x388(0x08)
	struct UImage* Image_186; // 0x390(0x08)
	struct UImage* Image_434; // 0x398(0x08)
	struct UImage* Image_786; // 0x3a0(0x08)
	struct URetainerBox* RetainerBox_1; // 0x3a8(0x08)
	struct URetainerBox* RetainerBox_2; // 0x3b0(0x08)
	struct URetainerBox* RetainerBox_3; // 0x3b8(0x08)
};

