// WidgetBlueprintGeneratedClass UI_WeaponOverviewTooltipPanelAbsolute.UI_WeaponOverviewTooltipPanelAbsolute_C
// Size: 0x2f8 (Inherited: 0x2b8)
struct UUI_WeaponOverviewTooltipPanelAbsolute_C : UItemTooltipPanel {
	struct UImage* Image_9; // 0x2b8(0x08)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_1; // 0x2c0(0x08)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_2; // 0x2c8(0x08)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_3; // 0x2d0(0x08)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_4; // 0x2d8(0x08)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_5; // 0x2e0(0x08)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_6; // 0x2e8(0x08)
	struct UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_7; // 0x2f0(0x08)
};

