// AnimBlueprintGeneratedClass ABP_Improvised_Raft_Big.ABP_Improvised_Raft_Big_C
// Size: 0x800 (Inherited: 0x350)
struct UABP_Improvised_Raft_Big_C : UConZBoatAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x358(0x30)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x388(0x18)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x3a0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4a8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4c8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x4e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x5f0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6f8(0x108)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Improvised_Raft_Big.ABP_Improvised_Raft_Big_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Improvised_Raft_Big_AnimGraphNode_ModifyBone_6D2D05C4440ED5DACA9FA8AB7EBE884B(); // Function ABP_Improvised_Raft_Big.ABP_Improvised_Raft_Big_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Improvised_Raft_Big_AnimGraphNode_ModifyBone_6D2D05C4440ED5DACA9FA8AB7EBE884B // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Improvised_Raft_Big_AnimGraphNode_ModifyBone_9573DF9C4B9F24E008A4168D3137BBBE(); // Function ABP_Improvised_Raft_Big.ABP_Improvised_Raft_Big_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Improvised_Raft_Big_AnimGraphNode_ModifyBone_9573DF9C4B9F24E008A4168D3137BBBE // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Improvised_Raft_Big_AnimGraphNode_ModifyBone_2CE0F1434A4E6601B379E28BDBF61C2A(); // Function ABP_Improvised_Raft_Big.ABP_Improvised_Raft_Big_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Improvised_Raft_Big_AnimGraphNode_ModifyBone_2CE0F1434A4E6601B379E28BDBF61C2A // (BlueprintEvent) // @ game+0x297fc00
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Improvised_Raft_Big.ABP_Improvised_Raft_Big_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Improvised_Raft_Big_AnimGraphNode_ModifyBone_C9EC7CA9430BC4C0DC23BD9D959752F3(); // Function ABP_Improvised_Raft_Big.ABP_Improvised_Raft_Big_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Improvised_Raft_Big_AnimGraphNode_ModifyBone_C9EC7CA9430BC4C0DC23BD9D959752F3 // (BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_Improvised_Raft_Big(int32_t EntryPoint); // Function ABP_Improvised_Raft_Big.ABP_Improvised_Raft_Big_C.ExecuteUbergraph_ABP_Improvised_Raft_Big // (Final|UbergraphFunction) // @ game+0x297fc00
};

