#ifndef UE4SS_SDK_ABP_Razor_HPP
#define UE4SS_SDK_ABP_Razor_HPP

class UABP_Razor_C : public URazorAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03A0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03A8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x03D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0450 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0478 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x04A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x04C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x04F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0568 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0590 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x05B8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x0638 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x0668 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x06E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x0718 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x0798 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0818 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x08B8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x0938 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x09B8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x0A68 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0A98 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x0B18 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0B98 (size: 0xA0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x0C38 (size: 0xE8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x0D20 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x0DA0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0E50 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x0E80 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0F00 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0F80 (size: 0xA0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x1020 (size: 0xE8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x1108 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1188 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1238 (size: 0x30)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2;                              // 0x1268 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_1;                              // 0x12E0 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x1358 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x13D0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x1450 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x14D0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1550 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x15D0 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1650 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x16D0 (size: 0xB0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x1780 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1830 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1860 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x1910 (size: 0xA0)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x19B0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x19F8 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x1AB8 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x1C10 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x1C38 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x1C80 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x1DD8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x1E00 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x1E28 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x1EF0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x1F18 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2070 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x2098 (size: 0x158)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x21F0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x2210 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x2318 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x2338 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x23F8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x2420 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2448 (size: 0x158)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x25A0 (size: 0x80)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x2620 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x2728 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2748 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2768 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2790 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x28E8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2930 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x2958 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x29F8 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x2B50 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x2B78 (size: 0x80)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x2BF8 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_ModifyBone_593C233C41C192D6ED606F94F1E5190E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_SequencePlayer_CB27F4D94E79C641BC4745AE10FAC521();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_9AFC080741058DBFA4D743BA995291E9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_9C8C2AFE440BE3229A29C79203BA7949();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_A7F2D0D34AC60C1CE50B0AAD9D810BEC();
    void ExecuteUbergraph_ABP_Razor(int32 EntryPoint);
}; // Size: 0x2C40

#endif
