// AnimBlueprintGeneratedClass ABP_Hunter_85_V2.ABP_Hunter_85_V2_C
// Size: 0xc88 (Inherited: 0x310)
struct UABP_Hunter_85_V2_C : UWeaponAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x318(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x348(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x390(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x3d8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x420(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x468(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x518(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x540(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x568(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x590(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x5d8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x620(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x668(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x718(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x740(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x768(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x790(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x830(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x8d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x950(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x9d0(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xb28(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xbd8(0xb0)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Hunter_85_V2.ABP_Hunter_85_V2_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_Hunter_85_V2(int32_t EntryPoint); // Function ABP_Hunter_85_V2.ABP_Hunter_85_V2_C.ExecuteUbergraph_ABP_Hunter_85_V2 // (Final|UbergraphFunction) // @ game+0x297fc00
};

