#ifndef UE4SS_SDK_ABP_Zombie_HPP
#define UE4SS_SDK_ABP_Zombie_HPP

class UABP_Zombie_C : public UZombieAnimInstance2
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03B0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03B8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x03E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x0410 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x0438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x0460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x0488 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x04B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x04D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x0500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x0528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x0550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x0578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x05A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x05C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x05F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x0618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x0640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x0668 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x0690 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x06B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x06E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x0708 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x0730 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x0758 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x0780 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x07A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x07D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x07F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0820 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0848 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0870 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0898 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x08C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x08E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0910 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0938 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0960 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0988 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x09B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x09D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0A00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0A50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0A78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0AA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x0AC8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x0B48 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x0B78 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x0BF8 (size: 0x30)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_4;                              // 0x0C28 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x0CA0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x0CD0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x0D00 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x0D80 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0DB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x0DD8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x0E58 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0E88 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x0F08 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x0F38 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x0FB8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x0FE8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x1068 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x1098 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x1118 (size: 0x30)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3;                              // 0x1148 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x11C0 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_LocalRefPose;                                     // 0x11F0 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x1208 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x1238 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x12B8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x12E8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x1368 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1398 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x1418 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x1448 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x14C8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x14F8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x1578 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x15A8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1628 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1658 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x16D8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1708 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1788 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x17B8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1838 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x1868 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x1890 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x18B8 (size: 0xC0)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x1978 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x19C0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x19F0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x1AA0 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x1BF8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x1C40 (size: 0x158)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x1D98 (size: 0x190)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2;                              // 0x1F28 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_1;                              // 0x1FA0 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x2018 (size: 0x78)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt;                            // 0x2090 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x2130 (size: 0x158)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2288 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x22A8 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x22C8 (size: 0x158)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x2420 (size: 0xB0)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x24D0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x2518 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x2560 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x25A8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x25D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x25F8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x2620 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2668 (size: 0x158)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x27C0 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2880 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x28A8 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x29B0 (size: 0xA0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x2A50 (size: 0x50)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x2AA0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x2B40 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2BC0 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x2BE8 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2CB0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x2CD8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x2D00 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2E58 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2E80 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x2EA8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x2ED0 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_SequencePlayer_A57A21964499F31F9FCB44A1DB6381E3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_AD5A3DDF432879FDEF571BB07B52814C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_30B00AA24D6DF23CA463BCB32ACA66E3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_611071B74FA9B032A4CF7590EB2006CF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_A170606B427B236C452C42A99787BD2B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_C9F1B08B4365CEB6553A00A04A4DB92C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_A4A8AF444C78BAB8FECB99A97267C798();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_7F4DFC244FDDCC94ABD94BB65C2B954C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_7557AFB543C5BDD63ADF71B4802FF232();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_766CCEAF40C87B65E5F1CFBE7CB98687();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_14C03F714C3DC9449A6ABF81192CF671();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_9420D8E742D3F8061E5488AA72D6DF35();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_B526B7234A50073604DFD2ABEEDEE8EA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_7BF7FC3E42D034079CFC69BCFBD143E0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_25BD018548613B0B5FC69B8704E479D1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_09BE0A7A4FFE2CF7FD320FA6605D569A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_005D4DF74E94ADAD8C4BE29729E699C2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_B92C31C44A854310AC98888C71D7D681();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_160AE72E415988F05784219FEB587694();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_4491215B47A4C99F04606E9524B751CA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_7BC9D5DE46A0F5C8C1841BADD3C63196();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_F9FFDFAF4339B6476BC5FE8C8C87F799();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_A806ABE343084C266E263DAA4AA3C490();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_7A9DCEBA435163A8CEBFE188BAFD9F3B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_D35D8A864DD6903E6231399B3DD35383();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_1B31DE9746B35C1EA93BADB43253396C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_4605E7A541BA20B504676D8CFDC191BE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zombie_AnimGraphNode_TransitionResult_9F3AE3924A5C78208E1A2C9620029B51();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void ExecuteUbergraph_ABP_Zombie(int32 EntryPoint);
}; // Size: 0x2F18

#endif
