// AnimBlueprintGeneratedClass ABP_Razor.ABP_Razor_C
// Size: 0x2c40 (Inherited: 0x3a0)
struct UABP_Razor_C : URazorAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3a0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3a8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x3d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x400(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x428(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x450(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x478(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x4c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x4f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x540(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x568(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x590(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x5b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x638(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x668(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x6e8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x718(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x798(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x818(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x8b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x938(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x9b8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xa98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xb18(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xb98(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xc38(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xd20(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xda0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xe50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xe80(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xf00(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xf80(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1020(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1108(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x1188(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1238(0x30)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3; // 0x1268(0x78)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2; // 0x12e0(0x78)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x1358(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x13d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1450(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x14d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1550(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x15d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1650(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x16d0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1780(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1830(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1860(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1910(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x19b0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x19f8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x1ab8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1c10(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x1c38(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1c80(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1dd8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1e00(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1e28(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1ef0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1f18(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x2070(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x2098(0x158)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x21f0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2210(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2318(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2338(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x23f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2420(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x2448(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x25a0(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2620(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2728(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2748(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x2768(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2790(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x28e8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2930(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2958(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x29f8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2b50(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2b78(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2bf8(0x48)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Razor.ABP_Razor_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_ModifyBone_593C233C41C192D6ED606F94F1E5190E(); // Function ABP_Razor.ABP_Razor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_ModifyBone_593C233C41C192D6ED606F94F1E5190E // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_SequencePlayer_CB27F4D94E79C641BC4745AE10FAC521(); // Function ABP_Razor.ABP_Razor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_SequencePlayer_CB27F4D94E79C641BC4745AE10FAC521 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_9AFC080741058DBFA4D743BA995291E9(); // Function ABP_Razor.ABP_Razor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_9AFC080741058DBFA4D743BA995291E9 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_9C8C2AFE440BE3229A29C79203BA7949(); // Function ABP_Razor.ABP_Razor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_9C8C2AFE440BE3229A29C79203BA7949 // (BlueprintEvent) // @ game+0x297fc00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_A7F2D0D34AC60C1CE50B0AAD9D810BEC(); // Function ABP_Razor.ABP_Razor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Razor_AnimGraphNode_TransitionResult_A7F2D0D34AC60C1CE50B0AAD9D810BEC // (BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_Razor(int32_t EntryPoint); // Function ABP_Razor.ABP_Razor_C.ExecuteUbergraph_ABP_Razor // (Final|UbergraphFunction) // @ game+0x297fc00
};

