// AnimBlueprintGeneratedClass ABP_Prisoner_Server.ABP_Prisoner_Server_C
// Size: 0x19a0 (Inherited: 0x1050)
struct UABP_Prisoner_Server_C : UPrisonerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1050(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1058(0x30)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x1088(0x18)
	struct FAnimNode_Slot AnimGraphNode_Slot_32; // 0x10a0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_31; // 0x10e8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_30; // 0x1130(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_29; // 0x1178(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_28; // 0x11c0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_27; // 0x1208(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_26; // 0x1250(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_25; // 0x1298(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_24; // 0x12e0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_23; // 0x1328(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_22; // 0x1370(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_21; // 0x13b8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_20; // 0x1400(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_19; // 0x1448(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_18; // 0x1490(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_17; // 0x14d8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_16; // 0x1520(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x1568(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x15b0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x15f8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x1640(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x1688(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x16d0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x1718(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x1760(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x17a8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x17f0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x1838(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x1880(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x18c8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1910(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1958(0x48)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Prisoner_Server.ABP_Prisoner_Server_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_ABP_Prisoner_Server(int32_t EntryPoint); // Function ABP_Prisoner_Server.ABP_Prisoner_Server_C.ExecuteUbergraph_ABP_Prisoner_Server // (Final|UbergraphFunction) // @ game+0x297fc00
};

