// AnimBlueprintGeneratedClass AnimBP_AK47.AnimBP_AK47_C
// Size: 0x18e0 (Inherited: 0x310)
struct UAnimBP_AK47_C : UWeaponAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x318(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x348(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x390(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x3d8(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x420(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x4d0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x518(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x670(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x698(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x6c0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x6e8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x768(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x808(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x8b8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x900(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x948(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x990(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x9b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x9e0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xa08(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xaa8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xb58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xbd8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xc58(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xcd8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xd78(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xed0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xef8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xf20(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x1028(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1048(0x20)
	char pad_1068[0x8]; // 0x1068(0x08)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x1070(0x830)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x18a0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x18c0(0x20)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function AnimBP_AK47.AnimBP_AK47_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_AnimBP_AK47(int32_t EntryPoint); // Function AnimBP_AK47.AnimBP_AK47_C.ExecuteUbergraph_AnimBP_AK47 // (Final|UbergraphFunction) // @ game+0x297fc00
};

