// AnimBlueprintGeneratedClass AnimBP_MosinNagant.AnimBP_MosinNagant_C
// Size: 0xa08 (Inherited: 0x310)
struct UAnimBP_MosinNagant_C : UWeaponAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x318(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x348(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x390(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x3d8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x420(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x468(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x518(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x670(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x698(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x6c0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6e8(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x768(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x7b0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x7f8(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x840(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x8f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x918(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x940(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x968(0xa0)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function AnimBP_MosinNagant.AnimBP_MosinNagant_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_AnimBP_MosinNagant(int32_t EntryPoint); // Function AnimBP_MosinNagant.AnimBP_MosinNagant_C.ExecuteUbergraph_AnimBP_MosinNagant // (Final|UbergraphFunction) // @ game+0x297fc00
};

