// BlueprintGeneratedClass BP_ElectroHouse_01.BP_ElectroHouse_01_C
// Size: 0x260 (Inherited: 0x220)
struct ABP_ElectroHouse_01_C : AActor {
	struct UStaticMeshComponent* ROOT_SM_ElectroHouse_01; // 0x220(0x08)
	struct USceneComponent* Scene; // 0x228(0x08)
	struct UStaticMeshComponent* SM_ElectroHouse_01_Edges; // 0x230(0x08)
	struct UStaticMeshComponent* SM_fusebox1_01; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Power_Box_01_01; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Power_Box_03_01; // 0x248(0x08)
	struct UStaticMeshComponent* SM_fusebox4_01; // 0x250(0x08)
	struct UStaticMeshComponent* SM_IndustrialLightBroken_01_01; // 0x258(0x08)
};

