#ifndef UE4SS_SDK_BP_MugshotRoom_HPP
#define UE4SS_SDK_BP_MugshotRoom_HPP

class ABP_MugshotRoom_C : public AMugshotRoom
{
    class URectLightComponent* RoomLight;                                             // 0x02A0 (size: 0x8)
    class URectLightComponent* R_FillLight;                                           // 0x02A8 (size: 0x8)
    class URectLightComponent* L_FillLight;                                           // 0x02B0 (size: 0x8)
    class URectLightComponent* MainLight;                                             // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Cube5;                                                // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Height graph;                                         // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Cube4;                                                // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Cube2;                                                // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Cube1;                                                // 0x02F0 (size: 0x8)

}; // Size: 0x2F8

#endif
