// BlueprintGeneratedClass BP_Prisoner.BP_Prisoner_C
// Size: 0x23d0 (Inherited: 0x2210)
struct ABP_Prisoner_C : APrisoner {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2210(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Ladder; // 0x2218(0x08)
	struct USkeletalMeshComponent* EditorPreview; // 0x2220(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Mounted; // 0x2228(0x08)
	struct USpringArmComponent* VehicleSpringArm; // 0x2230(0x08)
	struct UPrisonerThirdPersonAerialSubviewComponent* TPV_Falling; // 0x2238(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Grappled; // 0x2240(0x08)
	struct UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedLeaningStanceAimingDownTheSights; // 0x2248(0x08)
	struct UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedDefaultStanceAimingDownTheSights; // 0x2250(0x08)
	struct UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedLeaningStanceAiming; // 0x2258(0x08)
	struct UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedDefaultStanceAiming; // 0x2260(0x08)
	struct USceneComponent* FPViewsMouintedAiming; // 0x2268(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Throwing; // 0x2270(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Lying; // 0x2278(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Swimming; // 0x2280(0x08)
	struct USphereComponent* DangerDetectionSphere; // 0x2288(0x08)
	struct UVoiceAudioComponent* VoiceAudio; // 0x2290(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleFoot_R; // 0x2298(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleFoot_L; // 0x22a0(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHead; // 0x22a8(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeg_R; // 0x22b0(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeg_L; // 0x22b8(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHand_R; // 0x22c0(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHand_L; // 0x22c8(0x08)
	struct USphereComponent* BulletFlyBySoundCollision; // 0x22d0(0x08)
	struct UVisionEffectsComponent* VisionEffectsComponent; // 0x22d8(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Defecating; // 0x22e0(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_ClimbingWindow; // 0x22e8(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_ClimbingWindow; // 0x22f0(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Diving; // 0x22f8(0x08)
	struct USceneComponent* TPViews; // 0x2300(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_NarrowLadder; // 0x2308(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Ragdoll; // 0x2310(0x08)
	struct UWidgetComponent* NameWidget; // 0x2318(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_StandingMelee; // 0x2320(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_StandingMelee; // 0x2328(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_ProneAimingDownTheSights; // 0x2330(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_CrouchingAimingDownTheSights; // 0x2338(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_StandingAimingDownTheSights; // 0x2340(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_ProneAiming; // 0x2348(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_CrouchingAiming; // 0x2350(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_StandingAiming; // 0x2358(0x08)
	struct USceneComponent* FPViewsAiming; // 0x2360(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_ProneAiming; // 0x2368(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_CrouchingAiming; // 0x2370(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_StandingAiming; // 0x2378(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Prone; // 0x2380(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Crouching; // 0x2388(0x08)
	struct UPrisonerFirstPersonSubviewComponent* FPV_Standing; // 0x2390(0x08)
	struct USceneComponent* FPViews; // 0x2398(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Standing; // 0x23a0(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Prone; // 0x23a8(0x08)
	struct UPrisonerThirdPersonSubviewComponent* TPV_Crouching; // 0x23b0(0x08)
	struct UPrisonerFirstPersonViewComponent* FirstPersonView; // 0x23b8(0x08)
	struct UPrisonerThirdPersonViewComponent* ThirdPersonView; // 0x23c0(0x08)
	struct UPrimitiveComponent* BodyToMove; // 0x23c8(0x08)

	void ReceiveBeginPlay(); // Function BP_Prisoner.BP_Prisoner_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_BP_Prisoner(int32_t EntryPoint); // Function BP_Prisoner.BP_Prisoner_C.ExecuteUbergraph_BP_Prisoner // (Final|UbergraphFunction) // @ game+0x297fc00
};

