#ifndef UE4SS_SDK_BP_Prisoner_HPP
#define UE4SS_SDK_BP_Prisoner_HPP

class ABP_Prisoner_C : public APrisoner
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x2210 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_Ladder;                           // 0x2218 (size: 0x8)
    class USkeletalMeshComponent* EditorPreview;                                      // 0x2220 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_Mounted;                          // 0x2228 (size: 0x8)
    class USpringArmComponent* VehicleSpringArm;                                      // 0x2230 (size: 0x8)
    class UPrisonerThirdPersonAerialSubviewComponent* TPV_Falling;                    // 0x2238 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Grappled;                         // 0x2240 (size: 0x8)
    class UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedLeaningStanceAimingDownTheSights; // 0x2248 (size: 0x8)
    class UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedDefaultStanceAimingDownTheSights; // 0x2250 (size: 0x8)
    class UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedLeaningStanceAiming; // 0x2258 (size: 0x8)
    class UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedDefaultStanceAiming; // 0x2260 (size: 0x8)
    class USceneComponent* FPViewsMouintedAiming;                                     // 0x2268 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Throwing;                         // 0x2270 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_Lying;                            // 0x2278 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Swimming;                         // 0x2280 (size: 0x8)
    class USphereComponent* DangerDetectionSphere;                                    // 0x2288 (size: 0x8)
    class UVoiceAudioComponent* VoiceAudio;                                           // 0x2290 (size: 0x8)
    class UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleFoot_R;            // 0x2298 (size: 0x8)
    class UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleFoot_L;            // 0x22A0 (size: 0x8)
    class UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHead;              // 0x22A8 (size: 0x8)
    class UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeg_R;             // 0x22B0 (size: 0x8)
    class UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeg_L;             // 0x22B8 (size: 0x8)
    class UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHand_R;            // 0x22C0 (size: 0x8)
    class UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHand_L;            // 0x22C8 (size: 0x8)
    class USphereComponent* BulletFlyBySoundCollision;                                // 0x22D0 (size: 0x8)
    class UVisionEffectsComponent* VisionEffectsComponent;                            // 0x22D8 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Defecating;                       // 0x22E0 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_ClimbingWindow;                   // 0x22E8 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_ClimbingWindow;                   // 0x22F0 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Diving;                           // 0x22F8 (size: 0x8)
    class USceneComponent* TPViews;                                                   // 0x2300 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_NarrowLadder;                     // 0x2308 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Ragdoll;                          // 0x2310 (size: 0x8)
    class UWidgetComponent* NameWidget;                                               // 0x2318 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_StandingMelee;                    // 0x2320 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_StandingMelee;                    // 0x2328 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_ProneAimingDownTheSights;         // 0x2330 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_CrouchingAimingDownTheSights;     // 0x2338 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_StandingAimingDownTheSights;      // 0x2340 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_ProneAiming;                      // 0x2348 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_CrouchingAiming;                  // 0x2350 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_StandingAiming;                   // 0x2358 (size: 0x8)
    class USceneComponent* FPViewsAiming;                                             // 0x2360 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_ProneAiming;                      // 0x2368 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_CrouchingAiming;                  // 0x2370 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_StandingAiming;                   // 0x2378 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_Prone;                            // 0x2380 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_Crouching;                        // 0x2388 (size: 0x8)
    class UPrisonerFirstPersonSubviewComponent* FPV_Standing;                         // 0x2390 (size: 0x8)
    class USceneComponent* FPViews;                                                   // 0x2398 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Standing;                         // 0x23A0 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Prone;                            // 0x23A8 (size: 0x8)
    class UPrisonerThirdPersonSubviewComponent* TPV_Crouching;                        // 0x23B0 (size: 0x8)
    class UPrisonerFirstPersonViewComponent* FirstPersonView;                         // 0x23B8 (size: 0x8)
    class UPrisonerThirdPersonViewComponent* ThirdPersonView;                         // 0x23C0 (size: 0x8)
    class UPrimitiveComponent* BodyToMove;                                            // 0x23C8 (size: 0x8)

    void ReceiveBeginPlay();
    void ExecuteUbergraph_BP_Prisoner(int32 EntryPoint);
}; // Size: 0x23D0

#endif
