// BlueprintGeneratedClass BP_Sentry.BP_Sentry_C
// Size: 0xf60 (Inherited: 0xf10)
struct ABP_Sentry_C : ASentry2 {
	struct UFlamethrowerComponent* flamethrower; // 0xf10(0x08)
	struct UStaticMeshComponent* AimingLaserStaticMesh; // 0xf18(0x08)
	struct USpotLightComponent* SpotlightFogUL; // 0xf20(0x08)
	struct UPointLightComponent* ActiveLight; // 0xf28(0x08)
	struct USpotLightComponent* SpotlightFogLR; // 0xf30(0x08)
	struct USpotLightComponent* SpotlightFogLL; // 0xf38(0x08)
	struct USpotLightComponent* SpotlightFogUR; // 0xf40(0x08)
	struct USpotLightComponent* SpotLight; // 0xf48(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleRight; // 0xf50(0x08)
	struct UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeft; // 0xf58(0x08)
};

