// BlueprintGeneratedClass BP_Vinery_A_EXT_MASTER.BP_Vinery_A_EXT_MASTER_C
// Size: 0x508 (Inherited: 0x4c8)
struct ABP_Vinery_A_EXT_MASTER_C : ABuilding {
	struct UStaticMeshComponent* SM_Vinery_A_EXT_WM; // 0x4c8(0x08)
	struct UWeatherMaskComponent_C* WeatherMaskComponent; // 0x4d0(0x08)
	struct UChildActorComponent* BoxReflectionCapture_Roof; // 0x4d8(0x08)
	struct UChildActorComponent* BoxReflectionCapture_Main; // 0x4e0(0x08)
	struct USceneComponent* Reflection_Captures; // 0x4e8(0x08)
	struct UEnvironmentDescriptionComponent* EnvironmentDescription; // 0x4f0(0x08)
	struct UChildActorComponent* BP_KletVinograd_Doors; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x500(0x08)
};

