#ifndef UE4SS_SDK_ConZ_HPP
#define UE4SS_SDK_ConZ_HPP

#include "ConZ_enums.hpp"

struct FAITeamAttitude
{
    TEnumAsByte<ETeamAttitude::Type> ObserverTeamResponseToOtherSubteam;              // 0x0000 (size: 0x1)
    TEnumAsByte<ETeamAttitude::Type> ObserverTeamResponseToSameSubteam;               // 0x0001 (size: 0x1)
    TEnumAsByte<ETeamAttitude::Type> ObserverTeamResponseToNullSubteam;               // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FAITeamAttitudeData
{
    FAITeamAttitude AttitudePerTeam;                                                  // 0x0000 (size: 0x21)

}; // Size: 0x21

struct FAbandonedBunkerAnnouncementSoundAndTime
{
    class UAkAudioEvent* Sound;                                                       // 0x0000 (size: 0x8)
    int32 SecondsBeforeClosing;                                                       // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FAbandonedBunkerConnectionBinding
{
    FGameplayTag ActivationTag;                                                       // 0x0000 (size: 0x8)
    float Load;                                                                       // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FAbandonedBunkerFloorSetup
{
    TSubclassOf<class UDoorUnlockData> DoorUnlockData;                                // 0x0000 (size: 0x8)
    TSubclassOf<class AItem> KeyCardItem;                                             // 0x0008 (size: 0x8)
    FItemSpawnerPresetWithOverrides ZombieKeycardSpawnerPreset;                       // 0x0010 (size: 0xB8)
    FGameplayTag FloorId;                                                             // 0x00C8 (size: 0x8)
    class UStaticMesh* SchematicMesh;                                                 // 0x00D0 (size: 0x8)
    TArray<class AAbandonedBunkerSwitchboard*> SlaveSwitchboards;                     // 0x00D8 (size: 0x10)
    class AAbandonedBunkerSwitchboard* MasterSwitchboard;                             // 0x00E8 (size: 0x8)

}; // Size: 0xF0

struct FAchievementStats
{
}; // Size: 0x1

struct FAchievements
{
}; // Size: 0x1

struct FActivationReservation
{
    double PreviousActivationEnd;                                                     // 0x0000 (size: 0x8)
    double ActivationStart;                                                           // 0x0008 (size: 0x8)
    double ActivationEnd;                                                             // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FActiveHit
{
}; // Size: 0xC

struct FActiveMovingThroughFoliageSounds
{
    class UAkAudioEvent* StartAudioEvent;                                             // 0x0008 (size: 0x8)
    class UAkAudioEvent* StopAudioEvent;                                              // 0x0010 (size: 0x8)

}; // Size: 0x20

struct FActiveQuest
{
}; // Size: 0x70

struct FActiveTask
{
}; // Size: 0x58

struct FActorPaintParams
{
    TArray<FName> _partPaintNames;                                                    // 0x0000 (size: 0x10)
    TArray<class UMaterialInterface*> _cachedOriginalMaterials;                       // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FActorResourceLockNetwork
{
    FResourceNetworkGUID LockOwnerGUID;                                               // 0x0000 (size: 0x4)
    FResourceNetworkGUID ResourceGUID;                                                // 0x0004 (size: 0x4)
    int32 ResourceId;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FAdminCommandArgumentDescription
{
    FText Name;                                                                       // 0x0000 (size: 0x18)
    FText Description;                                                                // 0x0018 (size: 0x18)
    bool ShowCompletionValuesInHelpText;                                              // 0x0030 (size: 0x1)
    class UAdminCommandArgumentDataTypeBase* Data;                                    // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FAerodynamicSurface
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    FGameplayTag Tag;                                                                 // 0x0008 (size: 0x8)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)
    float LiftSlope;                                                                  // 0x0040 (size: 0x4)
    float SkinFriction;                                                               // 0x0044 (size: 0x4)
    float ZeroLiftAoA;                                                                // 0x0048 (size: 0x4)
    float StallAngleHigh;                                                             // 0x004C (size: 0x4)
    float StallAngleLow;                                                              // 0x0050 (size: 0x4)
    float Chord;                                                                      // 0x0054 (size: 0x4)
    float Span;                                                                       // 0x0058 (size: 0x4)
    float AspectRatio;                                                                // 0x005C (size: 0x4)
    float FlapFraction;                                                               // 0x0060 (size: 0x4)
    bool IsControlable;                                                               // 0x0064 (size: 0x1)
    float FlapAngle;                                                                  // 0x0068 (size: 0x4)
    float FlapAngleSensitivity;                                                       // 0x006C (size: 0x4)
    float MaxFlapAngle;                                                               // 0x0070 (size: 0x4)
    float AreaMultiplier;                                                             // 0x0074 (size: 0x4)

}; // Size: 0x80

struct FAerodynamicSurfaceControlData
{
    TArray<FGameplayTag> Tags;                                                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAmbientOcclusionPostProcessSettings
{
    uint8 bOverride_AmbientOcclusionIntensity;                                        // 0x0000 (size: 0x1)
    uint8 bOverride_AmbientOcclusionStaticFraction;                                   // 0x0000 (size: 0x1)
    uint8 bOverride_AmbientOcclusionRadius;                                           // 0x0000 (size: 0x1)
    uint8 bOverride_AmbientOcclusionFadeDistance;                                     // 0x0000 (size: 0x1)
    uint8 bOverride_AmbientOcclusionFadeRadius;                                       // 0x0000 (size: 0x1)
    uint8 bOverride_AmbientOcclusionRadiusInWS;                                       // 0x0000 (size: 0x1)
    uint8 bOverride_AmbientOcclusionPower;                                            // 0x0000 (size: 0x1)
    uint8 bOverride_AmbientOcclusionBias;                                             // 0x0000 (size: 0x1)
    uint8 bOverride_AmbientOcclusionQuality;                                          // 0x0001 (size: 0x1)
    uint8 bOverride_AmbientOcclusionMipBlend;                                         // 0x0001 (size: 0x1)
    uint8 bOverride_AmbientOcclusionMipScale;                                         // 0x0001 (size: 0x1)
    uint8 bOverride_AmbientOcclusionMipThreshold;                                     // 0x0001 (size: 0x1)
    uint8 bOverride_AmbientOcclusionTemporalBlendWeight;                              // 0x0001 (size: 0x1)
    float AmbientOcclusionIntensity;                                                  // 0x0004 (size: 0x4)
    float AmbientOcclusionRadius;                                                     // 0x0008 (size: 0x4)
    float AmbientOcclusionStaticFraction;                                             // 0x000C (size: 0x4)
    uint8 AmbientOcclusionRadiusInWS;                                                 // 0x0010 (size: 0x1)
    float AmbientOcclusionFadeDistance;                                               // 0x0014 (size: 0x4)
    float AmbientOcclusionFadeRadius;                                                 // 0x0018 (size: 0x4)
    float AmbientOcclusionPower;                                                      // 0x001C (size: 0x4)
    float AmbientOcclusionBias;                                                       // 0x0020 (size: 0x4)
    float AmbientOcclusionQuality;                                                    // 0x0024 (size: 0x4)
    float AmbientOcclusionMipBlend;                                                   // 0x0028 (size: 0x4)
    float AmbientOcclusionMipScale;                                                   // 0x002C (size: 0x4)
    float AmbientOcclusionMipThreshold;                                               // 0x0030 (size: 0x4)
    float AmbientOcclusionTemporalBlendWeight;                                        // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FAmmunitionArrowSpawningParamsHelper
{
}; // Size: 0x18

struct FAmmunitionData
{
    TSubclassOf<class AAmmunitionItem> AmmunitionItemClass;                           // 0x0000 (size: 0x8)
    float health;                                                                     // 0x0008 (size: 0x4)
    float MaxHealth;                                                                  // 0x000C (size: 0x4)
    float DefaultMaxHealth;                                                           // 0x0010 (size: 0x4)
    EAmmunitionCartridgeState State;                                                  // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FAnimalActionMontageData
{
    class UAnimMontage* SleepMontage;                                                 // 0x0000 (size: 0x8)
    class UAnimMontage* EatMontage;                                                   // 0x0008 (size: 0x8)
    class UAnimMontage* IntimidateMontage;                                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAnimalPaceSettings
{
    float RunSpeed;                                                                   // 0x0000 (size: 0x4)
    float TrotSpeed;                                                                  // 0x0004 (size: 0x4)
    float WalkSpeed;                                                                  // 0x0008 (size: 0x4)
    float SneakSpeed;                                                                 // 0x000C (size: 0x4)

}; // Size: 0x10

struct FAnimalSpawnData
{
    float NextClueDistanceMin;                                                        // 0x0000 (size: 0x4)
    float NextClueDistanceMax;                                                        // 0x0004 (size: 0x4)
    int32 NumCluesMin;                                                                // 0x0008 (size: 0x4)
    int32 NumCluesMax;                                                                // 0x000C (size: 0x4)
    int32 PackSizeMin;                                                                // 0x0010 (size: 0x4)
    int32 PackSizeMax;                                                                // 0x0014 (size: 0x4)
    float NextClueMaxHalfAngleDeg;                                                    // 0x0018 (size: 0x4)
    FAnimalSpawnWeigthsPerDayPeriod SpawnWeights;                                     // 0x001C (size: 0x10)

}; // Size: 0x2C

struct FAnimalSpawnWeigthsPerDayPeriod
{
    float SpawnWeight;                                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnimalStationaryRotationRateSettings
{
    FRotator RunRotationRate;                                                         // 0x0000 (size: 0xC)
    FRotator TrotRotationRate;                                                        // 0x000C (size: 0xC)
    FRotator WalkRotationRate;                                                        // 0x0018 (size: 0xC)
    FRotator SneakRotationRate;                                                       // 0x0024 (size: 0xC)
    FRotator StandRotationRate;                                                       // 0x0030 (size: 0xC)

}; // Size: 0x3C

struct FAquaticLifeSpawningVolumeDescription
{
    class UFishSpeciesPreset* FishSpeciesPreset;                                      // 0x0020 (size: 0x8)
    class UFishSpawningPreset* FishSpawningPreset;                                    // 0x0028 (size: 0x8)

}; // Size: 0x68

struct FAreaResourceLockNetwork
{
    FResourceNetworkGUID LockOwnerGUID;                                               // 0x0000 (size: 0x4)
    FBox Area;                                                                        // 0x0004 (size: 0x1C)

}; // Size: 0x20

struct FArmedNPCAimCorrection
{
    FRotator LeftHandRotator;                                                         // 0x0000 (size: 0xC)
    bool UseAimOffsetPitchCurve;                                                      // 0x000C (size: 0x1)
    bool UseAimOffsetYawCurve;                                                        // 0x000D (size: 0x1)
    FRuntimeFloatCurve AimOffsetPitch;                                                // 0x0010 (size: 0x88)
    FRuntimeFloatCurve AimOffsetYaw;                                                  // 0x0098 (size: 0x88)

}; // Size: 0x120

struct FArmedNPCDifficultyLevelSettingProperties
{
    FFloatInterval MeleeCooldownDuration;                                             // 0x0000 (size: 0x8)
    FWeaponManualSettingsHandgun HandgunSettings;                                     // 0x0008 (size: 0x2C)
    FWeaponManualSettingsRifleAutomatic RifleAutomaticSettings;                       // 0x0034 (size: 0x24)
    FWeaponManualSettingsRifleManual RifleManualSettings;                             // 0x0058 (size: 0x28)
    FWeaponManualSettingsBow BowSettings;                                             // 0x0080 (size: 0x2C)
    FWeaponManualSettingsCrossBow CrossBowSettings;                                   // 0x00AC (size: 0x20)

}; // Size: 0xCC

struct FArmedNPCMeleeAttackTypes
{
    FGameplayTag PrimaryMeleeAttackTypeWhenNotMoving;                                 // 0x0000 (size: 0x8)
    FGameplayTag PrimaryMeleeAttackTypeWhenWalking;                                   // 0x0008 (size: 0x8)
    FGameplayTag PrimaryMeleeAttackTypeWhenJogging;                                   // 0x0010 (size: 0x8)
    FGameplayTag PrimaryMeleeAttackTypeWhenRunning;                                   // 0x0018 (size: 0x8)
    FGameplayTag PrimaryMeleeAttackTypeWhenFalling;                                   // 0x0020 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenNotMoving;                               // 0x0028 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenWalking;                                 // 0x0030 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenJogging;                                 // 0x0038 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenRunning;                                 // 0x0040 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenFalling;                                 // 0x0048 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenNotMoving;                                   // 0x0050 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenWalking;                                     // 0x0058 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenJogging;                                     // 0x0060 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenRunning;                                     // 0x0068 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenFalling;                                     // 0x0070 (size: 0x8)
    FGameplayTag BashMeleeAttackType;                                                 // 0x0078 (size: 0x8)
    FGameplayTag WeaponBayonetMeleeAttackType;                                        // 0x0080 (size: 0x8)

}; // Size: 0x88

struct FArmedNPCRecentProjectileDamage
{
}; // Size: 0x1C

struct FArmedNPCVariation
{
    TSoftObjectPtr<USkeletalMesh> BodyMesh;                                           // 0x0000 (size: 0x28)
    TSoftObjectPtr<USkeletalMesh> BodyMeshWhenSearched;                               // 0x0028 (size: 0x28)
    TArray<TSoftObjectPtr<AItem>> ItemsOnSearch;                                      // 0x0050 (size: 0x10)
    TArray<TSoftObjectPtr<AItem>> PossibleItemsOnSearch;                              // 0x0060 (size: 0x10)
    EConZGender Gender;                                                               // 0x0070 (size: 0x1)
    float BodyWight;                                                                  // 0x0074 (size: 0x4)
    class UChoppingRecipeDataAsset* CorpseChoppingRecipeDataAsset;                    // 0x0078 (size: 0x8)
    class UArmedNPCDamageCustomizationData* DamageCustomizationData;                  // 0x0080 (size: 0x8)

}; // Size: 0x88

struct FAttachComponentData
{
    class UMeshComponent* MeshComponent;                                              // 0x0000 (size: 0x8)
    int32 ParticleIndex;                                                              // 0x0008 (size: 0x4)
    bool SimulateTension;                                                             // 0x000C (size: 0x1)
    FName SocketName;                                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAttachmentSocket
{
    TArray<FAttachmentSocketDataItem> Items;                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAttachmentSocketDataItem
{
    FName BoneName;                                                                   // 0x0000 (size: 0x8)
    TSubclassOf<class UAttachmentSocketMountType> MountType;                          // 0x0008 (size: 0x8)
    class AActor* MountedItem;                                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAttachmentSocketOffset
{
    FName BoneName;                                                                   // 0x0000 (size: 0x8)
    FVector Location;                                                                 // 0x0008 (size: 0xC)
    FRotator Rotation;                                                                // 0x0014 (size: 0xC)

}; // Size: 0x20

struct FAttackedByMeleeData
{
    TWeakObjectPtr<class AActor> attacker;                                            // 0x0000 (size: 0x8)
    TWeakObjectPtr<class UAnimMontage> Montage;                                       // 0x0008 (size: 0x8)
    float PlayRate;                                                                   // 0x0010 (size: 0x4)
    float Duration;                                                                   // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FAviationSkillParametersPerSkillLevel
{
    bool ShouldHaveMouseInput;                                                        // 0x0000 (size: 0x1)
    float EngineReadyDelay;                                                           // 0x0004 (size: 0x4)
    float EngineFailedToStartDelay;                                                   // 0x0008 (size: 0x4)
    float EngineFailedToStartNoFuelDelay;                                             // 0x000C (size: 0x4)
    float EngineFailedToStartNoBatteryDelay;                                          // 0x0010 (size: 0x4)
    float EngineStalledDelay;                                                         // 0x0014 (size: 0x4)
    float ThrottleLerpMultiplier;                                                     // 0x0018 (size: 0x4)
    float BrakeLerpMultiplier;                                                        // 0x001C (size: 0x4)
    float RollLerpMultiplier;                                                         // 0x0020 (size: 0x4)
    float YawLerpMultiplier;                                                          // 0x0024 (size: 0x4)
    float PitchLerpMultiplier;                                                        // 0x0028 (size: 0x4)
    float ControlResetLerpMultiplier;                                                 // 0x002C (size: 0x4)
    float WindInfluenceMultiplier;                                                    // 0x0030 (size: 0x4)
    FEngineHandlingParameters EngineHandlingParameters;                               // 0x0034 (size: 0x8)
    FDrivingSkillEngineStallingParameters EngineStallingByAccelerationParameters;     // 0x0040 (size: 0x40)
    FDrivingSkillEngineStallingParameters EngineStallingByUpShiftParameters;          // 0x0080 (size: 0x40)
    FDrivingSkillEngineStallingParameters EngineStallingWhenStartingViaMotion;        // 0x00C0 (size: 0x40)

}; // Size: 0x100

struct FAwarenessSkillExperienceAwards
{
    float PointsForDetectedItem;                                                      // 0x0000 (size: 0x4)
    float PointsForDetectedWatchingPrisoner;                                          // 0x0004 (size: 0x4)
    float PointsForDetectedCamouflagedPrisoner;                                       // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FAwarenessSkillParametersPerSkillLevel
{
    float ItemDetectionTime;                                                          // 0x0000 (size: 0x4)
    float ItemDetectionRadius;                                                        // 0x0004 (size: 0x4)
    float ItemDetectionHighlightByDayRadius;                                          // 0x0008 (size: 0x4)
    float ItemDetectionHighlightByNightRadius;                                        // 0x000C (size: 0x4)
    float WatchingDetectionTime;                                                      // 0x0010 (size: 0x4)
    float WatchingDetectionRadius;                                                    // 0x0014 (size: 0x4)
    float WatchingDetectionChance;                                                    // 0x0018 (size: 0x4)
    float CharacterDetectionAngle;                                                    // 0x001C (size: 0x4)
    float CharacterDetectionTime;                                                     // 0x0020 (size: 0x4)
    float CharacterDetectionPeriodicRangeIncrement;                                   // 0x0024 (size: 0x4)
    float HiddenCharacterDetectionRange;                                              // 0x0028 (size: 0x4)
    float HiddenCharacterHotSpotDetectionRange;                                       // 0x002C (size: 0x4)
    float HiddenCharacterSoundDetectionRange;                                         // 0x0030 (size: 0x4)
    float TrackDetectionRange;                                                        // 0x0034 (size: 0x4)
    float TrapDetectionRange;                                                         // 0x0038 (size: 0x4)
    float FocusModeNotMovingFocusRangeMultiplier;                                     // 0x003C (size: 0x4)
    float FocusModeSlowMovingFocusRangeMultiplier;                                    // 0x0040 (size: 0x4)
    float FocusModeMediumMovingFocusRangeMultiplier;                                  // 0x0044 (size: 0x4)
    float FocusModeFastMovingFocusRangeMultiplier;                                    // 0x0048 (size: 0x4)
    float FlashbangFlashFadeOutDurationMultiplier;                                    // 0x004C (size: 0x4)
    float ContainerItemSpawnProbabilityModifier;                                      // 0x0050 (size: 0x4)

}; // Size: 0x54

struct FBandage
{
    float _ratio;                                                                     // 0x0000 (size: 0x4)
    float _asepsis;                                                                   // 0x0004 (size: 0x4)
    float _stabilizationDurationReduction;                                            // 0x0008 (size: 0x4)
    float _recoveryDurationReduction;                                                 // 0x000C (size: 0x4)

}; // Size: 0x10

struct FBandages
{
    float _amount;                                                                    // 0x0000 (size: 0x4)
    TArray<FBandage> _bandages;                                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FBankATMBoughtCardStateVisual
{
    FSlateColor FontColor;                                                            // 0x0000 (size: 0x28)
    FLinearColor BrushColor;                                                          // 0x0028 (size: 0x10)
    float OnHoveredUpwardsOffset;                                                     // 0x0038 (size: 0x4)
    bool OptionsCircleSelectedState;                                                  // 0x003C (size: 0x1)

}; // Size: 0x40

struct FBankATMBuyableCardStateVisual
{
    bool TransparentBackground;                                                       // 0x0000 (size: 0x1)
    float RenderOpacity;                                                              // 0x0004 (size: 0x4)
    bool PlusCircleVisible;                                                           // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FBankATMCarouselCardStateVisual
{
    FMargin Padding;                                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBankATMMyCardsButtonStateVisual
{
    FLinearColor FontColor;                                                           // 0x0000 (size: 0x10)
    FSlateBrush BackgroundBrush;                                                      // 0x0010 (size: 0x88)
    FSlateBrush CardIconBrush;                                                        // 0x0098 (size: 0x88)

}; // Size: 0x120

struct FBankATMPointingButtonStateVisual
{
    FLinearColor FontColor;                                                           // 0x0000 (size: 0x10)
    FSlateBrush BackgroundBrush;                                                      // 0x0010 (size: 0x88)

}; // Size: 0x98

struct FBankATMUISounds
{
    class UAkAudioEvent* ButtonClick;                                                 // 0x0000 (size: 0x8)
    class UAkAudioEvent* ButtonHover;                                                 // 0x0008 (size: 0x8)
    class UAkAudioEvent* TransactionFailed;                                           // 0x0010 (size: 0x8)
    class UAkAudioEvent* TransactionSuccessful;                                       // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FBankATMVirtualEditboxStateVisual
{
    FLinearColor OutlineColor;                                                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBankAccountRegistryRequestData
{
}; // Size: 0x1C

struct FBankCardOperationRequestData
{
}; // Size: 0x10

struct FBankCardOwnershipPayloadData
{
}; // Size: 0x3

struct FBankCardTypeData
{
    TSoftClassPtr<AItem> ItemClass;                                                   // 0x0000 (size: 0x28)
    int32 PurchasePrice;                                                              // 0x0028 (size: 0x4)
    ECurrencyType PurchasePriceCurrency;                                              // 0x002C (size: 0x1)
    int32 MaxWrongPinAttempts;                                                        // 0x0030 (size: 0x4)
    int32 FreeRenewalNum;                                                             // 0x0034 (size: 0x4)
    int32 DailyWithdrawLimit;                                                         // 0x0038 (size: 0x4)
    int32 DailyDepositLimit;                                                          // 0x003C (size: 0x4)
    int32 PinComplexity;                                                              // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FBankTransactionRequestData
{
}; // Size: 0x38

struct FBaseBuildingSizeVariation
{
    TSubclassOf<class UBaseBuildingComponent> Component;                              // 0x0000 (size: 0x8)

}; // Size: 0x18

struct FBaseBuildingUISounds
{
    class UAkAudioEvent* PlaceButtonClick;                                            // 0x0000 (size: 0x8)
    class UAkAudioEvent* DetailsButtonClick;                                          // 0x0008 (size: 0x8)
    class UAkAudioEvent* BackButtonClick;                                             // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FBaseDamageInteractionEvent : public FBaseInteractionEvent
{
}; // Size: 0xA8

struct FBaseElementDamageZone
{
    FVector BoundsMin;                                                                // 0x0000 (size: 0xC)
    FVector BoundsMax;                                                                // 0x000C (size: 0xC)
    float MinDamagePerSecond;                                                         // 0x0018 (size: 0x4)
    float MaxDamagePerSecond;                                                         // 0x001C (size: 0x4)
    float MinSpeedForDamage;                                                          // 0x0020 (size: 0x4)
    float MaxSpeedForDamage;                                                          // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FBaseElementDestructionZone
{
    FBox Bounds;                                                                      // 0x0000 (size: 0x1C)
    bool IsCompositeZone;                                                             // 0x001C (size: 0x1)
    TArray<FRotatedZone> CompositeZoneComponents;                                     // 0x0020 (size: 0x10)
    float DamageToItems;                                                              // 0x0030 (size: 0x4)
    float FallDamagePerMeter;                                                         // 0x0034 (size: 0x4)
    float MaxFallDamage;                                                              // 0x0038 (size: 0x4)
    bool MustElementBeAboveZone;                                                      // 0x003C (size: 0x1)
    bool IgnoreElementsThatCantBePlacedOnOtherElements;                               // 0x003D (size: 0x1)

}; // Size: 0x40

struct FBaseElementSpawnParams
{
    float Quality;                                                                    // 0x0000 (size: 0x4)
    uint8 OverrideColor0;                                                             // 0x0004 (size: 0x1)
    uint8 OverrideColor1;                                                             // 0x0005 (size: 0x1)
    FDbIntegerId ShelterId;                                                           // 0x0008 (size: 0x8)
    FEntityId EntityId;                                                               // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FBaseInteractionEvent
{
}; // Size: 0x8

struct FBaseInteractionParams
{
    FDbIntegerId ElementID;                                                           // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FBaseInteractionVisitor
{
}; // Size: 0x20

struct FBasePoseAimOffsetPair
{
    class UAnimSequenceBase* UpperBodyPose;                                           // 0x0000 (size: 0x8)
    class UAnimSequenceBase* LowerBodyPose;                                           // 0x0008 (size: 0x8)
    class UBlendSpace* AimOffset;                                                     // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FBasicNotificationDescriptionData
{
    FText Message;                                                                    // 0x0000 (size: 0x18)
    int32 FontSize;                                                                   // 0x0018 (size: 0x4)
    class UTexture2D* Icon;                                                           // 0x0020 (size: 0x8)
    int32 IconSize;                                                                   // 0x0028 (size: 0x4)
    float Duration;                                                                   // 0x002C (size: 0x4)
    bool Ping;                                                                        // 0x0030 (size: 0x1)
    float Delay;                                                                      // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FBasicPrisonerBodySymptomNotificationParameters
{
    FFloatRange SeverityRange;                                                        // 0x0000 (size: 0x10)
    TSubclassOf<class UNotificationDescription> Notification;                         // 0x0010 (size: 0x8)
    int32 MaxNumTriggers;                                                             // 0x0018 (size: 0x4)
    FFloatInterval TriggerInterval;                                                   // 0x001C (size: 0x8)

}; // Size: 0x28

struct FBoatParametersPerMovementPace
{
    bool IsValid;                                                                     // 0x0000 (size: 0x1)
    float BaseMaxForwardSpeed;                                                        // 0x0004 (size: 0x4)
    bool CanReverse;                                                                  // 0x0008 (size: 0x1)
    float BaseMaxReverseSpeed;                                                        // 0x000C (size: 0x4)
    float MinPrisonerStrength;                                                        // 0x0010 (size: 0x4)
    float ThrottleMultiplier;                                                         // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FBoatParametersPerMovementPace_Deprecated
{
    bool IsValid;                                                                     // 0x0000 (size: 0x1)
    float BaseMaxForwardSpeed;                                                        // 0x0004 (size: 0x4)
    bool CanReverse;                                                                  // 0x0008 (size: 0x1)
    float BaseMaxReverseSpeed;                                                        // 0x000C (size: 0x4)
    float MinPrisonerStrength;                                                        // 0x0010 (size: 0x4)
    float ThrottleMultiplier;                                                         // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FBodyConditionSpriteData
{
}; // Size: 0x160

struct FBodyWeaponAnimation
{
    class UAnimMontage* Body;                                                         // 0x0000 (size: 0x8)
    class UAnimMontage* Weapon;                                                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBrennerAttackDescription
{
    EBrennerAttackType Type;                                                          // 0x0000 (size: 0x1)
    class UAnimMontage* Montage;                                                      // 0x0008 (size: 0x8)
    float cooldown;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FBrennerCommonData_BleedingParticles
{
    TSoftObjectPtr<UParticleSystem> Particles;                                        // 0x0000 (size: 0x28)
    FName AttachSocketName;                                                           // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FBrennerUpperBodyPitchRangeData
{
    FFloatRange ActualPitchRange;                                                     // 0x0000 (size: 0x10)
    float AppliedPitch;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FBruisePatch
{
    EBruiseLayer Layer;                                                               // 0x0000 (size: 0x1)
    TArray<EBruiseZone> AllowedZones;                                                 // 0x0008 (size: 0x10)
    int32 Order;                                                                      // 0x0018 (size: 0x4)
    class UTexture2D* Texture;                                                        // 0x0020 (size: 0x8)
    FVector2D Offset;                                                                 // 0x0028 (size: 0x8)
    bool Mute;                                                                        // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FBuildingData
{
    FBuildingEntityData EntityData;                                                   // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FBuildingEntityData
{
    bool IsCleared;                                                                   // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FBuildingNavLinkData
{
    FVector LeftNodeRelativePosition;                                                 // 0x0000 (size: 0xC)
    FVector RightNodeRelativePosition;                                                // 0x000C (size: 0xC)
    TEnumAsByte<ENavLinkDirection::Type> Direction;                                   // 0x0018 (size: 0x1)
    FNavAgentSelector SupportedAgents;                                                // 0x001C (size: 0x4)

}; // Size: 0x20

struct FBuildingsArray
{
    TArray<class ABuilding*> _buildings;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBuildingsReplicationHelper
{
    TMap<class FString, class FBuildingData> BuildingsData;                           // 0x0000 (size: 0x50)

}; // Size: 0x70

struct FBuoyancy
{
    TArray<FBuoyancyConstraint> _testPoints;                                          // 0x0000 (size: 0x10)
    FVector _velocityDamper;                                                          // 0x0010 (size: 0xC)
    bool _dampingDependsOnMass;                                                       // 0x001C (size: 0x1)
    float _fluidLinearDamping;                                                        // 0x0020 (size: 0x4)
    float _fluidAngularDamping;                                                       // 0x0024 (size: 0x4)
    bool _clampMaxVelocity;                                                           // 0x0028 (size: 0x1)
    float _maxUnderwaterVelocity;                                                     // 0x002C (size: 0x4)
    bool _shouldApplyWaterVelocity;                                                   // 0x0030 (size: 0x1)
    float _waterVelocityMultiplier;                                                   // 0x0034 (size: 0x4)
    bool _shouldApplyWaterSurfaceForces;                                              // 0x0038 (size: 0x1)
    float _verticalWaterDrag;                                                         // 0x003C (size: 0x4)
    float _surfaceTensionMultiplier;                                                  // 0x0040 (size: 0x4)

}; // Size: 0x70

struct FBuoyancyConstraint
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    FName Bone;                                                                       // 0x000C (size: 0x8)
    float Radius;                                                                     // 0x0014 (size: 0x4)
    float Density;                                                                    // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FBurialInformation
{
    FDbIntegerId BurierUserId;                                                        // 0x0000 (size: 0x8)
    bool ShouldBury;                                                                  // 0x0008 (size: 0x1)
    FVector BurialLocation;                                                           // 0x000C (size: 0xC)

}; // Size: 0x18

struct FBurnPointDamageEvent : public FScumPointDamageEvent
{
}; // Size: 0xD0

struct FBuryMaterialData
{
    class UMaterialInterface* Material;                                               // 0x0000 (size: 0x8)
    class UParticleSystem* BreachActionParticles;                                     // 0x0008 (size: 0x8)
    class UAkAudioEvent* BreachActionSound;                                           // 0x0010 (size: 0x8)
    class UParticleSystem* DumpActionParticles;                                       // 0x0018 (size: 0x8)
    class UAkAudioEvent* DumpActionSound;                                             // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FButtonIcons
{
    FSlateBrush EnabledIcon;                                                          // 0x0000 (size: 0x88)
    FSlateBrush DisabledIcon;                                                         // 0x0088 (size: 0x88)

}; // Size: 0x110

struct FCCNonImplementedSkill
{
    ESkillAttribute Attribute;                                                        // 0x0000 (size: 0x1)
    FText Caption;                                                                    // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FCTFParameters
{
    float FlagResetDuration;                                                          // 0x0000 (size: 0x4)
    bool AllowReturns;                                                                // 0x0004 (size: 0x1)
    int32 CaptureLimit;                                                               // 0x0008 (size: 0x4)
    FGameEventRewardPoints PointsPerPickup;                                           // 0x000C (size: 0xC)
    FGameEventRewardPoints PointsPerCapture;                                          // 0x0018 (size: 0xC)
    FGameEventRewardPoints PointsPerReturn;                                           // 0x0024 (size: 0xC)

}; // Size: 0x30

struct FCamouflageSkillExperienceAwards
{
    float BonusExperience;                                                            // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FCamouflageSkillParametersPerSkillLevel
{
    float Modifier;                                                                   // 0x0000 (size: 0x4)
    float Bonus;                                                                      // 0x0004 (size: 0x4)
    float FoliageAIPerceptionOuterRadius;                                             // 0x0008 (size: 0x4)
    float FoliageAIPerceptionInnerRadius;                                             // 0x000C (size: 0x4)
    FFloatInterval VisibilityFadeByDistanceWhileStandingInMeters;                     // 0x0010 (size: 0x8)
    FFloatInterval VisibilityFadeByDistanceWhileCrouchingInMeters;                    // 0x0018 (size: 0x8)
    FFloatInterval VisibilityFadeByDistanceWhileInProneInMeters;                      // 0x0020 (size: 0x8)
    FFloatInterval PhysicalSurfaceVisibilityInfluenceDistanceInMeters;                // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FCargoDropEncounterData
{
    float Weight;                                                                     // 0x0000 (size: 0x4)
    bool HasSpawnDelay;                                                               // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FCargoDropSpawnerPreset
{
    TSubclassOf<class UItemSpawnerPreset> Preset;                                     // 0x0000 (size: 0x8)
    TSubclassOf<class UItemSpawnerPreset2> SpawnerPreset;                             // 0x0008 (size: 0x8)
    float ChanceMultiplier;                                                           // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FCarouselStyle
{
    FButtonStyle LeftArrowIcon;                                                       // 0x0000 (size: 0x278)
    FButtonStyle RightArrowIcon;                                                      // 0x0278 (size: 0x278)
    FCarouselTextStyle ValueText;                                                     // 0x04F0 (size: 0x80)

}; // Size: 0x570

struct FCarouselTextStyle
{
    FMargin Padding;                                                                  // 0x0000 (size: 0x10)
    TEnumAsByte<EHorizontalAlignment> HorizontalAlignment;                            // 0x0010 (size: 0x1)
    TEnumAsByte<EVerticalAlignment> VerticalAlignment;                                // 0x0011 (size: 0x1)
    FSlateFontInfo Font;                                                              // 0x0018 (size: 0x58)
    FLinearColor ColorAndOpacity;                                                     // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FCarouselWithLabelStyle
{
    FSlateBrush FocusBackgroundImage;                                                 // 0x0000 (size: 0x88)
    FCarouselTextStyle LabelText;                                                     // 0x0088 (size: 0x80)

}; // Size: 0x108

struct FCaughtFishData
{
    EFishSpecies fishSpecies;                                                         // 0x0000 (size: 0x1)
    int32 Amount;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FCharacterActionAck
{
    int32 ActionId;                                                                   // 0x0000 (size: 0x4)
    int32 SubActionIndex;                                                             // 0x0004 (size: 0x4)
    int32 ActionGenerationIndex;                                                      // 0x0008 (size: 0x4)
    ECharacterActionAckType Type;                                                     // 0x000C (size: 0x1)
    ECharacterActionEndState EndState;                                                // 0x000D (size: 0x1)

}; // Size: 0x10

struct FCharacterActionAnimationDescription
{
}; // Size: 0x20

struct FCharacterActionReplicationHelper
{
}; // Size: 0x18

struct FCharacterAndItemAnimation
{
    class UAnimMontage* CharacterMontage;                                             // 0x0000 (size: 0x8)
    class UAnimMontage* ItemMontage;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCharacterArmsImpactSoundData
{
    TArray<ECharacterImpactSourceSoundCategory> ImpactSourceCategories;               // 0x0000 (size: 0x10)
    TArray<ECharacterArmsImpactSoundCategory> ImpactTargetCategories;                 // 0x0010 (size: 0x10)
    FCharacterImpactSounds Sounds;                                                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FCharacterArmsImpactSoundsData
{
    TArray<FCharacterArmsImpactSoundData> SoundsData;                                 // 0x0000 (size: 0x10)
    FCharacterImpactSounds FallbackSounds;                                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FCharacterCreationMenuContext
{
    bool IsPreferringMultiplayer;                                                     // 0x0000 (size: 0x1)
    FString ServerIp;                                                                 // 0x0008 (size: 0x10)
    int32 ServerResponsePort;                                                         // 0x0018 (size: 0x4)
    int32 ServerGameplayPort;                                                         // 0x001C (size: 0x4)
    FString ServerAuthToken;                                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCharacterHeadImpactSoundData
{
    TArray<ECharacterImpactSourceSoundCategory> ImpactSourceCategories;               // 0x0000 (size: 0x10)
    TArray<ECharacterHeadImpactSoundCategory> ImpactTargetCategories;                 // 0x0010 (size: 0x10)
    FCharacterImpactSounds Sounds;                                                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FCharacterHeadImpactSoundsData
{
    TArray<FCharacterHeadImpactSoundData> SoundsData;                                 // 0x0000 (size: 0x10)
    FCharacterImpactSounds FallbackSounds;                                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FCharacterImpactSounds
{
    class UAkAudioEvent* AudioEvent;                                                  // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FCharacterLegsImpactSoundData
{
    TArray<ECharacterImpactSourceSoundCategory> ImpactSourceCategories;               // 0x0000 (size: 0x10)
    TArray<ECharacterLegsImpactSoundCategory> ImpactTargetCategories;                 // 0x0010 (size: 0x10)
    FCharacterImpactSounds Sounds;                                                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FCharacterLegsImpactSoundsData
{
    TArray<FCharacterLegsImpactSoundData> SoundsData;                                 // 0x0000 (size: 0x10)
    FCharacterImpactSounds FallbackSounds;                                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FCharacterMeshClassArray
{
    TArray<class TSubclassOf<UCharacterMesh>> Classes;                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterMeshClassSet
{
    TSet<TSubclassOf<UCharacterMesh>> Classes;                                        // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FCharacterMeshManagerPerSlotData
{
    TArray<class TSubclassOf<UCharacterMesh>> CharacterMeshLayers;                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterMeshMaterialOverride
{
    FGameplayTagQuery Condition;                                                      // 0x0000 (size: 0x48)
    FName MaterialSlot;                                                               // 0x0048 (size: 0x8)
    TSoftObjectPtr<UMaterialInstance> OverrideMaterial;                               // 0x0050 (size: 0x28)

}; // Size: 0x78

struct FCharacterMeshMorphTarget
{
    FGameplayTagQuery Condition;                                                      // 0x0000 (size: 0x48)
    float Value;                                                                      // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FCharacterMeshMorphTargetArray
{
    TArray<FCharacterMeshMorphTarget> MorphTargetArray;                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterMeshSlice
{
    FGameplayTagQuery Condition;                                                      // 0x0000 (size: 0x48)
    FGameplayTagContainer Slots;                                                      // 0x0048 (size: 0x20)
    TSoftObjectPtr<USkeletalMesh> SkeletalMesh;                                       // 0x0068 (size: 0x28)
    FGameplayTag SkeletalMeshSocket;                                                  // 0x0090 (size: 0x8)
    TArray<FCharacterMeshSocketOverride> SkeletalMeshSocketOverrides;                 // 0x0098 (size: 0x10)
    TMap<class FName, class FCharacterMeshMorphTargetArray> SkeletalMeshMorphTargets; // 0x00A8 (size: 0x50)
    TSoftObjectPtr<UStaticMesh> StaticMesh;                                           // 0x00F8 (size: 0x28)
    FGameplayTag StaticMeshSocket;                                                    // 0x0120 (size: 0x8)
    TArray<FCharacterMeshSocketOverride> StaticMeshSocketOverrides;                   // 0x0128 (size: 0x10)
    TArray<FCharacterMeshMaterialOverride> OverrideMaterials;                         // 0x0138 (size: 0x10)
    TSoftClassPtr<UAnimInstance> SpecificAnimationBlueprintClass;                     // 0x0148 (size: 0x28)
    FTransform SpecificTransform;                                                     // 0x0170 (size: 0x30)
    bool HidesUnderlyingLayer;                                                        // 0x01A0 (size: 0x1)

}; // Size: 0x1B0

struct FCharacterMeshSocketOverride
{
    FGameplayTagQuery Condition;                                                      // 0x0000 (size: 0x48)
    FGameplayTag MeshSocket;                                                          // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FCharacterSpawnerMarker
{
    FTransform Transform;                                                             // 0x0000 (size: 0x30)

}; // Size: 0x30

struct FCharacterStats
{
    float FamePoints;                                                                 // 0x0008 (size: 0x4)
    int32 FameLevel;                                                                  // 0x000C (size: 0x4)
    float EventScore;                                                                 // 0x0010 (size: 0x4)
    int32 EventKills;                                                                 // 0x0014 (size: 0x4)
    int32 EventTeamKills;                                                             // 0x0018 (size: 0x4)
    int32 EventDeaths;                                                                // 0x001C (size: 0x4)
    int32 EventSuicides;                                                              // 0x0020 (size: 0x4)
    int32 EventAssists;                                                               // 0x0024 (size: 0x4)
    int32 EventHeadshots;                                                             // 0x0028 (size: 0x4)
    bool IsBanned;                                                                    // 0x002C (size: 0x1)

}; // Size: 0x30

struct FCharacterStatsItem
{
    int32 Rank;                                                                       // 0x0000 (size: 0x4)
    FString PlayerName;                                                               // 0x0008 (size: 0x10)
    FCharacterStats CharacterStats;                                                   // 0x0018 (size: 0x30)

}; // Size: 0x48

struct FCharacterTemplate
{
    float Strength;                                                                   // 0x0000 (size: 0x4)
    float Constitution;                                                               // 0x0004 (size: 0x4)
    float Dexterity;                                                                  // 0x0008 (size: 0x4)
    float Intelligence;                                                               // 0x000C (size: 0x4)
    int32 Age;                                                                        // 0x0010 (size: 0x4)
    EConZGender Gender;                                                               // 0x0014 (size: 0x1)
    FString Name;                                                                     // 0x0018 (size: 0x10)
    int32 AppearanceIndex;                                                            // 0x0028 (size: 0x4)
    int32 TattooIndex;                                                                // 0x002C (size: 0x4)
    int32 BodyHairIndex;                                                              // 0x0030 (size: 0x4)
    int32 HairStyleIndex;                                                             // 0x0034 (size: 0x4)
    int32 MoustacheStyleIndex;                                                        // 0x0038 (size: 0x4)
    int32 BeardStyleIndex;                                                            // 0x003C (size: 0x4)
    float BreastSize;                                                                 // 0x0040 (size: 0x4)
    float PenisSize;                                                                  // 0x0044 (size: 0x4)
    bool GrowOverTime;                                                                // 0x0048 (size: 0x1)
    int32 TeamIndex;                                                                  // 0x004C (size: 0x4)
    FString BirthDate;                                                                // 0x0050 (size: 0x10)
    FString ArrestDate;                                                               // 0x0060 (size: 0x10)
    TArray<FSkillTemplate> Skills;                                                    // 0x0070 (size: 0x10)
    TSubclassOf<class AItem> Item0;                                                   // 0x0080 (size: 0x8)
    TSubclassOf<class AItem> Item1;                                                   // 0x0088 (size: 0x8)
    TSubclassOf<class AItem> Item2;                                                   // 0x0090 (size: 0x8)
    int32 FaceTypeIndex;                                                              // 0x0098 (size: 0x4)
    int32 SkinToneIndex;                                                              // 0x009C (size: 0x4)
    int32 HairColorId;                                                                // 0x00A0 (size: 0x4)
    int32 FacialHairColorId;                                                          // 0x00A4 (size: 0x4)
    int32 EyeColorIndex;                                                              // 0x00A8 (size: 0x4)
    int32 IrisTypeIndex;                                                              // 0x00AC (size: 0x4)
    FLinearColor EyeshadowColor;                                                      // 0x00B0 (size: 0x10)
    FLinearColor EyelinerColor;                                                       // 0x00C0 (size: 0x10)
    FLinearColor LipstickColor;                                                       // 0x00D0 (size: 0x10)
    uint8 EyeMakeupMetalness;                                                         // 0x00E0 (size: 0x1)
    uint8 EyeMakeupIntensity;                                                         // 0x00E1 (size: 0x1)
    uint8 LipstickRoughness;                                                          // 0x00E2 (size: 0x1)
    uint8 LipstickIntensity;                                                          // 0x00E3 (size: 0x1)

}; // Size: 0xE8

struct FCharacterTorsoImpactSoundData
{
    TArray<ECharacterImpactSourceSoundCategory> ImpactSourceCategories;               // 0x0000 (size: 0x10)
    TArray<ECharacterTorsoImpactSoundCategory> ImpactTargetCategories;                // 0x0010 (size: 0x10)
    FCharacterImpactSounds Sounds;                                                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FCharacterTorsoImpactSoundsData
{
    TArray<FCharacterTorsoImpactSoundData> SoundsData;                                // 0x0000 (size: 0x10)
    FCharacterImpactSounds FallbackSounds;                                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FChargeAttackData
{
    class UAnimMontage* Montage;                                                      // 0x0000 (size: 0x8)
    float RegainControlDurationModifier;                                              // 0x0008 (size: 0x4)
    float Range;                                                                      // 0x000C (size: 0x4)
    float Speed;                                                                      // 0x0010 (size: 0x4)
    float Height;                                                                     // 0x0014 (size: 0x4)
    float lengthOverride;                                                             // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FCheckMeleeAttackCapsuleCollisionData
{
}; // Size: 0xD0

struct FChoppingIngredient
{
    TSoftClassPtr<AItem> Item;                                                        // 0x0000 (size: 0x28)
    int32 MinQuantity;                                                                // 0x0028 (size: 0x4)
    int32 MaxQuantity;                                                                // 0x002C (size: 0x4)
    bool IsQuantityAffectedByTool;                                                    // 0x0030 (size: 0x1)
    float InitialDamage;                                                              // 0x0034 (size: 0x4)
    float RandomizeDamage;                                                            // 0x0038 (size: 0x4)
    bool OverrideAutoDestructTime;                                                    // 0x003C (size: 0x1)
    float AutoDestructTime;                                                           // 0x0040 (size: 0x4)
    bool IsHealthAffectedByChoppedItem;                                               // 0x0044 (size: 0x1)

}; // Size: 0x50

struct FChoppingParametersPerSkillLevel
{
    FExperienceDependentFloat ChoppingTime;                                           // 0x0000 (size: 0x8)
    int32 IngredientsQuantityBonus;                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FChoppingRecipe
{
    FText InteractionCaption;                                                         // 0x0000 (size: 0x18)
    class UAkAudioEvent* ChopAudioEvent;                                              // 0x0018 (size: 0x8)
    ENoiseLevel noiseLevel;                                                           // 0x0020 (size: 0x1)
    EPrisonerMontage ChoppingMontage;                                                 // 0x0021 (size: 0x1)
    EPrisonerMontage ChoppingMontageEnd;                                              // 0x0022 (size: 0x1)
    bool EnforceDroppingItemOnGround;                                                 // 0x0023 (size: 0x1)
    bool ShouldResultUsesDependOnSourceHP;                                            // 0x0024 (size: 0x1)
    TArray<FChoppingIngredient> Ingredients;                                          // 0x0028 (size: 0x10)
    FPossibleChoppingTools ToolRequiredToBeInRightHand;                               // 0x0038 (size: 0x10)
    TArray<FPossibleChoppingTools> AdditionalToolsRequired;                           // 0x0048 (size: 0x10)
    TSubclassOf<class USkill> Skill;                                                  // 0x0058 (size: 0x8)
    float ExperiencePointsAwarded;                                                    // 0x0060 (size: 0x4)
    FChoppingParametersPerSkillLevel NoSkillLevelData;                                // 0x0064 (size: 0xC)
    FChoppingParametersPerSkillLevel BasicLevelData;                                  // 0x0070 (size: 0xC)
    FChoppingParametersPerSkillLevel MediumLevelData;                                 // 0x007C (size: 0xC)
    FChoppingParametersPerSkillLevel AdvancedLevelData;                               // 0x0088 (size: 0xC)

}; // Size: 0x98

struct FChoppingTool2
{
    TArray<class UBaseItemTag*> ItemTags;                                             // 0x0000 (size: 0x10)
    TSubclassOf<class UBaseItemTag> ItemTagClass;                                     // 0x0010 (size: 0x8)
    TSoftClassPtr<AItem> ItemClass;                                                   // 0x0018 (size: 0x28)
    bool OverrideChoppingTime;                                                        // 0x0040 (size: 0x1)
    float ChoppingTimeMultiplier;                                                     // 0x0044 (size: 0x4)
    bool OverrideIngredientsQuantity;                                                 // 0x0048 (size: 0x1)
    int32 IngredientsQuantityBonus;                                                   // 0x004C (size: 0x4)

}; // Size: 0x50

struct FCircularArea
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    float Radius;                                                                     // 0x000C (size: 0x4)

}; // Size: 0x10

struct FCircularAreaGroup
{
    TArray<FCircularArea> CircularAreaArray;                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCircularLayerData
{
    float CenterCutoffPercentage;                                                     // 0x0000 (size: 0x4)
    float Size;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FCircularSegmentContainer
{
    TArray<class UCircularMenuSegmentWidget*> SegmentWidgets;                         // 0x0000 (size: 0x10)
    int32 SegmentCountOverride;                                                       // 0x0010 (size: 0x4)
    float Offset;                                                                     // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FClassesArray
{
    TArray<class UClass*> Classes;                                                    // 0x0000 (size: 0x10)
    TArray<class UClass*> ProhibitedClasses;                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClearMalfunctionData
{
    bool ShouldClearMalfunction;                                                      // 0x0000 (size: 0x1)
    FBodyWeaponAnimation Animations;                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientEffectData
{
}; // Size: 0xB4

struct FClimbableObstacleInfo
{
    FVector CapsuleLocationAtAnchorZero;                                              // 0x0000 (size: 0xC)
    FRotator CapsuleRotationAtAnchor;                                                 // 0x000C (size: 0xC)
    TWeakObjectPtr<class UPrimitiveComponent> BaseComponent;                          // 0x0018 (size: 0x8)
    FPrisonerClimbAnimationInfo AnimationInfo;                                        // 0x0020 (size: 0x40)

}; // Size: 0x60

struct FCloseRangeAttackData
{
    class UAnimMontage* Montage;                                                      // 0x0000 (size: 0x8)
    float RegainControlDurationModifier;                                              // 0x0008 (size: 0x4)
    float Range;                                                                      // 0x000C (size: 0x4)
    float angle;                                                                      // 0x0010 (size: 0x4)
    float HorizontalHalfAngleRange;                                                   // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FClothesPartSet
{
    TSet<EClothesPart> ClothesParts;                                                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FCollisionPointDamageEvent : public FScumPointDamageEvent
{
}; // Size: 0x170

struct FCombinationLockGetCombinationRequestData
{
}; // Size: 0x14

struct FCombinationLockUnlockAttemptRequestData
{
}; // Size: 0x1C

struct FCombustibleItemParams
{
    float DefaultTemp;                                                                // 0x0000 (size: 0x4)
    float BurningRate;                                                                // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FCommonMaps
{
    TSoftObjectPtr<UWorld> MainMenu;                                                  // 0x0000 (size: 0x28)
    TSoftObjectPtr<UWorld> CharacterCreationMenu;                                     // 0x0028 (size: 0x28)
    TSoftObjectPtr<UWorld> Singleplayer;                                              // 0x0050 (size: 0x28)

}; // Size: 0x78

struct FCompassSkillParametersPerSkillLevel
{
    uint8 CompassSkillLevel;                                                          // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FComponentReferenceCollection
{
    TArray<FComponentSoftPtrWithZeroTransform> ComponentRefs;                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FComponentSoftPtrWithZeroTransform
{
    FTransform ZeroTransform;                                                         // 0x0000 (size: 0x30)
    FString ComponentPath;                                                            // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FConZBaseData
{
    int64 BaseId;                                                                     // 0x0000 (size: 0x8)
    FString BaseName;                                                                 // 0x0008 (size: 0x10)
    FVector2D BaseSize;                                                               // 0x0018 (size: 0x8)
    FVector BaseLocation;                                                             // 0x0020 (size: 0xC)
    int64 BaseOwnerPlayerId;                                                          // 0x0030 (size: 0x8)
    bool IsOwnedByPlayer;                                                             // 0x0038 (size: 0x1)
    FVector2D BaseBoundsMin;                                                          // 0x003C (size: 0x8)
    FVector2D BaseBoundsMax;                                                          // 0x0044 (size: 0x8)

}; // Size: 0x190

struct FConZBaseElementData
{
    int64 ElementID;                                                                  // 0x0000 (size: 0x8)
    int64 OwnerPlayerId;                                                              // 0x0008 (size: 0x8)
    int64 CreatorPrisonerId;                                                          // 0x0010 (size: 0x8)
    FString OwnerName;                                                                // 0x0018 (size: 0x10)
    FTransform Transform;                                                             // 0x0030 (size: 0x30)
    UClass* ElementClass;                                                             // 0x0060 (size: 0x8)
    float HealthPoints;                                                               // 0x0068 (size: 0x4)
    float Quality;                                                                    // 0x006C (size: 0x4)

}; // Size: 0x70

struct FConZBaseElementIdentifier
{
    int64 BaseId;                                                                     // 0x0000 (size: 0x8)
    int64 ElementID;                                                                  // 0x0008 (size: 0x8)
    FVector Location;                                                                 // 0x0010 (size: 0xC)

}; // Size: 0x20

struct FConZBaseElementInteractionData
{
    int64 BaseElementId;                                                              // 0x0000 (size: 0x8)
    uint16 GardenId;                                                                  // 0x0008 (size: 0x2)
    FVector BaseElementLocation;                                                      // 0x000C (size: 0xC)
    float RepairValue;                                                                // 0x0018 (size: 0x4)
    int64 InteractionTimestamp;                                                       // 0x0020 (size: 0x8)
    int64 IntegerData;                                                                // 0x0028 (size: 0x8)
    class UObject* PointerData;                                                       // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FConZBaseElementTransformData
{
    int64 ElementID;                                                                  // 0x0000 (size: 0x8)
    FVector Location;                                                                 // 0x0008 (size: 0xC)
    FQuat Rotation;                                                                   // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FConZBaseInteractionData
{
    int64 BaseId;                                                                     // 0x0000 (size: 0x8)
    FVector BaseLocation;                                                             // 0x0008 (size: 0xC)

}; // Size: 0x18

struct FConZBaseRepairAreaDuration
{
    int32 NumberOfBaseElementsTreshold;                                               // 0x0000 (size: 0x4)
    float RepairDuration;                                                             // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FConZCharacterTagSoundArray
{
    TArray<class UAkAudioEvent*> AudioEvents;                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FConZColorRow : public FTableRowBase
{
    FLinearColor Color;                                                               // 0x0008 (size: 0x10)
    FString Description;                                                              // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FConZConsoleVariableRow : public FTableRowBase
{
    FString ConsoleVariable;                                                          // 0x0008 (size: 0x10)
    FString Description;                                                              // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FConZDeveloperId
{
    TArray<uint8> IdArray;                                                            // 0x0000 (size: 0x10)
    EConZDeveloperIdFlag Flags;                                                       // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FConZDimensionRow : public FTableRowBase
{
    float Value;                                                                      // 0x0008 (size: 0x4)
    FString Description;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FConZElementColoringData
{
}; // Size: 0x2

struct FConZFlagElementData
{
    int64 OvertakeEndTime;                                                            // 0x0000 (size: 0x8)
    FDbIntegerId OvertakerId;                                                         // 0x0008 (size: 0x8)
    int32 NumberOfExpandedElements;                                                   // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FConZFontRow : public FTableRowBase
{
    FSlateFontInfo Font;                                                              // 0x0008 (size: 0x58)
    FString Description;                                                              // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FConZGerstnerWavesParameters
{
    float angle;                                                                      // 0x0000 (size: 0x4)
    float Height;                                                                     // 0x0004 (size: 0x4)
    float Length;                                                                     // 0x0008 (size: 0x4)
    float Steepness;                                                                  // 0x000C (size: 0x4)

}; // Size: 0x10

struct FConZItemElementData
{
}; // Size: 0x8

struct FConZMapLocationProperties
{
}; // Size: 0x3

struct FConZOceanLocationProperties
{
}; // Size: 0x24

struct FConZOnDemandElementData
{
    FConZBaseElementIdentifier ElementIdentifier;                                     // 0x0000 (size: 0x20)
    FString OwnerName;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FConZPlacementQueryParams
{
    class APrisoner* User;                                                            // 0x0000 (size: 0x8)
    UClass* ClassToSpawn;                                                             // 0x0008 (size: 0x8)
    int32 MaxInstancesPerFlagArea;                                                    // 0x0010 (size: 0x4)
    bool IsSnapping;                                                                  // 0x0014 (size: 0x1)
    bool MustBePlacedOnFoundations;                                                   // 0x0015 (size: 0x1)
    bool CanEverBePlacedOnFoundations;                                                // 0x0016 (size: 0x1)
    bool CanBePlacedOnOtherBaseElements;                                              // 0x0017 (size: 0x1)
    bool CanBePlacedWithoutFlag;                                                      // 0x0018 (size: 0x1)
    bool CanBePlacedInBuilding;                                                       // 0x0019 (size: 0x1)
    bool CanBePlacedInRestrictedArea;                                                 // 0x001A (size: 0x1)
    bool CanBePlacedInAbandonedBunker;                                                // 0x001B (size: 0x1)
    bool IgnoreDisabledBaseBuildingFlag;                                              // 0x001C (size: 0x1)
    bool ShouldUseParentClassForMaxInstances;                                         // 0x001D (size: 0x1)
    bool ShouldUseMilitaryPOIsMask;                                                   // 0x001E (size: 0x1)

}; // Size: 0x20

struct FConZSliderStyle
{
    FProgressBarStyle Slider;                                                         // 0x0000 (size: 0x1A0)
    FSlateBrush Thumb;                                                                // 0x01A0 (size: 0x88)

}; // Size: 0x228

struct FConZSquadEmblem
{
    FConZSquadEmblemElement Background;                                               // 0x0000 (size: 0x4)
    FConZSquadEmblemElement Symbol;                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FConZSquadEmblemElement
{
    uint8 ShapeIndex;                                                                 // 0x0000 (size: 0x1)
    uint8 PrimaryColorIndex;                                                          // 0x0001 (size: 0x1)
    uint8 SecondaryColorIndex;                                                        // 0x0002 (size: 0x1)
    uint8 TertiaryColorIndex;                                                         // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FConZSquadMember
{
    FDbIntegerId UserProfileId;                                                       // 0x0010 (size: 0x8)
    EConZSquadMemberRank Rank;                                                        // 0x0018 (size: 0x1)
    bool Online;                                                                      // 0x0019 (size: 0x1)
    bool InDanger;                                                                    // 0x001A (size: 0x1)
    bool IsAlive;                                                                     // 0x001B (size: 0x1)

}; // Size: 0x20

struct FConZSquadPendingMember
{
    FDbIntegerId UserProfileId;                                                       // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FConZTradeableDescRow : public FTableRowBase
{
    TSoftClassPtr<UObject> TradeableClass;                                            // 0x0008 (size: 0x28)
    bool CanBePurchasedByPlayer;                                                      // 0x0030 (size: 0x1)
    bool CanBeSoldByPlayer;                                                           // 0x0031 (size: 0x1)
    ETradeCategory TradeCategory;                                                     // 0x0032 (size: 0x1)
    TSet<ETraderType> TraderTypes;                                                    // 0x0038 (size: 0x50)
    float BasePurchasePriceModifier;                                                  // 0x0088 (size: 0x4)
    float BaseSalePriceReductionModifier;                                             // 0x008C (size: 0x4)
    ECurrencyType PurchaseCurrencyType;                                               // 0x0090 (size: 0x1)
    int32 AlternateCurrencyPurchasePrice;                                             // 0x0094 (size: 0x4)
    ETradeableSpawnType SpawnType;                                                    // 0x0098 (size: 0x1)
    FText TradingEntryCaption;                                                        // 0x00A0 (size: 0x18)
    TSoftObjectPtr<UTexture2D> TradingEntryIconTexture;                               // 0x00B8 (size: 0x28)
    int32 MaxAmountPurchasedAtOnce;                                                   // 0x00E0 (size: 0x4)
    bool IsStockAmountUnlimited;                                                      // 0x00E4 (size: 0x1)
    FGameplayTag TradeableFamePointPenaltyGroup;                                      // 0x00E8 (size: 0x8)
    int32 RequiredFamePoints;                                                         // 0x00F0 (size: 0x4)
    FGameplayTag TradeableRotationRarity;                                             // 0x00F4 (size: 0x8)
    bool OnlyAvailableAfterPlayerSale;                                                // 0x00FC (size: 0x1)
    int32 CustomStockAmountMin;                                                       // 0x0100 (size: 0x4)
    int32 CustomStockAmountMax;                                                       // 0x0104 (size: 0x4)
    TSubclassOf<class UTradeableDiscountCondition> TradeableDiscountCondition;        // 0x0108 (size: 0x8)
    FGameplayTagContainer TraderSearchTypes;                                          // 0x0110 (size: 0x20)
    FGameplayTagContainer TraderSearchRelated;                                        // 0x0130 (size: 0x20)
    bool IsImmuneToUserOverrides;                                                     // 0x0150 (size: 0x1)
    EDeluxeVersion RequiredDLC;                                                       // 0x0151 (size: 0x1)

}; // Size: 0x158

struct FConZWaterSplineControlPoint : public FSplinePoint
{
    bool selected;                                                                    // 0x0044 (size: 0x1)
    float Width;                                                                      // 0x0048 (size: 0x4)
    float MaxDepth;                                                                   // 0x004C (size: 0x4)
    float Speed;                                                                      // 0x0050 (size: 0x4)
    float Opacity;                                                                    // 0x0054 (size: 0x4)

}; // Size: 0x58

struct FConZWeaponDescRow : public FTableRowBase
{
    float Damage;                                                                     // 0x0008 (size: 0x4)
    float DamageInGameEvent;                                                          // 0x000C (size: 0x4)
    FTargetTypeDamageMultiplier TargetTypeMultiplier;                                 // 0x0010 (size: 0x10)
    float Energy;                                                                     // 0x0020 (size: 0x4)
    float SharpnessSlash;                                                             // 0x0024 (size: 0x4)
    float SharpnessPierce;                                                            // 0x0028 (size: 0x4)
    ECharacterImpactSourceSoundCategory ImpactSoundCategory;                          // 0x002C (size: 0x1)
    class UProjectileImpactEffects* ImpactEffects;                                    // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FConditionalPrisonerMovementParams
{
    FGameplayTagQuery Condition;                                                      // 0x0000 (size: 0x48)
    FPrisonerMovementParams Value;                                                    // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FConnectionSaveData
{
    FEntityComponentId ID;                                                            // 0x0000 (size: 0x10)
    float Amount;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FConsumableDigestionHandlerSave
{
    TArray<uint8> Data;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FConsumableSave
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FString MergeGroup;                                                               // 0x0010 (size: 0x10)
    float MassToConsume;                                                              // 0x0020 (size: 0x4)
    float ConsumptionDuration;                                                        // 0x0024 (size: 0x4)
    float Density;                                                                    // 0x0028 (size: 0x4)
    bool IsLiquid;                                                                    // 0x002C (size: 0x1)
    FSubstancesData Substances;                                                       // 0x0030 (size: 0xD0)
    TArray<FString> ForeignSubstanceClasses;                                          // 0x0100 (size: 0x10)
    TArray<uint8> UserData;                                                           // 0x0110 (size: 0x10)

}; // Size: 0x120

struct FContainerItemDescriptorData
{
    class UTexture2D* Icon;                                                           // 0x0038 (size: 0x8)

}; // Size: 0x60

struct FControlMappingStyle
{
    FSlateBrush FocusBackgroundImage;                                                 // 0x0000 (size: 0x88)
    FControlMappingTextStyle LabelText;                                               // 0x0088 (size: 0x68)
    FControlMappingTextStyle MappingText;                                             // 0x00F0 (size: 0x68)

}; // Size: 0x158

struct FControlMappingTextStyle
{
    FSlateFontInfo Font;                                                              // 0x0000 (size: 0x58)
    FLinearColor ColorAndOpacity;                                                     // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FControllerDigestionItem
{
}; // Size: 0x28

struct FCookedFoodIngredientNetData
{
    FPrimaryAssetId Resource;                                                         // 0x0000 (size: 0x10)
    float Mass;                                                                       // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FCookingCategoryDropdownEntryData
{
    FGameplayTag CookingCategoryTag;                                                  // 0x0000 (size: 0x8)
    FGameplayTag NavigationTag;                                                       // 0x0008 (size: 0x8)
    TArray<FGameplayTag> NavigationHistory;                                           // 0x0010 (size: 0x10)
    FText DisplayName;                                                                // 0x0020 (size: 0x18)
    int32 IndentationLevel;                                                           // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FCookingFoodProxyMesh
{
    class UStaticMesh* Mesh;                                                          // 0x0000 (size: 0x8)
    class UStaticMeshComponent* _meshComponent;                                       // 0x0090 (size: 0x8)
    class UAkComponent* _thermalSoundEffectComponent;                                 // 0x0098 (size: 0x8)
    class UAkAudioEvent* _startCookingEvent;                                          // 0x00A0 (size: 0x8)
    class UAkAudioEvent* _stopCookingEvent;                                           // 0x00A8 (size: 0x8)

}; // Size: 0xB0

struct FCookingRecipeRegistryEntry
{
    bool Enabled;                                                                     // 0x0000 (size: 0x1)
    FPrimaryAssetId AssetId;                                                          // 0x0004 (size: 0x10)

}; // Size: 0x14

struct FCookingResult
{
    TSoftClassPtr<AFoodItem> Item;                                                    // 0x0000 (size: 0x28)

}; // Size: 0x28

struct FCookingSortingDropdownEntryData
{
    FText DisplayName;                                                                // 0x0000 (size: 0x18)
    ECookingRecipesSort RecipesSort;                                                  // 0x0018 (size: 0x1)
    FSlateBrush Icon;                                                                 // 0x0020 (size: 0x88)

}; // Size: 0xA8

struct FCookingUISounds
{
    class UAkAudioEvent* AddRecipeClick;                                              // 0x0000 (size: 0x8)
    class UAkAudioEvent* DetailsButtonClick;                                          // 0x0008 (size: 0x8)
    class UAkAudioEvent* BackButtonClick;                                             // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FCookingUtilityFilterDropdownEntryData
{
    FGameplayTag CookingUtilityTag;                                                   // 0x0000 (size: 0x8)
    FText DisplayName;                                                                // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FCookingUtilityMainSnapPoint
{
    FGameplayTag UtilitySlotType;                                                     // 0x0000 (size: 0x8)
    FVector LocationOffset;                                                           // 0x0008 (size: 0xC)
    float SnapRadius;                                                                 // 0x0014 (size: 0x4)
    bool CanAllUtilityTypesBePlacedOn;                                                // 0x0018 (size: 0x1)
    FGameplayTagContainer UtilityTypesThatCanBePlaced;                                // 0x0020 (size: 0x20)
    int32 RepresentativeSlotId;                                                       // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FCookingUtilitySlot
{
    FGameplayTag UtilitySlotType;                                                     // 0x0000 (size: 0x8)
    FVector LocationOffset;                                                           // 0x0008 (size: 0xC)
    TArray<FVector> MovementEndpoints;                                                // 0x0018 (size: 0x10)
    float CircularShapeRadius;                                                        // 0x0028 (size: 0x4)
    float ThermalConduction;                                                          // 0x002C (size: 0x4)
    bool CanAllUtilityTypesBePlacedOn;                                                // 0x0030 (size: 0x1)
    FGameplayTagContainer UtilityTypesThatCanBePlaced;                                // 0x0038 (size: 0x20)
    FVector CookMeshVisualOffset;                                                     // 0x0058 (size: 0xC)
    class UCookingUtilityUIDataAsset* CookingUtilityUIDataAsset;                      // 0x0068 (size: 0x8)
    bool HighlightSlot;                                                               // 0x0070 (size: 0x1)

}; // Size: 0x88

struct FCookingUtilitySlotArray : public FFastArraySerializer
{
    TArray<FCookingUtilitySlotInstance> _slots;                                       // 0x0108 (size: 0x10)

}; // Size: 0x1D0

struct FCookingUtilitySlotInstance : public FFastArraySerializerItem
{
    FDbIntegerId _uniqueId;                                                           // 0x0020 (size: 0x8)
    FGameplayTag _utilityType;                                                        // 0x0028 (size: 0x8)
    uint8 _usage;                                                                     // 0x0030 (size: 0x1)
    FEntityId _boundCookingUtility;                                                   // 0x0038 (size: 0x8)
    class UCookingRecipe* _boundRecipe;                                               // 0x0048 (size: 0x8)
    class UCookingRecipe* _clientReservedRecipe;                                      // 0x0050 (size: 0x8)
    uint16 _repTemperature;                                                           // 0x005A (size: 0x2)
    uint16 _repCookTime;                                                              // 0x0064 (size: 0x2)
    uint8 _cookQualityPacked;                                                         // 0x0070 (size: 0x1)
    FEntityId _ownerCookingUtility;                                                   // 0x0078 (size: 0x8)
    int8 _slotItemTagArrayIndex;                                                      // 0x0094 (size: 0x1)
    float _targetCookTime;                                                            // 0x00F4 (size: 0x4)
    bool _cookingFinished;                                                            // 0x00FC (size: 0x1)
    bool _cookingStartFailed;                                                         // 0x00FD (size: 0x1)
    bool _cookingAborted;                                                             // 0x00FF (size: 0x1)
    FDbIntegerId _parentInstance;                                                     // 0x0108 (size: 0x8)

}; // Size: 0x180

struct FCookingUtilitySlotInstance_UserSetData
{
    int32 SlotId;                                                                     // 0x0000 (size: 0x4)
    TArray<uint8> InternalCoordinates;                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCookingUtilityUITableRow : public FTableRowBase
{
    FGameplayTag UtilitySlotType;                                                     // 0x0008 (size: 0x8)
    class UCookingUtilityUIDataAsset* CookingUtilityUIDataAsset;                      // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FCorpsePoseData
{
    FVector_NetQuantize Location;                                                     // 0x0000 (size: 0xC)
    FQuat Rotation;                                                                   // 0x0010 (size: 0x10)
    FVector_NetQuantize LinearVelocity;                                               // 0x0020 (size: 0xC)
    FVector_NetQuantize AngularVelocity;                                              // 0x002C (size: 0xC)

}; // Size: 0x40

struct FCorpseSkeletalMeshRepData
{
    FName DisplayName;                                                                // 0x0000 (size: 0x8)
    class USkeletalMesh* Mesh;                                                        // 0x0008 (size: 0x8)
    TArray<class UMaterialInterface*> Materials;                                      // 0x0010 (size: 0x10)
    bool Visibility;                                                                  // 0x0020 (size: 0x1)
    FTransform Transform;                                                             // 0x0030 (size: 0x30)
    FName AttachSocket;                                                               // 0x0060 (size: 0x8)

}; // Size: 0x70

struct FCorpseStaticMeshRepData
{
    FName DisplayName;                                                                // 0x0000 (size: 0x8)
    class UStaticMesh* Mesh;                                                          // 0x0008 (size: 0x8)
    TArray<class UMaterialInterface*> Materials;                                      // 0x0010 (size: 0x10)
    bool Visibility;                                                                  // 0x0020 (size: 0x1)
    FTransform Transform;                                                             // 0x0030 (size: 0x30)
    FName AttachSocket;                                                               // 0x0060 (size: 0x8)

}; // Size: 0x70

struct FCountedAmmunitionData
{
    TSoftClassPtr<AAmmunitionItem> AmmunitionItemClass;                               // 0x0000 (size: 0x28)
    float health;                                                                     // 0x0028 (size: 0x4)
    float MaxHealth;                                                                  // 0x002C (size: 0x4)
    EAmmunitionCartridgeState State;                                                  // 0x0030 (size: 0x1)
    int32 Count;                                                                      // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FCraftingCategoryData
{
    FGameplayTag Tag;                                                                 // 0x0000 (size: 0x8)
    TArray<class UCraftingRecipe*> Recipes;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCraftingCategoryTabButtonSharedStyle
{
    FLinearColor BackgroundColor;                                                     // 0x0000 (size: 0x10)
    FLinearColor IconColor;                                                           // 0x0010 (size: 0x10)
    float Scale;                                                                      // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FCraftingIngredientConsumptionData
{
    class AItem* Ingredient;                                                          // 0x0000 (size: 0x8)
    class UCraftingIngredientTag* Type;                                               // 0x0008 (size: 0x8)
    int32 Amount;                                                                     // 0x0010 (size: 0x4)
    float Multiplier;                                                                 // 0x0014 (size: 0x4)
    int32 SlotIndex;                                                                  // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FCraftingIngredientInstance
{
    class UCraftingIngredientTag* Type;                                               // 0x0000 (size: 0x8)
    float Amount;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FCraftingIngredientSlot
{
    TArray<class UCraftingIngredientTag*> AllowedTypes;                               // 0x0000 (size: 0x10)
    FPerSkillLevelIntegerData Amount;                                                 // 0x0010 (size: 0x14)
    FPerSkillLevelIntegerData AdditionalAmount;                                       // 0x0024 (size: 0x14)
    float ProductQualityInfluence;                                                    // 0x0038 (size: 0x4)
    ECraftingIngredientPurpose Purpose;                                               // 0x003C (size: 0x1)
    ECraftingIngredientMixingType MixingType;                                         // 0x003D (size: 0x1)
    bool ReturnOnUncraft;                                                             // 0x003E (size: 0x1)
    FPerSkillLevelIntegerData DamagePercentageOnUncraft;                              // 0x0040 (size: 0x14)
    bool OverrideClassRepresentativeCaption;                                          // 0x0054 (size: 0x1)
    FText ClassRepresentativeCaption;                                                 // 0x0058 (size: 0x18)

}; // Size: 0x70

struct FCraftingPanelCategoryButtonUIData
{
    FGameplayTag CategoryTag;                                                         // 0x0000 (size: 0x8)
    FGameplayTag HighlightTag;                                                        // 0x0008 (size: 0x8)
    FSlateBrush Icon;                                                                 // 0x0010 (size: 0x88)
    FText Name;                                                                       // 0x0098 (size: 0x18)
    FText Shortcut;                                                                   // 0x00B0 (size: 0x18)

}; // Size: 0xC8

struct FCraftingPart
{
    UClass* ItemClass;                                                                // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FCraftingProcess
{
    class UCraftingRecipe* _recipe;                                                   // 0x0000 (size: 0x8)
    TArray<FCraftingProcessPerIngredientSlotData> _perIngredientSlotData;             // 0x0008 (size: 0x10)

}; // Size: 0x20

struct FCraftingProcessPerIngredientSlotData
{
    int32 _requiredAmount;                                                            // 0x0000 (size: 0x4)
    int32 _providedAmount;                                                            // 0x0004 (size: 0x4)
    float _accumulatedQuality;                                                        // 0x0008 (size: 0x4)
    FSoftObjectPath _limiter;                                                         // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FCraftingRecipeAndIngredientButtonVisualData
{
    uint8 CraftingButtonsPerRowInCategory;                                            // 0x0000 (size: 0x1)
    float CraftingButtonsContainerRowWidth;                                           // 0x0004 (size: 0x4)
    float CraftingButtonsContainerButtonSpacing;                                      // 0x0008 (size: 0x4)
    FLinearColor SelectedBorderColor;                                                 // 0x000C (size: 0x10)
    FLinearColor DefaultBorderColor;                                                  // 0x001C (size: 0x10)
    FSlateBrush EmptyWidgetImage;                                                     // 0x0030 (size: 0x88)
    FSlateBrush CanCraftLinesImage;                                                   // 0x00B8 (size: 0x88)
    FSlateBrush MissingSomeIngredientsLinesImage;                                     // 0x0140 (size: 0x88)
    FSlateBrush MissingAllIngredientsLinesImage;                                      // 0x01C8 (size: 0x88)
    TSoftObjectPtr<UTexture2D> TransparentPixel;                                      // 0x0250 (size: 0x28)

}; // Size: 0x278

struct FCriminalRecordUIData
{
}; // Size: 0x238

struct FCurrencyConversionRequestData
{
}; // Size: 0x24

struct FCurrencyDescription
{
    FString CurrencySymbol;                                                           // 0x0000 (size: 0x10)
    FText CurrencyName;                                                               // 0x0010 (size: 0x18)
    FString ConfigFileSymbol;                                                         // 0x0028 (size: 0x10)
    FSlateColor UITextColor;                                                          // 0x0038 (size: 0x28)
    EBankCardType RequiredBankCardTypeToPerformTransactions;                          // 0x0060 (size: 0x1)
    bool MustBeOwnerOfBankCard;                                                       // 0x0061 (size: 0x1)

}; // Size: 0x68

struct FCustomZoneConfiguration
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    ECustomZoneEventHandlingMethod EventHandlingMethod;                               // 0x0010 (size: 0x1A)
    FLinearColor Color;                                                               // 0x002C (size: 0x10)
    FName UniqueDefaultZoneName;                                                      // 0x003C (size: 0x8)
    EDefaultCustomZoneState DefaultZoneState;                                         // 0x0044 (size: 0x1)

}; // Size: 0x48

struct FCustomZoneDisplayData
{
    FString Value;                                                                    // 0x0000 (size: 0x10)
    FText Name;                                                                       // 0x0010 (size: 0x18)
    FText Description;                                                                // 0x0028 (size: 0x18)

}; // Size: 0x40

struct FCustomZoneRegion
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FVector2D Location;                                                               // 0x0010 (size: 0x8)
    FVector2D Size;                                                                   // 0x0018 (size: 0x8)
    ECustomZoneShape Shape;                                                           // 0x0020 (size: 0x1)
    int32 ConfigurationIndex;                                                         // 0x0024 (size: 0x4)
    FName UniqueDefaultZoneName;                                                      // 0x0028 (size: 0x8)
    EDefaultCustomZoneState DefaultZoneState;                                         // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FCutsceneSubtitlesTableRow : public FTableRowBase
{
    FText _subtitleText;                                                              // 0x0008 (size: 0x18)
    FTimespan _startTime;                                                             // 0x0020 (size: 0x8)
    FTimespan _endTime;                                                               // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FDamageAdjacentAttachment
{
    float DamagePropagationMultiplier;                                                // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FDamageMultiplier
{
    float Multiplier;                                                                 // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FDamageMultiplierTracker
{
    float _baseDamage;                                                                // 0x0000 (size: 0x4)
    float _finalDamage;                                                               // 0x0004 (size: 0x4)
    TArray<FString> _appliedMultiplierNames;                                          // 0x0008 (size: 0x10)
    TArray<float> _appliedMultiplierValues;                                           // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FDamageMultipliers
{
    TSubclassOf<class AActor> DamageCauserClass;                                      // 0x0000 (size: 0x8)
    TArray<FMultiplierByClass> DamageMultipliers;                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FDamageTargetTypeMapping
{
    EDamageTargetType Type;                                                           // 0x0000 (size: 0x1)
    TArray<class UClass*> Classes;                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FDashboardMaterialParameter
{
    FName MaterialSlotName;                                                           // 0x0000 (size: 0x8)
    FName MaterialParameterName;                                                      // 0x0008 (size: 0x8)
    class UMaterialInstanceDynamic* DynamicMaterial;                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FDashboardMaterialParameterCache
{
    FDashboardMaterialParameter _speedParam;                                          // 0x0008 (size: 0x20)
    FDashboardMaterialParameter _rpmParam;                                            // 0x0028 (size: 0x20)
    FDashboardMaterialParameter _fuelRatioParam;                                      // 0x0048 (size: 0x20)
    FDashboardMaterialParameter _batteryRatioParam;                                   // 0x0068 (size: 0x20)
    FDashboardMaterialParameter _handbrakeParam;                                      // 0x0088 (size: 0x20)
    FDashboardMaterialParameter _lightsParam;                                         // 0x00A8 (size: 0x20)
    FDashboardMaterialParameter _engineParam;                                         // 0x00C8 (size: 0x20)
    FDashboardMaterialParameter _gearParam;                                           // 0x00E8 (size: 0x20)

}; // Size: 0x110

struct FDbIntegerId
{
    int64 Value;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FDcxVehicleTireParticleData
{
    float MinLateralSlip;                                                             // 0x0000 (size: 0x4)
    float MaxLateralSlip;                                                             // 0x0004 (size: 0x4)
    float MinLongitudinalSlip;                                                        // 0x0008 (size: 0x4)
    float MaxLongitudinalSlip;                                                        // 0x000C (size: 0x4)
    float ParticleScaleModifier;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FDcxWheeledVehicleFlatTireWheelConfiguration
{
    FDcxVehicleWheelData FlatTireWheelData;                                           // 0x0000 (size: 0x20)
    class UDcxVehicleTire* FlatTire;                                                  // 0x0040 (size: 0x8)
    class UDcxVehicleTire* OriginalTire;                                              // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FDcxWheeledVehicleTireEffectProperties
{
    FVector TireLocalOffset;                                                          // 0x0000 (size: 0xC)

}; // Size: 0x14

struct FDeathmatchParameters
{
    int32 RoundScoreLimit;                                                            // 0x0000 (size: 0x4)
    float AreaRestrictionInterval;                                                    // 0x0004 (size: 0x4)
    float AreaRestrictionDuration;                                                    // 0x0008 (size: 0x4)
    float AreaRestrictionStep;                                                        // 0x000C (size: 0x4)
    float BarrierHeatUpDuration;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FDeluxeVersion
{
}; // Size: 0xC

struct FDemolitionSkillExperienceAwards
{
    float PointsForArmedTrap;                                                         // 0x0000 (size: 0x4)
    float PointsForDisarmedOwnedTrap;                                                 // 0x0004 (size: 0x4)
    float PointsForDisarmedEnemyTrap;                                                 // 0x0008 (size: 0x4)
    float PointsForDisarmedPracticeTrap;                                              // 0x000C (size: 0x4)
    float PointsDecreasePerPracticeTrapTimerSecondsIncrease;                          // 0x0010 (size: 0x4)
    float PointsIncreasePerPracticeTrapTimerSecondsDecrease;                          // 0x0014 (size: 0x4)
    float PointsForAddedTrigger;                                                      // 0x0018 (size: 0x4)
    float PointsForCraftedTrap;                                                       // 0x001C (size: 0x4)

}; // Size: 0x20

struct FDemolitionSkillParametersPerSkillLevel
{
    float TrapQuality;                                                                // 0x0000 (size: 0x4)
    int32 NumberOfWires;                                                              // 0x0004 (size: 0x4)
    int32 GreenWiresNumber;                                                           // 0x0008 (size: 0x4)
    int32 RedWiresNumber;                                                             // 0x000C (size: 0x4)
    int32 NumberOfDefuseAttempts;                                                     // 0x0010 (size: 0x4)
    TMap<class ETrapType, class FDemolitionSkillParametersPerTrapType> ParametersPerTrapType; // 0x0018 (size: 0x50)

}; // Size: 0x68

struct FDemolitionSkillParametersPerTrapType
{
    float DefuseTime;                                                                 // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FDerivedPrisonerSkillComponentUIData
{
}; // Size: 0x38

struct FDetectionDelayTimerData
{
    float MinDetectionDelayBasedOnDistance;                                           // 0x0000 (size: 0x4)
    float MaxDetectionDelayBasedOnDistance;                                           // 0x0004 (size: 0x4)
    float MinDetectionDelayBasedOnVisibility;                                         // 0x0008 (size: 0x4)
    float MaxDetectionDelayBasedOnVisibility;                                         // 0x000C (size: 0x4)

}; // Size: 0x10

struct FDialogueInfo
{
    EDialogueType DialogueType;                                                       // 0x0000 (size: 0x1)
    class UAkAudioEvent* VoiceOver;                                                   // 0x0008 (size: 0x8)
    FText Text;                                                                       // 0x0010 (size: 0x18)
    TArray<FDialogueSurvivalTipData> SurvivalTips;                                    // 0x0028 (size: 0x10)
    float Duration;                                                                   // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FDialogueInfoContainer
{
    TArray<FDialogueInfo> DialogueInfos;                                              // 0x0000 (size: 0x10)
    FName NextDialogueName;                                                           // 0x0010 (size: 0x8)
    float NextDialogueDelay;                                                          // 0x0018 (size: 0x4)
    int32 PriorityLevel;                                                              // 0x001C (size: 0x4)

}; // Size: 0x20

struct FDialogueSurvivalTipData
{
    FName SurvivalTipName;                                                            // 0x0000 (size: 0x8)
    float SurvivalTipDelay;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FDigestionItemSave
{
    FConsumableSave Consumable;                                                       // 0x0000 (size: 0x120)
    float RemainingMassToConsume;                                                     // 0x0120 (size: 0x4)
    float MassConsumed;                                                               // 0x0124 (size: 0x4)
    float MassAbsorbed;                                                               // 0x0128 (size: 0x4)
    FSubstancesData SubstancesInStomach;                                              // 0x0130 (size: 0xD0)
    FSubstancesData SubstancesInIntestine;                                            // 0x0200 (size: 0xD0)
    TArray<FConsumableDigestionHandlerSave> DigestionHandlers;                        // 0x02D0 (size: 0x10)

}; // Size: 0x2E0

struct FDistantLevelDescription
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)
    EDistantMeshStreamingBehavior MeshStreamingBehavior;                              // 0x0040 (size: 0x1)
    float MaxDrawDistance;                                                            // 0x0044 (size: 0x4)
    bool NeverDistanceCull;                                                           // 0x0048 (size: 0x1)
    FBoxSphereBounds MeshBounds;                                                      // 0x004C (size: 0x1C)
    TSoftObjectPtr<UStaticMesh> CollisionMesh;                                        // 0x0068 (size: 0x28)
    TArray<TSoftObjectPtr<UStaticMesh>> MeshLODs;                                     // 0x0090 (size: 0x10)

}; // Size: 0xA0

struct FDoorEntityRepData
{
    FDbIntegerId OwningUserProfileId;                                                 // 0x0000 (size: 0x8)
    FDbIntegerId BaseElementDoorId;                                                   // 0x0008 (size: 0x8)
    EAccessLevel AccessLevel;                                                         // 0x0010 (size: 0x1)
    TArray<FDoorEntityUpgradeLock> Locks;                                             // 0x0018 (size: 0x10)
    TArray<FDoorEntityUpgradeAttachment> Attachments;                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FDoorEntityUpgradeAttachment
{
    float PassiveItemHealthNormalized;                                                // 0x0000 (size: 0x4)
    TSoftClassPtr<AActor> Class;                                                      // 0x0008 (size: 0x28)
    FEntityId AttachedEntityId;                                                       // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FDoorEntityUpgradeLock
{
    float ItemHealthNormalized;                                                       // 0x0000 (size: 0x4)
    TSoftClassPtr<AItem> Class;                                                       // 0x0008 (size: 0x28)
    class ULockData* LockData;                                                        // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FDoorRepData
{
    bool IsBrokenDown;                                                                // 0x0000 (size: 0x1)
    EDoorStateFlags StateFlags;                                                       // 0x0001 (size: 0x1)
    FEntityId EntityId;                                                               // 0x0008 (size: 0x8)
    FDoorEntityRepData EntityRepData;                                                 // 0x0010 (size: 0x38)

}; // Size: 0x48

struct FDoorUnlockDataCollection
{
    TArray<FDoorUnlockDataDescription> Data;                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FDoorUnlockDataDescription
{
    TSubclassOf<class UDoorUnlockData> DoorUnlockData;                                // 0x0000 (size: 0x8)
    int32 ProbabilityCount;                                                           // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FDrivingSkillEngineStallingParameters
{
    float Chance;                                                                     // 0x0000 (size: 0x4)
    float MinDuration;                                                                // 0x0004 (size: 0x4)
    float MaxDuration;                                                                // 0x0008 (size: 0x4)
    float StopEngineChance;                                                           // 0x000C (size: 0x4)
    class UCurveFloat* ThrottleCurve;                                                 // 0x0010 (size: 0x8)
    float ThrottleCurveFrequencyMultiplier;                                           // 0x0018 (size: 0x4)
    class UCurveFloat* BrakeCurve;                                                    // 0x0020 (size: 0x8)
    float BrakeCurveFrequencyMultiplier;                                              // 0x0028 (size: 0x4)
    float ForceMagnitudeScale;                                                        // 0x002C (size: 0x4)
    class UCurveFloat* ForceMagnitudeScaleCurve;                                      // 0x0030 (size: 0x8)
    float ForceMagnitudeScaleCurveFrequencyMultiplier;                                // 0x0038 (size: 0x4)
    float ForceDirectionRandomizationAngle;                                           // 0x003C (size: 0x4)

}; // Size: 0x40

struct FDrivingSkillParametersPerSkillLevel
{
    float EngineStartViaMotionDuration;                                               // 0x0000 (size: 0x4)
    float EngineStartViaMotionFailureChance;                                          // 0x0004 (size: 0x4)
    float EngineReadyDelay;                                                           // 0x0008 (size: 0x4)
    float EngineFailedToStartDelay;                                                   // 0x000C (size: 0x4)
    float EngineFailedToStartNoFuelDelay;                                             // 0x0010 (size: 0x4)
    float EngineFailedToStartNoBatteryDelay;                                          // 0x0014 (size: 0x4)
    float EngineStalledDelay;                                                         // 0x0018 (size: 0x4)
    float MaxSpeedModifier;                                                           // 0x001C (size: 0x4)
    float ThrottleModifier;                                                           // 0x0020 (size: 0x4)
    float BrakeModifier;                                                              // 0x0024 (size: 0x4)
    float WheelSteeringLerpSpeedMultiplier;                                           // 0x0028 (size: 0x4)
    FEngineHandlingParameters EngineHandlingParameters;                               // 0x002C (size: 0x8)
    FGearboxHandlingParameters GearboxHandlingParameters;                             // 0x0034 (size: 0xC)
    FDrivingSkillEngineStallingParameters EngineStallingByAccelerationParameters;     // 0x0040 (size: 0x40)
    FDrivingSkillEngineStallingParameters EngineStallingByUpShiftParameters;          // 0x0080 (size: 0x40)
    FDrivingSkillEngineStallingParameters EngineStallingWhenStartingViaMotion;        // 0x00C0 (size: 0x40)

}; // Size: 0x100

struct FDroneVisitTimeData
{
    float MinVisitTime;                                                               // 0x0000 (size: 0x4)
    float MaxVisitTime;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FDropZoneParameters
{
    float IntroAnnouncementDelay;                                                     // 0x0000 (size: 0x4)
    float WarmupPhaseDuration;                                                        // 0x0004 (size: 0x4)
    float CrateDropDuration;                                                          // 0x0008 (size: 0x4)
    float SearchPhaseTimeLimit;                                                       // 0x000C (size: 0x4)
    float CargoDropDuration;                                                          // 0x0010 (size: 0x4)
    float CapturePhaseTimeLimit;                                                      // 0x0014 (size: 0x4)
    float CargoOpeningDuration;                                                       // 0x0018 (size: 0x4)
    bool SkipKeyPhase;                                                                // 0x001C (size: 0x1)
    FGameEventRewardPoints PointsPerActivation;                                       // 0x0020 (size: 0xC)

}; // Size: 0x2C

struct FDropshipDamageEffectData
{
    class UNiagaraSystem* ParticleSystem;                                             // 0x0000 (size: 0x8)
    float EffectsScaleDistanceStart;                                                  // 0x0008 (size: 0x4)
    float EffectsScaleDistanceRange;                                                  // 0x000C (size: 0x4)
    float EffectsScaleByDistanceFactor;                                               // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FDropshipDataPerStance
{
    float MaxSpeed;                                                                   // 0x0000 (size: 0x4)
    float MaxAcceleration;                                                            // 0x0004 (size: 0x4)
    float BrakingFriction;                                                            // 0x0008 (size: 0x4)
    FRotator RotationChangeRate;                                                      // 0x000C (size: 0xC)

}; // Size: 0x18

struct FDummyCollisionCapsuleInfo
{
    TWeakObjectPtr<class AActor> AttachParent;                                        // 0x0000 (size: 0x8)
    FGameplayTag Attachment;                                                          // 0x0008 (size: 0x8)
    FTransform RelativeTransform;                                                     // 0x0010 (size: 0x30)
    float UnscaledRadius;                                                             // 0x0040 (size: 0x4)
    float UnscaledHalfHeight;                                                         // 0x0044 (size: 0x4)

}; // Size: 0x50

struct FEconomyManagerRequestData
{
}; // Size: 0xB0

struct FEditableParameter
{
    FString Name;                                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FElementMorphQuery
{
    bool DebugSolo;                                                                   // 0x0000 (size: 0x1)
    FName QueryName;                                                                  // 0x0004 (size: 0x8)
    TArray<FElementQueryMarker> Markers;                                              // 0x0010 (size: 0x10)
    class UStaticMesh* StaticMesh;                                                    // 0x0020 (size: 0x8)
    FElementSnapMarkerOverride MarkersOverride;                                       // 0x0028 (size: 0x18)

}; // Size: 0x50

struct FElementQueryMarker
{
    bool Include;                                                                     // 0x0000 (size: 0x1)
    TSubclassOf<class UModularBaseBuildingSocketType> SocketClass;                    // 0x0008 (size: 0x8)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FElementSnapMarker
{
    FTransform Transform;                                                             // 0x0000 (size: 0x30)
    FVector Slack;                                                                    // 0x0030 (size: 0xC)
    bool HangOnOtherElement;                                                          // 0x003C (size: 0x1)
    bool HasForbiddenArea;                                                            // 0x003D (size: 0x1)
    FVector ForbiddenAreaCenter;                                                      // 0x0040 (size: 0xC)
    FVector ForbiddenAreaExtent;                                                      // 0x004C (size: 0xC)
    bool ElementTypesMustMatch;                                                       // 0x0058 (size: 0x1)
    bool IncreaseLevelOnSnap;                                                         // 0x0059 (size: 0x1)
    uint8 MaxLevelToSnap;                                                             // 0x005A (size: 0x1)
    FVector RequiredElementSize;                                                      // 0x005C (size: 0xC)
    FVector RequiredElementSizeTolerance;                                             // 0x0068 (size: 0xC)
    bool DestroySnappedElementWhenDestroyed;                                          // 0x0074 (size: 0x1)
    uint16 OutSocketTypes;                                                            // 0x0076 (size: 0x2)
    uint16 InSocketTypes;                                                             // 0x0078 (size: 0x2)

}; // Size: 0x80

struct FElementSnapMarkerOverride
{
    ESnapMarkerOverrideType OverrideType;                                             // 0x0000 (size: 0x1)
    TArray<FName> SnapMarkersToRemove;                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FEncounterGroupedCharacterSpawnPoint
{
    FBox GroupBounds;                                                                 // 0x0000 (size: 0x1C)
    TArray<FTransform> SpawnTransforms;                                               // 0x0020 (size: 0x10)
    ESpawnType Type;                                                                  // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FEncounterLegacyCharacterSpawnPoint
{
    ESpawnType Type;                                                                  // 0x0000 (size: 0x1)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FEncounterSpawnPointTypeArrayData
{
    uint8 SpawnPointTypes;                                                            // 0x0000 (size: 0x1)
    ESpawnType SpawnType;                                                             // 0x0001 (size: 0x1)
    TArray<FEncounterSpawnTypeData> HiddenSpawnTypeDataArray;                         // 0x0008 (size: 0x10)
    int32 MinimumNecessarySpawnedCharacterNum;                                        // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FEncounterSpawnTypeArrayData
{
    TArray<FEncounterSpawnTypeData> HiddenSpawnTypeDataArray;                         // 0x0000 (size: 0x10)
    int32 MinimumNecessarySpawnedCharacterNum;                                        // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FEncounterSpawnTypeData
{
    ECharacterHiddenSpawnType HiddenSpawnType;                                        // 0x0000 (size: 0x1)
    float Weight;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FEncounterStaticZoneDescription
{
    FTransform _transform;                                                            // 0x0010 (size: 0x30)
    float _semiXAxisSize;                                                             // 0x0040 (size: 0x4)
    float _semiYAxisSize;                                                             // 0x0044 (size: 0x4)
    float _zoneActivationRadiusMultiplier;                                            // 0x0048 (size: 0x4)
    float _LPCZoneActivationRadiusMultiplier;                                         // 0x004C (size: 0x4)
    FBox _boundingBox;                                                                // 0x0050 (size: 0x1C)
    FBox _zoneActivationBoundingBox;                                                  // 0x006C (size: 0x1C)
    FBox _LPCZoneActivationBoundingBox;                                               // 0x0088 (size: 0x1C)
    TArray<FTransform> _flyingSpawnedCharacterApproachLocations;                      // 0x00A8 (size: 0x10)
    class UEncounterZoneData* _zoneData;                                              // 0x00B8 (size: 0x8)
    class UEncounterZoneData* _lpcZoneData;                                           // 0x00C0 (size: 0x8)
    TArray<FEncounterSubZoneData> _subZoneData;                                       // 0x00C8 (size: 0x10)

}; // Size: 0x160

struct FEncounterSubZoneBoxData
{
    FBox AreaBox;                                                                     // 0x0000 (size: 0x1C)
    FRotator BoxRotation;                                                             // 0x001C (size: 0xC)

}; // Size: 0x28

struct FEncounterSubZoneData
{
    TArray<FEncounterSubZoneBoxData> BoxDataArray;                                    // 0x0000 (size: 0x10)
    FBox SubZoneBox;                                                                  // 0x0010 (size: 0x1C)
    bool ShouldInstantlyLoadAllNecessaryClasses;                                      // 0x002C (size: 0x1)
    class UEncounterZoneData* EncounterZoneData;                                      // 0x0030 (size: 0x8)
    int32 SubZonePriority;                                                            // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FEncounterSubZoneEditorData
{
    TArray<FEncounterZoneSubZoneBoxComponentEditorData> VisualizationBoxes;           // 0x0000 (size: 0x10)
    FEncounterSubZoneData ZoneData;                                                   // 0x0010 (size: 0x40)
    FColor VisualizationBoxColor;                                                     // 0x0050 (size: 0x4)
    bool ShouldInstantlyLoadAllCharacterClasses;                                      // 0x0054 (size: 0x1)

}; // Size: 0x58

struct FEncounterZoneSubZoneBoxComponentEditorData
{
    class UEncounterZoneSubZoneBoxComponent* BoxComponent;                            // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FEnduranceSkillExperienceAwards
{
    float PointsPerMinuteOfWalking;                                                   // 0x0000 (size: 0x4)
    float PointsPerMinuteOfJogging;                                                   // 0x0004 (size: 0x4)
    float PointsPerMinuteOfRunning;                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FEnduranceSkillParametersPerSkillLevel
{
    FExperienceDependentFloat EnergyConsumptionMultiplier;                            // 0x0000 (size: 0x8)
    FExperienceDependentFloat WaterConsumptionMultiplier;                             // 0x0008 (size: 0x8)
    FExperienceDependentFloat StaminaRecoveryMultiplier;                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FEngineHandlingParameters
{
    float IgnitionDurationMultiplier;                                                 // 0x0000 (size: 0x4)
    float IgnitionFailureChance;                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FEngineeringEventData
{
}; // Size: 0x8

struct FEngineeringSkillExperienceAwards
{
    float RepairExperienceMultiplier;                                                 // 0x0000 (size: 0x4)
    float FillFuelExperienceMultiplier;                                               // 0x0004 (size: 0x4)
    float DrainFuelExperienceMultiplier;                                              // 0x0008 (size: 0x4)
    float ChargeBatteryExperienceMultiplier;                                          // 0x000C (size: 0x4)

}; // Size: 0x10

struct FEngineeringSkillParametersPerSkillLevel
{
    float RepairRadius;                                                               // 0x0000 (size: 0x4)
    float RepairTimeMultiplier;                                                       // 0x0004 (size: 0x4)
    float ResultQuality;                                                              // 0x0008 (size: 0x4)
    float ToolUsageMultiplier;                                                        // 0x000C (size: 0x4)
    float FillFuelDurationMultiplier;                                                 // 0x0010 (size: 0x4)
    float DrainFuelDurationMultiplier;                                                // 0x0014 (size: 0x4)
    float ChargeBatteryDurationMultiplier;                                            // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FEntityComponentId
{
    FEntityId EntityId;                                                               // 0x0000 (size: 0x8)
    FName ComponentName;                                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FEntityId
{
    int64 Value;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FEntitySetup_Component
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    class UEntityComponentSetup* Component;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FEntityToCreateOnStartupParams
{
    TSubclassOf<class UEntitySetup> Entity;                                           // 0x0000 (size: 0x8)
    bool CreateOnServer;                                                              // 0x0008 (size: 0x1)
    bool CreateOnClient;                                                              // 0x0009 (size: 0x1)
    bool CreateInShippingBuilds;                                                      // 0x000A (size: 0x1)

}; // Size: 0x10

struct FEnvironmentDescription
{
    EEnvironmentClass EnvironmentClass;                                               // 0x0000 (size: 0x1)
    bool IsUnderground;                                                               // 0x0001 (size: 0x1)
    bool IsAbandonedBunker;                                                           // 0x0002 (size: 0x1)
    bool ShouldBlockWeatherEffects;                                                   // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FEventsRankingStats
{
    float FamePoints;                                                                 // 0x0008 (size: 0x4)
    int32 FameLevel;                                                                  // 0x000C (size: 0x4)
    float EventScore;                                                                 // 0x0010 (size: 0x4)
    int32 EventKills;                                                                 // 0x0014 (size: 0x4)
    int32 EventTeamKills;                                                             // 0x0018 (size: 0x4)
    int32 EventDeaths;                                                                // 0x001C (size: 0x4)
    int32 EventSuicides;                                                              // 0x0020 (size: 0x4)
    int32 EventAssists;                                                               // 0x0024 (size: 0x4)
    int32 EventHeadshots;                                                             // 0x0028 (size: 0x4)
    bool IsBanned;                                                                    // 0x002C (size: 0x1)

}; // Size: 0x30

struct FEventsRankingStatsItem
{
    int32 Rank;                                                                       // 0x0000 (size: 0x4)
    FString PlayerName;                                                               // 0x0008 (size: 0x10)
    FEventsRankingStats CharacterStats;                                               // 0x0018 (size: 0x30)

}; // Size: 0x48

struct FEventsUISounds
{
    class UAkAudioEvent* EventSelectionCollapseExpandToggleClick;                     // 0x0000 (size: 0x8)
    class UAkAudioEvent* EventSelectionClick;                                         // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FExamineItemSpawnerConstraint_MaxOccurrencesPerSpawnTypes
{
    FGameplayTagContainer ItemSpawnTypes;                                             // 0x0000 (size: 0x20)
    int32 MaxNumberOfOccurrences;                                                     // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FExamineItemSpawnerData
{
    int32 MinQuantity;                                                                // 0x0000 (size: 0x4)
    int32 MaxQuantity;                                                                // 0x0004 (size: 0x4)
    bool AllowDuplicates;                                                             // 0x0008 (size: 0x1)
    FItemSpawnerDataBasedOnPreset Spawner;                                            // 0x0010 (size: 0x90)
    TArray<FExamineItemSpawnerConstraint_MaxOccurrencesPerSpawnTypes> MaxOccurrencesPerSpawnTypes; // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FExperienceDependentFloat
{
    float ValueWhenExperienceIsMinimal;                                               // 0x0000 (size: 0x4)
    float ValueWhenExperienceIsMaximal;                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FExplosionRadialDamageEvent : public FScumRadialDamageEvent
{
    TSubclassOf<class UDamageCustomization> DamageCustomizationClass;                 // 0x0048 (size: 0x8)
    float Force;                                                                      // 0x0050 (size: 0x4)
    FTargetTypeDamageMultiplier TargetTypeMultiplier;                                 // 0x0058 (size: 0x10)
    class UObject* DamageDealer;                                                      // 0x0068 (size: 0x8)
    class AActor* DirectlyHitActor;                                                   // 0x0070 (size: 0x8)
    FName BoneName;                                                                   // 0x0078 (size: 0x8)
    bool IsEventDamage;                                                               // 0x0080 (size: 0x1)
    UClass* OriginatingWeapon;                                                        // 0x0088 (size: 0x8)

}; // Size: 0xB8

struct FFamePointAwards
{
    float BaseFameInflux;                                                             // 0x0000 (size: 0x4)
    float MovingOnFoot;                                                               // 0x0004 (size: 0x4)
    float MovingDriving;                                                              // 0x0008 (size: 0x4)
    float MovingFlying;                                                               // 0x000C (size: 0x4)
    float RustyLockLockpick;                                                          // 0x0010 (size: 0x4)
    float IronLockLockpick;                                                           // 0x0014 (size: 0x4)
    float SilverLockLockpick;                                                         // 0x0018 (size: 0x4)
    float GoldLockLockpick;                                                           // 0x001C (size: 0x4)
    float DialLockLockpick;                                                           // 0x0020 (size: 0x4)
    float BombDefuse;                                                                 // 0x0024 (size: 0x4)
    float OwningTheBase;                                                              // 0x0028 (size: 0x4)
    FTimespan MaxTimeFromLastLogin;                                                   // 0x0030 (size: 0x8)
    float BaseOvertakeMultiplier;                                                     // 0x0038 (size: 0x4)
    float VehicleSold;                                                                // 0x003C (size: 0x4)
    float WheelBarrowSold;                                                            // 0x0040 (size: 0x4)
    float AcquiredGoldCreditCard;                                                     // 0x0044 (size: 0x4)
    float TreatedWoundC1;                                                             // 0x0048 (size: 0x4)
    float TreatedWoundC2;                                                             // 0x004C (size: 0x4)
    float TreatedWoundC3;                                                             // 0x0050 (size: 0x4)
    float TreatedWoundC4;                                                             // 0x0054 (size: 0x4)
    float CuredInfectionC1;                                                           // 0x0058 (size: 0x4)
    float CuredInfectionC2;                                                           // 0x005C (size: 0x4)
    float CuredInfectionC3;                                                           // 0x0060 (size: 0x4)
    float CuredSepsis;                                                                // 0x0064 (size: 0x4)
    float AbundantFishCaughtMultiplier;                                               // 0x0068 (size: 0x4)
    float CommonFishCaughtMultiplier;                                                 // 0x006C (size: 0x4)
    float UncommonFishCaughtMultiplier;                                               // 0x0070 (size: 0x4)
    float RareFishCaughtMultiplier;                                                   // 0x0074 (size: 0x4)
    float VeryRareFishCaughtMultiplier;                                               // 0x0078 (size: 0x4)
    float ExtremelyRareFishCaughtMultiplier;                                          // 0x007C (size: 0x4)
    float FishCaughtFamePointsPerKg;                                                  // 0x0080 (size: 0x4)
    float ConsecutivelyKept50Fish;                                                    // 0x0084 (size: 0x4)
    float ConsecutivelyReleased50Fish;                                                // 0x0088 (size: 0x4)
    float UnlockedDoorKillbox;                                                        // 0x008C (size: 0x4)
    float SurvivedConsecutiveDays2;                                                   // 0x0090 (size: 0x4)
    float SurvivedConsecutiveDays4;                                                   // 0x0094 (size: 0x4)
    float SurvivedConsecutiveDays8;                                                   // 0x0098 (size: 0x4)
    float SurvivedConsecutiveDays16;                                                  // 0x009C (size: 0x4)
    float SurvivedConsecutiveDays32;                                                  // 0x00A0 (size: 0x4)
    float EscapedSharkBite;                                                           // 0x00A4 (size: 0x4)
    float PuppetKills;                                                                // 0x00A8 (size: 0x4)
    float PuppetKills10;                                                              // 0x00AC (size: 0x4)
    float PuppetKills100;                                                             // 0x00B0 (size: 0x4)
    float PuppetKills500;                                                             // 0x00B4 (size: 0x4)
    float AnimalKills;                                                                // 0x00B8 (size: 0x4)
    float AnimalKills10;                                                              // 0x00BC (size: 0x4)
    float AnimalKills100;                                                             // 0x00C0 (size: 0x4)
    float AnimalKills500;                                                             // 0x00C4 (size: 0x4)
    float FirearmKills10;                                                             // 0x00C8 (size: 0x4)
    float FirearmKills100;                                                            // 0x00CC (size: 0x4)
    float FirearmKills500;                                                            // 0x00D0 (size: 0x4)
    float FirearmHeadShotOver200m;                                                    // 0x00D4 (size: 0x4)
    float BowHeadshotOver100m;                                                        // 0x00D8 (size: 0x4)
    float MeleeKills10;                                                               // 0x00DC (size: 0x4)
    float MeleeKills100;                                                              // 0x00E0 (size: 0x4)
    float MeleeKills500;                                                              // 0x00E4 (size: 0x4)
    float BareHandedKills10;                                                          // 0x00E8 (size: 0x4)
    float BareHandedKills100;                                                         // 0x00EC (size: 0x4)
    float BareHandedKills500;                                                         // 0x00F0 (size: 0x4)
    float FinishedHauntedHouseRitual;                                                 // 0x00F4 (size: 0x4)
    float SkillLeveledUpToBasic;                                                      // 0x00F8 (size: 0x4)
    float SkillLeveledUpToMedium;                                                     // 0x00FC (size: 0x4)
    float SkillLeveledUpToAdvanced;                                                   // 0x0100 (size: 0x4)
    float SkillLeveledUpToAdvancedPlus;                                               // 0x0104 (size: 0x4)
    float MaxedOutAttributes;                                                         // 0x0108 (size: 0x4)
    float Decontaminated;                                                             // 0x010C (size: 0x4)
    float WashedClothing;                                                             // 0x0110 (size: 0x4)
    float LandedWithParachute;                                                        // 0x0114 (size: 0x4)
    float BuiltGarden;                                                                // 0x0118 (size: 0x4)
    float SeedsPlanted;                                                               // 0x011C (size: 0x4)
    float SuccessfulHarvest;                                                          // 0x0120 (size: 0x4)
    float WeedsPlucked;                                                               // 0x0124 (size: 0x4)
    float CollectedSeeds;                                                             // 0x0128 (size: 0x4)
    float AppliedPesticideOrFungicide;                                                // 0x012C (size: 0x4)
    float HadPlasticSurgery;                                                          // 0x0130 (size: 0x4)

}; // Size: 0x138

struct FFamePointPenalties
{
    float IronLockLockpick;                                                           // 0x0000 (size: 0x4)
    float SilverLockLockpick;                                                         // 0x0004 (size: 0x4)
    float GoldLockLockpick;                                                           // 0x0008 (size: 0x4)
    float DialLockLockpick;                                                           // 0x000C (size: 0x4)
    float VehiclePurchased;                                                           // 0x0010 (size: 0x4)
    float WheelBarrowPurchased;                                                       // 0x0014 (size: 0x4)
    float PrisonerCommittedSuicide;                                                   // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FFarmingSkillParametersPerSkillLevel
{
    float PlantingSeedTime;                                                           // 0x0000 (size: 0x4)
    float PlantingSeedTimeDecreaseByStrength;                                         // 0x0004 (size: 0x4)
    float FertilizingTime;                                                            // 0x0008 (size: 0x4)
    float WateringTime;                                                               // 0x000C (size: 0x4)
    float WeedingByHandTime;                                                          // 0x0010 (size: 0x4)
    float WeedingByToolTime;                                                          // 0x0014 (size: 0x4)
    float ApplyWeedRepellentTime;                                                     // 0x0018 (size: 0x4)
    float ApplyPesticideTime;                                                         // 0x001C (size: 0x4)
    float GardenSlotCraftTime;                                                        // 0x0020 (size: 0x4)
    float RemovePlantTime;                                                            // 0x0024 (size: 0x4)
    float RemovePlantTimeDecreaseByStrength;                                          // 0x0028 (size: 0x4)
    float DestroyGardenTime;                                                          // 0x002C (size: 0x4)
    float DestroyGardenTimeDecreaseByStrength;                                        // 0x0030 (size: 0x4)
    float BaseMultiplier;                                                             // 0x0034 (size: 0x4)
    float ExpMultiplier;                                                              // 0x0038 (size: 0x4)
    float SuccessfulHarvestChancePercentage;                                          // 0x003C (size: 0x4)
    FInt32Interval SuccessfulHarvestNumItemsToSpawn;                                  // 0x0040 (size: 0x8)
    float SkillLevelBonusExperience;                                                  // 0x0048 (size: 0x4)
    float PlantingSeedExperience;                                                     // 0x004C (size: 0x4)
    float AddFertilizerExperience;                                                    // 0x0050 (size: 0x4)
    float WateringPlantExperiencePerLiter;                                            // 0x0054 (size: 0x4)
    float ReachingNextPlantStageExperience;                                           // 0x0058 (size: 0x4)
    float WeedingByHandExperience;                                                    // 0x005C (size: 0x4)
    float WeedingByToolExperience;                                                    // 0x0060 (size: 0x4)
    float ApplyWeedRepellentExperience;                                               // 0x0064 (size: 0x4)
    float ApplyPesticideExperience;                                                   // 0x0068 (size: 0x4)
    float CraftGardenExperience;                                                      // 0x006C (size: 0x4)

}; // Size: 0x70

struct FFillItemWithReplenishableResourceInteractionData
{
    FText InteractionCaptionOverride;                                                 // 0x0000 (size: 0x18)
    bool CanShowDrinkAsDefaultInteraction;                                            // 0x0018 (size: 0x1)
    float BaseActionDuration;                                                         // 0x001C (size: 0x4)
    float ActionDurationPerAmountFilled;                                              // 0x0020 (size: 0x4)
    float ResourceFillingExperiencePerAmount;                                         // 0x0024 (size: 0x4)
    class UAnimMontage* PrisonerFillingMontage;                                       // 0x0028 (size: 0x8)
    class UAkAudioEvent* StartItemNoiseAudioEvent;                                    // 0x0030 (size: 0x8)
    class UAkAudioEvent* StopItemNoiseAudioEvent;                                     // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FFilteredPrimaryAssetId
{
    FPrimaryAssetId Value;                                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFireAnimationData
{
    FBodyWeaponAnimation BodyWeaponAnimation;                                         // 0x0000 (size: 0x10)
    float TimeBetweenShots;                                                           // 0x0010 (size: 0x4)
    FBodyWeaponAnimation BodyWeaponAnimationChamber;                                  // 0x0018 (size: 0x10)
    float TimeForChamber;                                                             // 0x0028 (size: 0x4)
    TSubclassOf<class UWeaponActionWornOutFiringConditions> Conditions;               // 0x0030 (size: 0x8)
    FRuntimeFloatCurve ProbabilityWeightCurve;                                        // 0x0038 (size: 0x88)

}; // Size: 0xC0

struct FFireShotDescription
{
}; // Size: 0x8

struct FFireShotProjectileData
{
    FVector StartLocation;                                                            // 0x0000 (size: 0xC)
    FVector_NetQuantizeNormal shootDirection;                                         // 0x000C (size: 0xC)
    int32 ZeroRange;                                                                  // 0x0018 (size: 0x4)
    float Windage;                                                                    // 0x001C (size: 0x4)
    int32 RandomFactor;                                                               // 0x0020 (size: 0x4)
    float ConeHalfAngle;                                                              // 0x0024 (size: 0x4)
    float ProjectileDamageMultiplier;                                                 // 0x0028 (size: 0x4)
    FFireShotProjectileDescription Description;                                       // 0x002C (size: 0x1)

}; // Size: 0x30

struct FFireShotProjectileDescription
{
}; // Size: 0x1

struct FFiredShotDescriptionRep
{
    uint32 PackedData;                                                                // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FFirstPersonViewParameters
{
    FFloatInterval MinMaxViewPitch;                                                   // 0x0000 (size: 0x8)
    FFloatInterval MinMaxViewYaw;                                                     // 0x0008 (size: 0x8)
    FFloatInterval MinMaxViewYawInCombatMode;                                         // 0x0010 (size: 0x8)
    FFloatInterval MinMaxViewYawIfBlocked;                                            // 0x0018 (size: 0x8)
    class UCurveLinearColor* MinMaxViewPitchByYaw;                                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FFishSpawnData
{
    class UFishSpeciesData* FishSpeciesData;                                          // 0x0000 (size: 0x8)
    float SpawningWeight;                                                             // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FFishStateParameters
{
    float MaxSpeed;                                                                   // 0x0000 (size: 0x4)
    float Acceleration;                                                               // 0x0004 (size: 0x4)
    float Deceleration;                                                               // 0x0008 (size: 0x4)
    float TurnSpeed;                                                                  // 0x000C (size: 0x4)

}; // Size: 0x10

struct FFishingData
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    float HookDepth;                                                                  // 0x000C (size: 0x4)

}; // Size: 0x18

struct FFishingMinigameData
{
}; // Size: 0x74

struct FFishingStats
{
    int32 FishCaught;                                                                 // 0x0000 (size: 0x4)
    int32 FishKept;                                                                   // 0x0004 (size: 0x4)
    int32 FishReleased;                                                               // 0x0008 (size: 0x4)
    int32 LinesBroken;                                                                // 0x000C (size: 0x4)
    float HeaviestFishCaught;                                                         // 0x0010 (size: 0x4)
    float LongestFishCaught;                                                          // 0x0014 (size: 0x4)
    TArray<FCaughtFishData> FishSpeciesCaught;                                        // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FFloatingWidgetUIData
{
}; // Size: 0x1C

struct FFoliageAIPerceptionData
{
    bool CanCoverPrisoner;                                                            // 0x0000 (size: 0x1)
    bool CanBlockVisibilityTrace;                                                     // 0x0001 (size: 0x1)
    bool UseOnlyUpperCanopyHemisphereForSeenCheck;                                    // 0x0002 (size: 0x1)
    EPrisonerGroundStance MaxUndetectedPrisonerStance;                                // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FFoliageCanopyData
{
    bool UseSphere;                                                                   // 0x0000 (size: 0x1)
    FTreeCanopySphere Sphere;                                                         // 0x0004 (size: 0x14)
    bool UseCapsule;                                                                  // 0x0018 (size: 0x1)
    FTreeCanopyCapsule Capsule;                                                       // 0x001C (size: 0x24)

}; // Size: 0x40

struct FFoliageEffectsData
{
    class UAkAudioEvent* StartMovingThroughFoliageAudioEvent;                         // 0x0000 (size: 0x8)
    class UAkAudioEvent* StopMovingThroughFoliageAudioEvent;                          // 0x0008 (size: 0x8)
    class UAkAudioEvent* OneShotMovingThroughFoliageAudioEvent;                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FFoliageGeneralData
{
    float CollisionBoundsScale;                                                       // 0x0000 (size: 0x4)
    FVector CollisionBoundsOffset;                                                    // 0x0004 (size: 0xC)
    bool ShouldBeConsideredForEnemySpawning;                                          // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FForeignSubstanceSave
{
    TArray<uint8> Data;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFortificationData
{
    FVector LocationZeroOrigin;                                                       // 0x0000 (size: 0xC)
    UClass* FortificationClass;                                                       // 0x0010 (size: 0x8)
    FDbIntegerId OwnerUserProfileId;                                                  // 0x0018 (size: 0x8)
    float health;                                                                     // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FFundsOverviewUIData
{
}; // Size: 0x60

struct FGameEventNotificationUIData
{
}; // Size: 0x50

struct FGameEventParameters
{
    float AnnounceDuration;                                                           // 0x0000 (size: 0x4)
    float CancelDuration;                                                             // 0x0004 (size: 0x4)
    float RoundDuration;                                                              // 0x0008 (size: 0x4)
    int32 RoundLimit;                                                                 // 0x000C (size: 0x4)
    int32 WinLimit;                                                                   // 0x0010 (size: 0x4)
    float RespawnDelay;                                                               // 0x0014 (size: 0x4)
    float TimeoutDuration;                                                            // 0x0018 (size: 0x4)
    int32 MinParticipants;                                                            // 0x001C (size: 0x4)
    int32 MaxParticipants;                                                            // 0x0020 (size: 0x4)
    bool AllowRespawn;                                                                // 0x0024 (size: 0x1)
    bool FriendlyFire;                                                                // 0x0025 (size: 0x1)
    TArray<int32> TeamLimit;                                                          // 0x0028 (size: 0x10)
    int32 EntryFee;                                                                   // 0x0038 (size: 0x4)
    FGameEventRewardPoints PointsPerEnemyKill;                                        // 0x003C (size: 0xC)
    FGameEventRewardPoints PointsPerTeamKill;                                         // 0x0048 (size: 0xC)
    FGameEventRewardPoints PointsPerDeath;                                            // 0x0054 (size: 0xC)
    FGameEventRewardPoints PointsPerSuicide;                                          // 0x0060 (size: 0xC)
    FGameEventRewardPoints PointsPerAssist;                                           // 0x006C (size: 0xC)
    FGameEventRewardPoints PointsPerHeadshot;                                         // 0x0078 (size: 0xC)
    FGameEventRewardPoints PointsPerRoundWin;                                         // 0x0084 (size: 0xC)
    TArray<FGameEventRewardPoints> PointsPerRank;                                     // 0x0090 (size: 0x10)
    FGameEventRewardPoints PointsForParticipation;                                    // 0x00A0 (size: 0xC)
    float ScoreToFameConversionFactor;                                                // 0x00AC (size: 0x4)
    TArray<TSoftObjectPtr<UItemSelection>> PossiblePrimaryWeapons;                    // 0x00B0 (size: 0x10)
    TArray<TSoftObjectPtr<UItemSelection>> PossibleSecondaryWeapons;                  // 0x00C0 (size: 0x10)
    TArray<TSoftObjectPtr<UItemSelection>> PossibleTertiaryWeapons;                   // 0x00D0 (size: 0x10)
    TArray<TSoftObjectPtr<UItemSelection>> PossibleOutfits;                           // 0x00E0 (size: 0x10)
    TArray<TSoftObjectPtr<UItemSelection>> PossibleSupportItems;                      // 0x00F0 (size: 0x10)
    TArray<TSoftObjectPtr<UItemSelection>> MandatoryGear;                             // 0x0100 (size: 0x10)
    FText EventName;                                                                  // 0x0110 (size: 0x18)
    FText EventDescription;                                                           // 0x0128 (size: 0x18)
    FText PrerequisitesText;                                                          // 0x0140 (size: 0x18)
    FText WeaponText;                                                                 // 0x0158 (size: 0x18)
    FText RewardsText;                                                                // 0x0170 (size: 0x18)

}; // Size: 0x188

struct FGameEventParticipantInfo
{
    FString UniqueId;                                                                 // 0x0000 (size: 0x10)
    TWeakObjectPtr<class APrisoner> Prisoner;                                         // 0x0010 (size: 0x8)
    FString Name;                                                                     // 0x0018 (size: 0x10)
    EGameEventParticipantState State;                                                 // 0x0028 (size: 0x1)
    int32 TeamIndex;                                                                  // 0x002C (size: 0x4)
    TArray<class UGameEventParticipantStats*> RoundStats;                             // 0x0030 (size: 0x10)
    class UGameEventParticipantStats* EventStats;                                     // 0x0040 (size: 0x8)
    TArray<class APrisoner*> HurtBy;                                                  // 0x0048 (size: 0x10)
    int32 RepHelper;                                                                  // 0x0058 (size: 0x4)

}; // Size: 0x78

struct FGameEventRewardPoints
{
    int32 Cash;                                                                       // 0x0000 (size: 0x4)
    int32 Score;                                                                      // 0x0004 (size: 0x4)
    float FamePoints;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGameEventTeamColours
{
    FLinearColor TeamName;                                                            // 0x0000 (size: 0x10)
    FLinearColor ParticipantStatsDarker;                                              // 0x0010 (size: 0x10)
    FLinearColor ParticipantStatsLighter;                                             // 0x0020 (size: 0x10)
    FLinearColor ParticipantStatsHighlighted;                                         // 0x0030 (size: 0x10)
    FLinearColor ParticipantStatsDisabled;                                            // 0x0040 (size: 0x10)
    FLinearColor ParticipantStatsMini;                                                // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FGamePaymentTransactionRequestData
{
}; // Size: 0x18

struct FGameResourceConsumptionDataForeignSubstance
{
    TSubclassOf<class UForeignSubstance> Class;                                       // 0x0000 (size: 0x8)
    float Amount;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FGameResourceMixingRule
{
    TSubclassOf<class UGameResourceType> Source;                                      // 0x0000 (size: 0x8)
    TSubclassOf<class UGameResourceType> Destination;                                 // 0x0008 (size: 0x8)
    TSubclassOf<class UGameResourceType> Result;                                      // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGardenSlot : public FFastArraySerializerItem
{
    FIntPoint _slotPosition;                                                          // 0x000C (size: 0x8)
    class UPlantSpecies* _species;                                                    // 0x0018 (size: 0x8)
    EPlantGrowthStage _stage;                                                         // 0x0020 (size: 0x1)
    uint16 _repWater;                                                                 // 0x0022 (size: 0x2)
    uint8 _repGrowthPercentage;                                                       // 0x0028 (size: 0x1)
    bool _organicFertilizer;                                                          // 0x0030 (size: 0x1)
    bool _industrialFertilizer;                                                       // 0x0031 (size: 0x1)
    class UPlantPestSpecies* _pests;                                                  // 0x0038 (size: 0x18)
    uint8 _repPestsIntensities;                                                       // 0x0050 (size: 0x3)
    class UPlantDiseaseSpecies* _diseases;                                            // 0x0060 (size: 0x18)
    uint8 _repDiseaseIntensities;                                                     // 0x0078 (size: 0x3)
    uint8 _repWeedIntensity;                                                          // 0x0088 (size: 0x1)
    bool _pesticideActive;                                                            // 0x0090 (size: 0x1)
    bool _fungicideActive;                                                            // 0x0098 (size: 0x1)
    bool _weedRepellentActive;                                                        // 0x00A0 (size: 0x1)
    uint8 _repHealth;                                                                 // 0x00A8 (size: 0x1)
    bool _isDead;                                                                     // 0x00B0 (size: 0x1)
    bool _isOld;                                                                      // 0x00B1 (size: 0x1)

}; // Size: 0x200

struct FGardenSlotArray : public FFastArraySerializer
{
    TArray<FGardenSlot> _gardenSlots;                                                 // 0x0108 (size: 0x10)

}; // Size: 0x120

struct FGearboxHandlingParameters
{
    float GearChangeDelayMultiplier;                                                  // 0x0000 (size: 0x4)
    float GearUpRatioMultiplier;                                                      // 0x0004 (size: 0x4)
    float GearDownRatioMultiplier;                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGenericUISounds
{
    class UAkAudioEvent* StopDeena;                                                   // 0x0000 (size: 0x8)
    class UAkAudioEvent* ButtonClick;                                                 // 0x0008 (size: 0x8)
    class UAkAudioEvent* ButtonHover;                                                 // 0x0010 (size: 0x8)
    class UAkAudioEvent* TabMenuTabClick;                                             // 0x0018 (size: 0x8)
    class UAkAudioEvent* TabMenuSubtabClick;                                          // 0x0020 (size: 0x8)
    class UAkAudioEvent* TabMenuCategoryTabClick;                                     // 0x0028 (size: 0x8)
    class UAkAudioEvent* FilterClick;                                                 // 0x0030 (size: 0x8)
    class UAkAudioEvent* DropdownCollapseExpandToggleClick;                           // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FGlobalRaidProtectionPlayerLoginMessagesData
{
}; // Size: 0x30

struct FGlobalRaidProtectionRaidPeriod
{
}; // Size: 0x10

struct FGrappleActionMontagePair
{
    class UAnimMontage* GrapplerMontage;                                              // 0x0000 (size: 0x8)
    class UAnimMontage* GrapplerMontageFP;                                            // 0x0008 (size: 0x8)
    class UAnimMontage* VictimMontage;                                                // 0x0010 (size: 0x8)
    class UAnimMontage* VictimMontageFP;                                              // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FHalloweenSacrificePitRequiredItemVariants
{
    TArray<TSoftClassPtr<AItem>> Variants;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FHandsPoseCorrections
{
    class UAnimSequenceBase* RightHand;                                               // 0x0000 (size: 0x8)
    class UAnimSequenceBase* RightFist;                                               // 0x0008 (size: 0x8)
    class UAnimSequenceBase* RightFistInCombatMode;                                   // 0x0010 (size: 0x8)
    float RightHandToIdleBlendAlpha;                                                  // 0x0018 (size: 0x4)
    class UAnimSequenceBase* LeftHand;                                                // 0x0020 (size: 0x8)
    class UAnimSequenceBase* LeftFist;                                                // 0x0028 (size: 0x8)
    class UAnimSequenceBase* LeftFistInCombatMode;                                    // 0x0030 (size: 0x8)
    float LeftHandToIdleBlendAlpha;                                                   // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FHeatSource
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    FHeatSourceParameters Parameters;                                                 // 0x000C (size: 0x24)
    bool IsUsingFuelSimulation;                                                       // 0x0030 (size: 0x1)
    int32 TimesUpdatedWithoutMoving;                                                  // 0x0054 (size: 0x4)

}; // Size: 0xA8

struct FHeatSourceParameters
{
    float Temperature;                                                                // 0x0000 (size: 0x4)
    float TemperatureMultiplier;                                                      // 0x0004 (size: 0x4)
    float FuelMassRatio;                                                              // 0x0008 (size: 0x4)
    float Emissivity;                                                                 // 0x000C (size: 0x4)
    float DistanceScale;                                                              // 0x0010 (size: 0x4)
    float InnerRadiusTemperatureScale;                                                // 0x0014 (size: 0x4)
    float AdditionalTemperaturePerGramOfOxygen;                                       // 0x0018 (size: 0x4)
    float InnerRadius;                                                                // 0x001C (size: 0x4)
    float OuterRadius;                                                                // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FHitByMeleeImpactSoundsInfo
{
    ECharacterImpactSourceSoundCategory ImpactSourceSoundCategory;                    // 0x0000 (size: 0x1)
    EHitSeverity HitSeverity;                                                         // 0x0001 (size: 0x1)
    EDetectHitCollisionType ImpactBodyPart;                                           // 0x0002 (size: 0x1)
    FVector ImpactPoint;                                                              // 0x0004 (size: 0xC)

}; // Size: 0x10

struct FHitEffects
{
    float SpeedThreshold;                                                             // 0x0000 (size: 0x4)
    class UParticleSystem* ParticleSystem;                                            // 0x0008 (size: 0x8)
    FVector ParticlesScale;                                                           // 0x0010 (size: 0xC)
    class UAkAudioEvent* AudioEvent;                                                  // 0x0020 (size: 0x8)
    TSubclassOf<class UMatineeCameraShake> CameraShake;                               // 0x0028 (size: 0x8)
    float CameraShakeScale;                                                           // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FHitReactBodyPartDataItem
{
    class UAnimMontage* MontageToPlay;                                                // 0x0000 (size: 0x8)
    class UAnimMontage* FollowupMontage;                                              // 0x0008 (size: 0x8)
    float RegainControlDurationMultiplier;                                            // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FHitReactDirectionData
{
    TArray<FHitReactBodyPartDataItem> FrontHit;                                       // 0x0000 (size: 0x10)
    TArray<FHitReactBodyPartDataItem> LeftHit;                                        // 0x0010 (size: 0x10)
    TArray<FHitReactBodyPartDataItem> BackHit;                                        // 0x0020 (size: 0x10)
    TArray<FHitReactBodyPartDataItem> RightHit;                                       // 0x0030 (size: 0x10)
    float RegainControlDurationMultiplier;                                            // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FHitReactLandingData
{
    float MinImpactSpeedToReact;                                                      // 0x0000 (size: 0x4)
    class UAnimMontage* MontageToPlay;                                                // 0x0008 (size: 0x8)
    float RegainControlDurationMultiplier;                                            // 0x0010 (size: 0x4)
    bool CanEverGoToRagdoll;                                                          // 0x0014 (size: 0x1)
    float MinImpactSpeedForRagdoll;                                                   // 0x0018 (size: 0x4)
    float MinRagdollDuration;                                                         // 0x001C (size: 0x4)
    float MaxRagdollDuration;                                                         // 0x0020 (size: 0x4)
    float RagdollDurationPerSpeedUnit;                                                // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FHitReactMagnitudeData
{
    FHitReactDirectionData SmallHit;                                                  // 0x0000 (size: 0x48)
    FHitReactDirectionData MediumHit;                                                 // 0x0048 (size: 0x48)
    FHitReactDirectionData LargeHit;                                                  // 0x0090 (size: 0x48)
    FHitReactDirectionData KnockoutHit;                                               // 0x00D8 (size: 0x48)

}; // Size: 0x120

struct FHitReactResult
{
    class UAnimMontage* MontageToPlay;                                                // 0x0000 (size: 0x8)
    class UAnimMontage* FollowupMontage;                                              // 0x0008 (size: 0x8)
    float RegainControlDurationMultiplier;                                            // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FHordeParametersPresetPair
{
    class UEncounterManagerHordePreset* Preset;                                       // 0x0000 (size: 0x8)
    float Weight;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FHoverClickButtonVisualInfo
{
    FLinearColor BackgroundColor;                                                     // 0x0000 (size: 0x10)
    FLinearColor BorderColor;                                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FHuntingBiomeDescription
{
    FTransform Transform;                                                             // 0x0000 (size: 0x30)
    float Radius;                                                                     // 0x0030 (size: 0x4)
    FHuntingBiomeParameters Parameters;                                               // 0x0038 (size: 0x38)

}; // Size: 0x70

struct FHuntingBiomeParameters
{
    class UBiomeData* BiomeData;                                                      // 0x0000 (size: 0x8)
    float AnimalSpawnChance;                                                          // 0x0008 (size: 0x4)
    float DaytimeSpawnMultiplier;                                                     // 0x000C (size: 0x10)
    float SpawnCheckCooldownMin;                                                      // 0x001C (size: 0x4)
    float SpawnCheckCooldownMax;                                                      // 0x0020 (size: 0x4)
    int8 MaxAnimalEncounters;                                                         // 0x0024 (size: 0x1)
    int8 MaxAnimalEncountersPerPlayer;                                                // 0x0025 (size: 0x1)
    int8 MaxPlayerTriggers;                                                           // 0x0026 (size: 0x1)
    bool PacksAllowed;                                                                // 0x0027 (size: 0x1)
    uint8 Priority;                                                                   // 0x0028 (size: 0x1)
    float AnimalSoundCooldownMin;                                                     // 0x002C (size: 0x4)
    float AnimalSoundCooldownMax;                                                     // 0x0030 (size: 0x4)
    float AnimalSoundPlayProbability;                                                 // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FHuntingClueVisuals
{
    float Weight;                                                                     // 0x0000 (size: 0x4)
    class UStaticMesh* ClueStaticMesh;                                                // 0x0008 (size: 0x8)
    class UMaterialInstance* ClueStaticMeshMaterial;                                  // 0x0010 (size: 0x8)
    FTransform StaticMeshOverrideRelativeTransform;                                   // 0x0020 (size: 0x30)
    class UMaterialInstance* ClueDecalMaterials;                                      // 0x0050 (size: 0x8)
    FTransform ClueDecalOverrideRelativeTransform;                                    // 0x0060 (size: 0x30)
    bool ShouldOverrideBoxDimensions;                                                 // 0x0090 (size: 0x1)
    FVector ClueDecalOverrideBoxDimensions;                                           // 0x0094 (size: 0xC)

}; // Size: 0xA0

struct FIgnitableItemIgnitionRequirements
{
    TArray<class UFireSourceItemTag*> PossibleItemTags;                               // 0x0000 (size: 0x10)
    int32 Uses;                                                                       // 0x0010 (size: 0x4)
    float UsageWeight;                                                                // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FImageAssetToLoad
{
    FGameplayTag Name;                                                                // 0x0000 (size: 0x8)
    FString FilePath;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FImpactEffectData
{
    class UParticleSystem* ParticleSystem;                                            // 0x0000 (size: 0x8)
    class UNiagaraSystem* NiagaraParticleSystem;                                      // 0x0008 (size: 0x8)
    class UMaterial* Decal;                                                           // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FInPlaceTurnAnimationInfo
{
    float Duration;                                                                   // 0x0000 (size: 0x4)
    float TurnSpeed;                                                                  // 0x0004 (size: 0x4)
    float AnimationPlayRate;                                                          // 0x0008 (size: 0x4)
    float BlendInDuration;                                                            // 0x000C (size: 0x4)
    float BlendOutDuration;                                                           // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FInPlaceTurningData
{
    FInPlaceTurnAnimationInfo LAnimationInfo;                                         // 0x0000 (size: 0x14)
    FInPlaceTurnAnimationInfo RAnimationInfo;                                         // 0x0014 (size: 0x14)
    float BlendAlphaInterpolationSpeed;                                               // 0x0028 (size: 0x4)

}; // Size: 0x2C

struct FInputValue
{
    FName Name;                                                                       // 0x0000 (size: 0x8)

}; // Size: 0xC

struct FInstrumentEvent
{
}; // Size: 0x10

struct FInteractableDescription
{
    FString AnchorMeshPathStringRef;                                                  // 0x0000 (size: 0x10)
    int32 InstanceIndex;                                                              // 0x0010 (size: 0x4)
    FTransform FallbackTransform;                                                     // 0x0020 (size: 0x30)
    TSoftObjectPtr<UStaticMesh> VisibleMesh;                                          // 0x0050 (size: 0x28)

}; // Size: 0x80

struct FInteractionData
{
    bool ModifierPressed;                                                             // 0x0000 (size: 0x1)
    int64 IntegerData;                                                                // 0x0008 (size: 0x8)
    class UObject* PointerData;                                                       // 0x0010 (size: 0x8)
    bool BoolData;                                                                    // 0x0018 (size: 0x1)
    FText TextData;                                                                   // 0x0020 (size: 0x18)
    FVector InteractionLocation;                                                      // 0x0038 (size: 0xC)
    FVector InteractionNormal;                                                        // 0x0044 (size: 0xC)
    FVector VectorData;                                                               // 0x0050 (size: 0xC)
    int64 BaseElementId;                                                              // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FInteractionQueryParameters
{
    FVector InteractionLocation;                                                      // 0x0000 (size: 0xC)
    FVector InteractionNormal;                                                        // 0x000C (size: 0xC)
    TWeakObjectPtr<class UPrimitiveComponent> Component;                              // 0x0018 (size: 0x8)
    int32 InstanceIndex;                                                              // 0x0020 (size: 0x4)

}; // Size: 0x40

struct FInteractionStruct
{
    EInteractionType interactionType;                                                 // 0x0000 (size: 0x1)
    FString InteractionCaption;                                                       // 0x0008 (size: 0x10)

}; // Size: 0x98

struct FInventoryContainer2DRepData
{
    TArray<FInventoryItemPositionPair> ItemsData;                                     // 0x0000 (size: 0x10)
    class UObject* Parent;                                                            // 0x0010 (size: 0x8)
    int32 SizeX;                                                                      // 0x0018 (size: 0x4)
    int32 SizeY;                                                                      // 0x001C (size: 0x4)

}; // Size: 0x20

struct FInventoryContainerClothesData
{
    TArray<FInventoryItemPositionPair> ItemsData;                                     // 0x0000 (size: 0x10)
    class UObject* Parent;                                                            // 0x0010 (size: 0x8)
    int32 RepCounter;                                                                 // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FInventoryContainerHandsHolstersData
{
    TArray<FInventoryItemPositionPair> ItemsData;                                     // 0x0000 (size: 0x10)
    class UObject* Parent;                                                            // 0x0010 (size: 0x8)
    int32 RepCounter;                                                                 // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FInventoryItemPositionPair
{
    FInventoryPositionDataRepHelper position;                                         // 0x0000 (size: 0x20)
    class UObject* Item;                                                              // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FInventoryNodeWidgetData
{
    FName Slot;                                                                       // 0x0000 (size: 0x8)
    EInventoryNodeWidgetDataType Type;                                                // 0x0008 (size: 0x1)
    float NumberData;                                                                 // 0x000C (size: 0x4)
    int32 IntegerNumberData;                                                          // 0x0010 (size: 0x4)
    FText TextData;                                                                   // 0x0018 (size: 0x18)
    class UTexture2D* IconData;                                                       // 0x0030 (size: 0x8)
    ESlateVisibility VisibilityData;                                                  // 0x0038 (size: 0x1)
    bool IsAnimated;                                                                  // 0x0039 (size: 0x1)
    bool IsSaturated;                                                                 // 0x003A (size: 0x1)
    bool IsOpened;                                                                    // 0x003B (size: 0x1)
    float Opacity;                                                                    // 0x003C (size: 0x4)

}; // Size: 0x40

struct FInventoryPositionDataRepHelper
{
    UClass* _dataClass;                                                               // 0x0000 (size: 0x8)
    class UInventoryPositionData* _positionData;                                      // 0x0008 (size: 0x8)
    class UObject* _owner;                                                            // 0x0010 (size: 0x8)
    int32 _repKey;                                                                    // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FInventoryStackData
{
    UClass* _stackClass;                                                              // 0x0000 (size: 0x8)
    float _approximateCount;                                                          // 0x0008 (size: 0x4)
    float _approximateMaxCount;                                                       // 0x000C (size: 0x4)
    float _weight;                                                                    // 0x0010 (size: 0x4)
    TArray<uint8> _data;                                                              // 0x0018 (size: 0x10)

}; // Size: 0x80

struct FInventoryStackMemberData
{
    int32 position;                                                                   // 0x0000 (size: 0x4)
    int32 Size;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FItemContainerRepData
{
    TArray<class UClass*> Locks;                                                      // 0x0000 (size: 0x10)
    TArray<int32> RemainingNeutralizationAttemptsPerLock;                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FItemContainersArray
{
    TArray<class AItemContainer*> _itemContainers;                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FItemContainersReplicationHelper
{
    TMap<class FString, class FItemContainerRepData> ItemContainerData;               // 0x0000 (size: 0x50)

}; // Size: 0x70

struct FItemFirstPersonUpperBodyAnimationsData
{
    class UAnimSequenceBase* StandIdle;                                               // 0x0000 (size: 0x8)
    class UBlendSpace1D* StandWalk;                                                   // 0x0008 (size: 0x8)
    class UBlendSpace1D* StandWalkLimping;                                            // 0x0010 (size: 0x8)
    class UBlendSpace1D* StandJog;                                                    // 0x0018 (size: 0x8)
    class UBlendSpace1D* StandJogLimping;                                             // 0x0020 (size: 0x8)
    class UAnimSequenceBase* StandRun;                                                // 0x0028 (size: 0x8)
    class UAnimSequenceBase* CrouchIdle;                                              // 0x0030 (size: 0x8)
    class UBlendSpace1D* CrouchWalk;                                                  // 0x0038 (size: 0x8)
    class UBlendSpace1D* CrouchWalkLimping;                                           // 0x0040 (size: 0x8)
    class UAnimSequenceBase* ProneIdle;                                               // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FItemGeneralParametersTableRow : public FTableRowBase
{
    FText _caption;                                                                   // 0x0008 (size: 0x18)
    FText _description;                                                               // 0x0020 (size: 0x18)
    TSoftObjectPtr<UTexture2D> _outsideInventoryIcon;                                 // 0x0038 (size: 0x28)
    TArray<FCraftingIngredientInstance> _craftingIngredientInstances;                 // 0x0060 (size: 0x10)
    bool _isSubjectToAllowMinesAndTrapsSetting;                                       // 0x0070 (size: 0x1)
    EDeluxeVersion _requiredDLC;                                                      // 0x0071 (size: 0x1)

}; // Size: 0x78

struct FItemLocation
{
    bool Coastal;                                                                     // 0x0000 (size: 0x1)
    bool Continantal;                                                                 // 0x0001 (size: 0x1)
    bool Mountain;                                                                    // 0x0002 (size: 0x1)
    bool Urban;                                                                       // 0x0003 (size: 0x1)
    bool Rural;                                                                       // 0x0004 (size: 0x1)
    bool Industrial;                                                                  // 0x0005 (size: 0x1)
    bool Police;                                                                      // 0x0006 (size: 0x1)
    bool MilitaryBasic;                                                               // 0x0007 (size: 0x1)
    bool MilitaryMedium;                                                              // 0x0008 (size: 0x1)
    bool MilitaryAdvanced;                                                            // 0x0009 (size: 0x1)
    bool MilitaryWW2;                                                                 // 0x000A (size: 0x1)
    bool Sport;                                                                       // 0x000B (size: 0x1)
    bool Market;                                                                      // 0x000C (size: 0x1)
    bool GasStation;                                                                  // 0x000D (size: 0x1)
    bool Airfield;                                                                    // 0x000E (size: 0x1)

}; // Size: 0xF

struct FItemLootTreeNodeTableRow : public FGameplayTagTableRow
{
    EItemRarity Rarity;                                                               // 0x0020 (size: 0x1)
    TArray<TSoftClassPtr<UItemPostSpawnAction>> PostSpawnActions;                     // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FItemMotionNoise
{
    class UAkAudioEvent* AudioEvent;                                                  // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FItemObstructionTestCapsule
{
}; // Size: 0x50

struct FItemSpawnerData
{
    TArray<TSoftClassPtr<AItem>> ItemClasses;                                         // 0x0000 (size: 0x10)
    FGameplayTagContainer ItemSpawnTypes;                                             // 0x0010 (size: 0x20)
    bool AlwaysSpawn;                                                                 // 0x0030 (size: 0x1)
    float Probability;                                                                // 0x0034 (size: 0x4)
    bool UseItemZone;                                                                 // 0x0038 (size: 0x1)
    bool UseItemRarity;                                                               // 0x0039 (size: 0x1)
    bool UseItemSpawnGroup;                                                           // 0x003A (size: 0x1)
    float InitialDamage;                                                              // 0x003C (size: 0x4)
    float RandomizeDamage;                                                            // 0x0040 (size: 0x4)
    float InitialUsage;                                                               // 0x0044 (size: 0x4)
    float RandomizeUsage;                                                             // 0x0048 (size: 0x4)
    float InitialDirtiness;                                                           // 0x004C (size: 0x4)
    float RandomizeDirtiness;                                                         // 0x0050 (size: 0x4)
    int32 MinAmmoCount;                                                               // 0x0054 (size: 0x4)
    int32 MaxAmmoCount;                                                               // 0x0058 (size: 0x4)
    int32 MinCashAmount;                                                              // 0x005C (size: 0x4)
    int32 MaxCashAmount;                                                              // 0x0060 (size: 0x4)
    bool UseCollisionTraceToAdjustSpawnLocation;                                      // 0x0064 (size: 0x1)
    bool UseCollisionTraceToAdjustSpawnRotation;                                      // 0x0065 (size: 0x1)
    TSubclassOf<class UItemPostSpawnAction> PostItemsSpawnedActions;                  // 0x0068 (size: 0x8)

}; // Size: 0x70

struct FItemSpawnerDataBasedOnPreset
{
    TSubclassOf<class UItemSpawnerPreset> Preset;                                     // 0x0000 (size: 0x8)
    bool OverrideItemClasses;                                                         // 0x0008 (size: 0x1)
    bool OverrideItemSpawnTypes;                                                      // 0x0009 (size: 0x1)
    bool OverrideAlwaysSpawn;                                                         // 0x000A (size: 0x1)
    bool OverrideProbability;                                                         // 0x000B (size: 0x1)
    bool OverrideUseItemZone;                                                         // 0x000C (size: 0x1)
    bool OverrideUseItemRarity;                                                       // 0x000D (size: 0x1)
    bool OverrideUseItemSpawnGroup;                                                   // 0x000E (size: 0x1)
    bool OverrideInitialDamage;                                                       // 0x000F (size: 0x1)
    bool OverrideRandomizeDamage;                                                     // 0x0010 (size: 0x1)
    bool OverrideInitialUsage;                                                        // 0x0011 (size: 0x1)
    bool OverrideRandomizeUsage;                                                      // 0x0012 (size: 0x1)
    bool OverrideInitialDirtiness;                                                    // 0x0013 (size: 0x1)
    bool OverrideRandomizeDirtiness;                                                  // 0x0014 (size: 0x1)
    bool OverrideMinAmmoCount;                                                        // 0x0015 (size: 0x1)
    bool OverrideMaxAmmoCount;                                                        // 0x0016 (size: 0x1)
    bool OverrideMinCashAmount;                                                       // 0x0017 (size: 0x1)
    bool OverrideMaxCashAmount;                                                       // 0x0018 (size: 0x1)
    bool OverrideUseCollisionTraceToAdjustSpawnLocation;                              // 0x0019 (size: 0x1)
    bool OverrideUseCollisionTraceToAdjustSpawnRotation;                              // 0x001A (size: 0x1)
    bool OverridePostItemsSpawnedActions;                                             // 0x001B (size: 0x1)
    TArray<TSoftClassPtr<AItem>> ItemClasses;                                         // 0x0020 (size: 0x10)
    FGameplayTagContainer ItemSpawnTypes;                                             // 0x0030 (size: 0x20)
    bool AlwaysSpawn;                                                                 // 0x0050 (size: 0x1)
    float Probability;                                                                // 0x0054 (size: 0x4)
    bool UseItemZone;                                                                 // 0x0058 (size: 0x1)
    bool UseItemRarity;                                                               // 0x0059 (size: 0x1)
    bool UseItemSpawnGroup;                                                           // 0x005A (size: 0x1)
    float InitialDamage;                                                              // 0x005C (size: 0x4)
    float RandomizeDamage;                                                            // 0x0060 (size: 0x4)
    float InitialUsage;                                                               // 0x0064 (size: 0x4)
    float RandomizeUsage;                                                             // 0x0068 (size: 0x4)
    float InitialDirtiness;                                                           // 0x006C (size: 0x4)
    float RandomizeDirtiness;                                                         // 0x0070 (size: 0x4)
    int32 MinAmmoCount;                                                               // 0x0074 (size: 0x4)
    int32 MaxAmmoCount;                                                               // 0x0078 (size: 0x4)
    int32 MinCashAmount;                                                              // 0x007C (size: 0x4)
    int32 MaxCashAmount;                                                              // 0x0080 (size: 0x4)
    bool UseCollisionTraceToAdjustSpawnLocation;                                      // 0x0084 (size: 0x1)
    bool UseCollisionTraceToAdjustSpawnRotation;                                      // 0x0085 (size: 0x1)
    TSubclassOf<class UItemPostSpawnAction> PostItemsSpawnedActions;                  // 0x0088 (size: 0x8)

}; // Size: 0x90

struct FItemSpawnerMarker
{
    FTransform Transform;                                                             // 0x0000 (size: 0x30)
    FItemSpawnerDataBasedOnPreset Spawner;                                            // 0x0030 (size: 0x90)
    FItemSpawnerPresetWithOverrides SpawnerPreset;                                    // 0x00C0 (size: 0xB8)

}; // Size: 0x180

struct FItemSpawnerPresetWithOverrides
{
    TSubclassOf<class UItemSpawnerPreset2> Preset;                                    // 0x0000 (size: 0x8)
    bool OverrideNodes;                                                               // 0x0008 (size: 0x1)
    TArray<FItemSpawnerPreset_Node> Nodes;                                            // 0x0010 (size: 0x10)
    bool OverrideItems;                                                               // 0x0020 (size: 0x1)
    TArray<FItemSpawnerPreset_Item> Items;                                            // 0x0028 (size: 0x10)
    bool OverrideSubpresets;                                                          // 0x0038 (size: 0x1)
    TArray<FItemSpawnerPreset_Subpreset> Subpresets;                                  // 0x0040 (size: 0x10)
    bool OverrideFixedItems;                                                          // 0x0050 (size: 0x1)
    TArray<TSoftClassPtr<AItem>> FixedItems;                                          // 0x0058 (size: 0x10)
    bool OverrideAlwaysSpawn;                                                         // 0x0068 (size: 0x1)
    bool AlwaysSpawn;                                                                 // 0x0069 (size: 0x1)
    bool OverrideProbability;                                                         // 0x006A (size: 0x1)
    float Probability;                                                                // 0x006C (size: 0x4)
    bool OverrideQuantity;                                                            // 0x0070 (size: 0x1)
    FInt32Interval Quantity;                                                          // 0x0074 (size: 0x8)
    bool OverrideAllowDuplicates;                                                     // 0x007C (size: 0x1)
    bool AllowDuplicates;                                                             // 0x007D (size: 0x1)
    bool OverrideShouldFilterItemsByZone;                                             // 0x007E (size: 0x1)
    bool ShouldFilterItemsByZone;                                                     // 0x007F (size: 0x1)
    bool OverrideShouldApplyLocationSpecificDamageModifier;                           // 0x0080 (size: 0x1)
    bool ShouldApplyLocationSpecificDamageModifier;                                   // 0x0081 (size: 0x1)
    bool OverrideShouldApplyLocationSpecificProbabilityModifier;                      // 0x0082 (size: 0x1)
    bool ShouldApplyLocationSpecificProbabilityModifier;                              // 0x0083 (size: 0x1)
    bool OverrideInitialDamage;                                                       // 0x0084 (size: 0x1)
    float InitialDamage;                                                              // 0x0088 (size: 0x4)
    bool OverrideRandomDamage;                                                        // 0x008C (size: 0x1)
    float RandomDamage;                                                               // 0x0090 (size: 0x4)
    bool OverrideInitialUsage;                                                        // 0x0094 (size: 0x1)
    float InitialUsage;                                                               // 0x0098 (size: 0x4)
    bool OverrideRandomUsage;                                                         // 0x009C (size: 0x1)
    float RandomUsage;                                                                // 0x00A0 (size: 0x4)
    bool OverridePostSpawnActions;                                                    // 0x00A4 (size: 0x1)
    TArray<TSoftClassPtr<UItemPostSpawnAction>> PostSpawnActions;                     // 0x00A8 (size: 0x10)

}; // Size: 0xB8

struct FItemSpawnerPreset_Item
{
    TSoftClassPtr<AItem> Item;                                                        // 0x0000 (size: 0x28)
    EItemRarity Rarity;                                                               // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FItemSpawnerPreset_Node
{
    FGameplayTagContainer Nodes;                                                      // 0x0000 (size: 0x20)
    EItemRarity Rarity;                                                               // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FItemSpawnerPreset_Subpreset
{
    TSubclassOf<class UItemSpawnerPreset2> Preset;                                    // 0x0000 (size: 0x8)
    EItemRarity Rarity;                                                               // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FItemSpawningCooldownGroupTableRow : public FTableRowBase
{
    FFloatInterval cooldown;                                                          // 0x0008 (size: 0x8)
    bool IsAffectedByLowerGroups;                                                     // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FItemSpawningParametersTableRow : public FTableRowBase
{
    int32 MaxOccurrences;                                                             // 0x0008 (size: 0x4)
    FItemLocation AllowedLocations;                                                   // 0x000C (size: 0xF)
    FFloatInterval CooldownPerSquadMember;                                            // 0x001C (size: 0x8)
    FDataTableRowHandle CooldownGroup;                                                // 0x0028 (size: 0x10)
    bool IsSubjectToAllowTrapsConfig;                                                 // 0x0038 (size: 0x1)
    TArray<TSoftClassPtr<AItem>> Variations;                                          // 0x0040 (size: 0x10)
    bool ShouldOverrideInitialAndRandomUsage;                                         // 0x0050 (size: 0x1)
    float InitialUsageOverride;                                                       // 0x0054 (size: 0x4)
    float RandomUsageOverride;                                                        // 0x0058 (size: 0x4)
    FVector SpawnLocationOffset;                                                      // 0x005C (size: 0xC)
    FRotator SpawnRotationOffset;                                                     // 0x0068 (size: 0xC)
    float SpawnRotationRandomization;                                                 // 0x0074 (size: 0x4)

}; // Size: 0x78

struct FItemSpawningSettings
{
    float RelevantSpawnerGroupsUpdateInterval;                                        // 0x0000 (size: 0x4)
    float MinPlayerLocationDeltaToUpdateRelevantSpawnerGroups;                        // 0x0004 (size: 0x4)
    float SpawnerGroupsCullDistance;                                                  // 0x0008 (size: 0x4)
    float SpawnerExpirationTimeInMinutes;                                             // 0x000C (size: 0x4)
    float ExamineSpawnerExpirationTimeInMinutes;                                      // 0x0010 (size: 0x4)
    float SpawnerTasksProcessingInterval;                                             // 0x0014 (size: 0x4)
    float SpawnerTasksProcessingBudgetInMilliseconds;                                 // 0x0018 (size: 0x4)
    int32 MaxNumberOfSpawnerTasksPerUpdate;                                           // 0x001C (size: 0x4)
    bool ShouldDestroySpawnedItemsIfNoPlayersAround;                                  // 0x0020 (size: 0x1)
    float RarityRatio;                                                                // 0x0024 (size: 0x4)
    float SpawnerProbabilityMultiplier;                                               // 0x0028 (size: 0x4)
    float ExamineSpawnerProbabilityMultiplier;                                        // 0x002C (size: 0x4)
    float ItemHealthMultiplierWhenUnderwater;                                         // 0x0030 (size: 0x4)
    bool IgnoreSpawnerProbability;                                                    // 0x0034 (size: 0x1)
    bool IgnoreItemLimit;                                                             // 0x0035 (size: 0x1)
    bool IgnoreItemZone;                                                              // 0x0036 (size: 0x1)
    bool IgnoreItemRarity;                                                            // 0x0037 (size: 0x1)
    bool DebugDrawItemSpawnTransforms;                                                // 0x0038 (size: 0x1)
    float DebugDrawItemSpawnTransformsDuration;                                       // 0x003C (size: 0x4)

}; // Size: 0x40

struct FItemUnpackingSpawnedItem
{
    TSubclassOf<class AItem> ItemClass;                                               // 0x0000 (size: 0x8)
    EUnpackedItemCountType CountType;                                                 // 0x0008 (size: 0x1)
    int32 Count;                                                                      // 0x000C (size: 0x4)
    TSubclassOf<class UItemUnpackingSpawnMethod> CustomSpawnMethod;                   // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FItemsCraftingUISounds
{
    class UAkAudioEvent* CraftButtonClick;                                            // 0x0000 (size: 0x8)
    class UAkAudioEvent* AutoCraftButtonClick;                                        // 0x0008 (size: 0x8)
    class UAkAudioEvent* DetailsButtonClick;                                          // 0x0010 (size: 0x8)
    class UAkAudioEvent* BackButtonClick;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FJournalUISounds
{
    class UAkAudioEvent* QuestEntryClick;                                             // 0x0000 (size: 0x8)
    class UAkAudioEvent* QuestEntryHover;                                             // 0x0008 (size: 0x8)
    class UAkAudioEvent* TrackQuest;                                                  // 0x0010 (size: 0x8)
    class UAkAudioEvent* UntrackQuest;                                                // 0x0018 (size: 0x8)
    class UAkAudioEvent* AbandonQuest;                                                // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FLadderDetectionParams
{
    FVector RayOrigin;                                                                // 0x0000 (size: 0xC)
    FVector RayDirection;                                                             // 0x000C (size: 0xC)
    float MaxHorzDistanceToLadder;                                                    // 0x0018 (size: 0x4)
    float MaxRayToLadderAngle;                                                        // 0x001C (size: 0x4)

}; // Size: 0x20

struct FLadderInfoRepData
{
    FTransform LadderTransform;                                                       // 0x0000 (size: 0x30)
    FVector CapsuleBias;                                                              // 0x0030 (size: 0xC)
    FVector RootBoneOffset;                                                           // 0x003C (size: 0xC)
    float StepHeight;                                                                 // 0x0048 (size: 0x4)
    TEnumAsByte<EPhysicalSurface> PhysicalSurfaceForSounds;                           // 0x004C (size: 0x1)
    uint8 NumberOfSteps;                                                              // 0x004D (size: 0x1)

}; // Size: 0x50

struct FLadderMarker
{
    FTransform FirstStep;                                                             // 0x0000 (size: 0x30)
    FVector LastStep;                                                                 // 0x0030 (size: 0xC)
    FTransform Edge;                                                                  // 0x0040 (size: 0x30)
    FVector CapsuleBias;                                                              // 0x0070 (size: 0xC)
    float StepHeight;                                                                 // 0x007C (size: 0x4)
    float StepWidth;                                                                  // 0x0080 (size: 0x4)
    float HitDetectionExtraAboveLastStep;                                             // 0x0084 (size: 0x4)
    float HitDetectionExtraBelowFirstStep;                                            // 0x0088 (size: 0x4)
    float HitDetectionExtraOnTheSides;                                                // 0x008C (size: 0x4)
    bool HasEdge;                                                                     // 0x0090 (size: 0x1)
    bool IsNarrow;                                                                    // 0x0091 (size: 0x1)
    TEnumAsByte<EPhysicalSurface> PhysicalSurfaceForSounds;                           // 0x0092 (size: 0x1)

}; // Size: 0xA0

struct FLandingEffectDataPerPhysicalSurface
{
    FLandingEffectDataPerSeverity Light;                                              // 0x0000 (size: 0x10)
    FLandingEffectDataPerSeverity Medium;                                             // 0x0010 (size: 0x10)
    FLandingEffectDataPerSeverity Heavy;                                              // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FLandingEffectDataPerSeverity
{
    class UParticleSystem* ParticleSystem;                                            // 0x0000 (size: 0x8)
    bool SpawnParticlesInDirectionOfVelocity;                                         // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FLastDamageDealtInfo
{
}; // Size: 0x28

struct FLazyLoadedClassPtr
{
    TSoftClassPtr<UObject> Class;                                                     // 0x0000 (size: 0x28)
    UClass* _loadedClass;                                                             // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FLazyLoadedObjectPtr
{
    TSoftObjectPtr<UObject> Object;                                                   // 0x0000 (size: 0x28)
    class UObject* _loadedObject;                                                     // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FLedgeMantlingAnimationInfo
{
    FVector AnchorOffset;                                                             // 0x0000 (size: 0xC)
    class UAnimSequenceBase* AnchoringAnimation;                                      // 0x0010 (size: 0x8)
    float AnchoringAnimationTime;                                                     // 0x0018 (size: 0x4)
    float AnchoringDuration;                                                          // 0x001C (size: 0x4)
    class UAnimMontage* ClimbingMontage;                                              // 0x0020 (size: 0x8)
    float StaminaDrain;                                                               // 0x0028 (size: 0x4)
    float MinEdgeHeight;                                                              // 0x002C (size: 0x4)
    float MaxEdgeHeight;                                                              // 0x0030 (size: 0x4)
    float VaultDistance;                                                              // 0x0034 (size: 0x4)
    float MaxVaultLandHeightError;                                                    // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FLegalTender
{
    int32 Amount;                                                                     // 0x0000 (size: 0x4)
    ECurrencyType Currency;                                                           // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FLightsAttachmentSimulationData
{
    uint8 TurnedOnMask;                                                               // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FLineTraceSocketPair
{
    FName TraceStart;                                                                 // 0x0000 (size: 0x8)
    FName TraceEnd;                                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FLocalOffsetCurves
{
    class UCurveLinearColor* YawIdle;                                                 // 0x0000 (size: 0x8)
    class UCurveLinearColor* YawMoving;                                               // 0x0008 (size: 0x8)
    class UCurveLinearColor* PitchIdle;                                               // 0x0010 (size: 0x8)
    class UCurveLinearColor* PitchMoving;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FMainPointSnappedUtilities
{
    TArray<FEntityId> _repSnappedKey;                                                 // 0x00A0 (size: 0x10)
    TArray<FEntityId> _repSnappedValue;                                               // 0x00B0 (size: 0x10)

}; // Size: 0xC8

struct FManualEnhancedImageTextInformation
{
    FVector2D DesiredLocation;                                                        // 0x0000 (size: 0x8)
    float DesiredWidth;                                                               // 0x0008 (size: 0x4)
    FText Text;                                                                       // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FManualUISounds
{
    class UAkAudioEvent* CategoryCollapseExpandToggleClick;                           // 0x0000 (size: 0x8)
    class UAkAudioEvent* CodexEntryClick;                                             // 0x0008 (size: 0x8)
    class UAkAudioEvent* TaskEntryClick;                                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FMapHUDDroneObject : public FMapHUDObject
{
    class UTexture* _droneDirectionTexture;                                           // 0x0018 (size: 0x8)
    class UTexture* _dronePositionTexture;                                            // 0x0020 (size: 0x8)
    class UTexture* _dronePingAnimationTexture;                                       // 0x0028 (size: 0x8)

}; // Size: 0x38

struct FMapHUDFlagsObject : public FMapHUDObject
{
    class UTexture* _flagPositionOuterRingTexture;                                    // 0x0018 (size: 0x8)
    FLinearColor _flagOuterRingColor;                                                 // 0x0020 (size: 0x10)
    FLinearColor _flagHighlightOuterRingColor;                                        // 0x0030 (size: 0x10)
    class UTexture* _flagPositionInnerCircleTexture;                                  // 0x0040 (size: 0x8)
    FLinearColor _flagInnerCircleColor;                                               // 0x0048 (size: 0x10)
    FLinearColor _flagHighlightInnerCircleColor;                                      // 0x0058 (size: 0x10)
    class UFont* _flagFont;                                                           // 0x0068 (size: 0x8)
    FLinearColor _flagNameHighlightColor;                                             // 0x0070 (size: 0x10)
    FLinearColor _flagNameHighlightOutlineColor;                                      // 0x0080 (size: 0x10)
    FLinearColor _flagNameColor;                                                      // 0x0090 (size: 0x10)
    FLinearColor _flagNameOutlineColor;                                               // 0x00A0 (size: 0x10)
    FVector2D _flagPositionTextureSize;                                               // 0x00B0 (size: 0x8)
    int32 _flagTextStackOffset;                                                       // 0x00B8 (size: 0x4)

}; // Size: 0xC0

struct FMapHUDHomeLocationObject : public FMapHUDObject
{
    class UFont* _font;                                                               // 0x0018 (size: 0x8)

}; // Size: 0x48

struct FMapHUDObject
{
    int32 _priority;                                                                  // 0x0008 (size: 0x4)
    bool _showText;                                                                   // 0x000C (size: 0x1)
    bool _showMarkers;                                                                // 0x000D (size: 0x1)

}; // Size: 0x18

struct FMapHUDOtherPlayersObject : public FMapHUDObject
{
    class UTexture* _otherPlayerPositionOuterRingTexture;                             // 0x0018 (size: 0x8)
    FLinearColor _otherPlayerOuterRingColor;                                          // 0x0020 (size: 0x10)
    FLinearColor _otherPlayerHighlightOuterRingColor;                                 // 0x0030 (size: 0x10)
    class UTexture* _otherPlayerPositionInnerCicleTexture;                            // 0x0040 (size: 0x8)
    FLinearColor _otherPlayerInnerCircleColor;                                        // 0x0048 (size: 0x10)
    FLinearColor _otherPlayerHighlightInnerCircleColor;                               // 0x0058 (size: 0x10)
    class UFont* _otherPlayerFont;                                                    // 0x0068 (size: 0x8)
    FLinearColor _otherPlayerNameHighlightColor;                                      // 0x0070 (size: 0x10)
    FLinearColor _otherPlayerNameHighlightOutlineColor;                               // 0x0080 (size: 0x10)
    FLinearColor _otherPlayerNameColor;                                               // 0x0090 (size: 0x10)
    FLinearColor _otherPlayerNameOutlineColor;                                        // 0x00A0 (size: 0x10)
    FVector2D _prisonerPositionTextureSize;                                           // 0x00B0 (size: 0x8)
    int32 _otherPlayerTextStackOffset;                                                // 0x00B8 (size: 0x4)

}; // Size: 0xC0

struct FMapHUDPrisonerObject : public FMapHUDObject
{
    FVector2D _prisonerPositionTextureSize;                                           // 0x0018 (size: 0x8)
    class UTexture* _myPrisonerPositionTexture;                                       // 0x0020 (size: 0x8)
    class UTexture* _prisonerPingAnimationTexture;                                    // 0x0028 (size: 0x8)
    float _prisonerPingSizeMultiplier;                                                // 0x0030 (size: 0x4)

}; // Size: 0x40

struct FMapHUDQuestObject : public FMapHUDObject
{
    class UTexture* _questPositionOuterRingTexture;                                   // 0x0018 (size: 0x8)
    FLinearColor _questOuterRingColor;                                                // 0x0020 (size: 0x10)
    class UTexture* _questPositionInnerCircleTexture;                                 // 0x0030 (size: 0x8)
    FLinearColor _questInnerCircleColor;                                              // 0x0038 (size: 0x10)
    class UFont* _questFont;                                                          // 0x0048 (size: 0x8)
    FLinearColor _questNameColor;                                                     // 0x0050 (size: 0x10)
    FLinearColor _questNameOutlineColor;                                              // 0x0060 (size: 0x10)
    FVector2D _questPositionTextureSize;                                              // 0x0070 (size: 0x8)
    int32 _questTextStackOffset;                                                      // 0x0078 (size: 0x4)

}; // Size: 0x80

struct FMapHUDVehiclesObject : public FMapHUDObject
{
    class UTexture* _vehiclePositionOuterRingTexture;                                 // 0x0018 (size: 0x8)
    FLinearColor _vehicleOuterRingColor;                                              // 0x0020 (size: 0x10)
    FLinearColor _vehicleHighlightOuterRingColor;                                     // 0x0030 (size: 0x10)
    class UTexture* _vehiclePositionInnerCircleTexture;                               // 0x0040 (size: 0x8)
    FLinearColor _vehicleInnerCircleColor;                                            // 0x0048 (size: 0x10)
    FLinearColor _vehicleHighlightInnerCircleColor;                                   // 0x0058 (size: 0x10)
    class UFont* _vehicleFont;                                                        // 0x0068 (size: 0x8)
    FLinearColor _vehicleNameHighlightColor;                                          // 0x0070 (size: 0x10)
    FLinearColor _vehicleNameHighlightOutlineColor;                                   // 0x0080 (size: 0x10)
    FLinearColor _vehicleNameColor;                                                   // 0x0090 (size: 0x10)
    FLinearColor _vehicleNameOutlineColor;                                            // 0x00A0 (size: 0x10)
    FVector2D _vehiclePositionTextureSize;                                            // 0x00B0 (size: 0x8)
    int32 _vehicleTextStackOffset;                                                    // 0x00B8 (size: 0x4)

}; // Size: 0xC0

struct FMapHUDWorldEventsObject : public FMapHUDObject
{
}; // Size: 0x18

struct FMapLimits
{
    FMapLimits_Wall NorthWall;                                                        // 0x0000 (size: 0x30)
    FMapLimits_Wall EastWall;                                                         // 0x0030 (size: 0x30)
    float SouthLimit;                                                                 // 0x0060 (size: 0x4)
    float WestLimit;                                                                  // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FMapLimits_Wall
{
    FBox Bounds;                                                                      // 0x0000 (size: 0x1C)
    TArray<FMapLimits_WallSegment> Segments;                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMapLimits_WallSegment
{
    float Key;                                                                        // 0x0000 (size: 0x4)
    float Value;                                                                      // 0x0004 (size: 0x4)
    float TerrainZ;                                                                   // 0x0008 (size: 0x4)
    float MaxZ;                                                                       // 0x000C (size: 0x4)

}; // Size: 0x10

struct FMapLocationMarker
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    float SizeFactor;                                                                 // 0x000C (size: 0x4)

}; // Size: 0x10

struct FMedicalSkillParametersPerSkillLevel
{
    float ManualBCUUpgradeSuccessChance;                                              // 0x0000 (size: 0x4)
    float ExtractBloodSampleDurationMultiplier;                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FMeleeAction
{
    EMeleeActionType ActionType;                                                      // 0x0000 (size: 0x1)
    TWeakObjectPtr<class UAnimMontage> Montage;                                       // 0x0004 (size: 0x8)
    float StartDelay;                                                                 // 0x000C (size: 0x4)
    float PlayRate;                                                                   // 0x0010 (size: 0x4)
    float BlockDuration;                                                              // 0x0014 (size: 0x4)
    float OrientToTargetSpeedFactor;                                                  // 0x0018 (size: 0x4)
    float RegainControlDurationModifier;                                              // 0x001C (size: 0x4)

}; // Size: 0x20

struct FMeleeAttack
{
}; // Size: 0x20

struct FMeleeAttackCapsule
{
    TWeakObjectPtr<class AActor> AttachParent;                                        // 0x0000 (size: 0x8)
    FGameplayTag Attachment;                                                          // 0x0008 (size: 0x8)
    FTransform RelativeTransform;                                                     // 0x0010 (size: 0x30)
    float UnscaledRadius;                                                             // 0x0040 (size: 0x4)
    float UnscaledHalfHeight;                                                         // 0x0044 (size: 0x4)
    FMeleeWeaponDesc WeaponDesc;                                                      // 0x0048 (size: 0x38)

}; // Size: 0x80

struct FMeleeAttackCapsuleHitInfo
{
    FMeleeAttackCapsule MeleeAttackCapsule;                                           // 0x0000 (size: 0x80)
    FHitResult HitResult;                                                             // 0x0080 (size: 0x98)
    EHitSeverity HitSeverity;                                                         // 0x0118 (size: 0x1)
    EAttackType AttackType;                                                           // 0x0119 (size: 0x1)
    FVector_NetQuantize100 AttackerLocation;                                          // 0x011C (size: 0xC)
    FVector_NetQuantize100 VictimLocation;                                            // 0x0128 (size: 0xC)
    FGameplayTagContainer Tags;                                                       // 0x0138 (size: 0x20)

}; // Size: 0x160

struct FMeleeDodge
{
}; // Size: 0x10

struct FMeleeHitDetectionMarker
{
    float Time;                                                                       // 0x0000 (size: 0x4)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)
    FTransform RootMotion;                                                            // 0x0040 (size: 0x30)
    float DamageMultiplier;                                                           // 0x0070 (size: 0x4)
    float SelectionWeight;                                                            // 0x0074 (size: 0x4)

}; // Size: 0x80

struct FMeleeSkillAnimations
{
    class UAnimSequenceBase* PrimaryIdleAnimationTP;                                  // 0x0000 (size: 0x8)
    class UAnimSequenceBase* PrimaryIdleAnimationFP;                                  // 0x0008 (size: 0x8)
    class UAnimSequenceBase* TiredIdleAnimationTP;                                    // 0x0010 (size: 0x8)
    class UAnimSequenceBase* TiredIdleAnimationFP;                                    // 0x0018 (size: 0x8)
    class UAnimSequenceBase* WalkingIdleAnimationTP;                                  // 0x0020 (size: 0x8)
    class UAnimSequenceBase* WalkingIdleAnimationFP;                                  // 0x0028 (size: 0x8)
    class UAnimSequenceBase* BlockIdleAnimationTP;                                    // 0x0030 (size: 0x8)
    class UAnimSequenceBase* BlockIdleAnimationFP;                                    // 0x0038 (size: 0x8)
    class UBlendSpace* AimOffsetBlendSpaceTP;                                         // 0x0040 (size: 0x8)
    class UBlendSpace* AimOffsetBlendSpaceFP;                                         // 0x0048 (size: 0x8)
    class UAnimMontage* EnterCombatModeMontage;                                       // 0x0050 (size: 0x8)
    class UAnimMontage* LeaveCombatModeMontage;                                       // 0x0058 (size: 0x8)
    TArray<class UAnimSequenceBase*> InactivityIdleAnimations;                        // 0x0060 (size: 0x10)
    float IdleToBlockBlendDuration;                                                   // 0x0070 (size: 0x4)
    float BlockToIdleBlendDuration;                                                   // 0x0074 (size: 0x4)
    TArray<FMeleeSkillAttack> Attacks;                                                // 0x0078 (size: 0x10)
    TArray<FMeleeSkillDodge> Dodges;                                                  // 0x0088 (size: 0x10)

}; // Size: 0x98

struct FMeleeSkillAttack
{
    FGameplayTagContainer AttackTypes;                                                // 0x0000 (size: 0x20)
    FGameplayTagContainer IgnoreReason;                                               // 0x0020 (size: 0x20)
    class UAnimMontage* Montage;                                                      // 0x0040 (size: 0x8)
    class UAnimMontage* MontageFP;                                                    // 0x0048 (size: 0x8)
    FFloatInterval PitchRange;                                                        // 0x0050 (size: 0x8)
    float MaxDistance;                                                                // 0x0058 (size: 0x4)
    float MinDistance;                                                                // 0x005C (size: 0x4)
    float MinStamina;                                                                 // 0x0060 (size: 0x4)
    float OrientToTargetSpeedFactor;                                                  // 0x0064 (size: 0x4)
    float RegainControlDurationMultiplier;                                            // 0x0068 (size: 0x4)
    float StaminaDrainMultiplier;                                                     // 0x006C (size: 0x4)
    bool CanBeUsedAsInitialAttack;                                                    // 0x0070 (size: 0x1)
    bool CanBeUsedToCloseLargeDistanceToTarget;                                       // 0x0071 (size: 0x1)
    bool Solo;                                                                        // 0x0072 (size: 0x1)
    bool Mute;                                                                        // 0x0073 (size: 0x1)
    bool IsAlwaysCandidate;                                                           // 0x0074 (size: 0x1)

}; // Size: 0x78

struct FMeleeSkillDodge
{
    EDodgeDirectionType DodgeDirectionType;                                           // 0x0000 (size: 0x1)
    class UAnimMontage* Montage;                                                      // 0x0008 (size: 0x8)
    float RegainControlDurationMultiplier;                                            // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FMeleeSkillExperienceAwards
{
    float PointsForHit;                                                               // 0x0000 (size: 0x4)
    float PointsForKill;                                                              // 0x0004 (size: 0x4)
    float SubsequentHitMultiplier;                                                    // 0x0008 (size: 0x4)
    float SkillLevelBonusPoints;                                                      // 0x000C (size: 0x4)

}; // Size: 0x10

struct FMeleeSkillParametersPerSkillLevel
{
    FExperienceDependentFloat StartDelay;                                             // 0x0000 (size: 0x8)
    FExperienceDependentFloat StartDelayPenaltyPerStrengthShortage;                   // 0x0008 (size: 0x8)
    FExperienceDependentFloat AnimationPlayRateModifier;                              // 0x0010 (size: 0x8)
    FExperienceDependentFloat AnimationPlayRatePenaltyPerStrengthShortage;            // 0x0018 (size: 0x8)
    FExperienceDependentFloat RegainControlDurationModifier;                          // 0x0020 (size: 0x8)
    FExperienceDependentFloat StaminaDrain;                                           // 0x0028 (size: 0x8)
    FExperienceDependentFloat StaminaDrainPenaltyPerStrengthShortage;                 // 0x0030 (size: 0x8)
    FExperienceDependentFloat StaminaRecoveryDelay;                                   // 0x0038 (size: 0x8)
    FExperienceDependentFloat StaminaRecoveryDuration;                                // 0x0040 (size: 0x8)
    FExperienceDependentFloat StaminaInfluenceWindowMin;                              // 0x0048 (size: 0x8)
    FExperienceDependentFloat StaminaInfluenceWindowMax;                              // 0x0050 (size: 0x8)
    FExperienceDependentFloat StaminaInfluenceWindowLinearity;                        // 0x0058 (size: 0x8)
    FExperienceDependentFloat StartDelayWhenExhausted;                                // 0x0060 (size: 0x8)
    FExperienceDependentFloat AnimationPlayRateModifierWhenExhausted;                 // 0x0068 (size: 0x8)
    FExperienceDependentFloat RegainControlDurationModifierWhenExhausted;             // 0x0070 (size: 0x8)
    FExperienceDependentFloat StaminaMultiplierPerExcessGearWeight;                   // 0x0078 (size: 0x8)
    FExperienceDependentFloat ComboCooldownDuration;                                  // 0x0080 (size: 0x8)

}; // Size: 0x88

struct FMeleeWeaponDesc
{
    float Damage;                                                                     // 0x0000 (size: 0x4)
    float DamageInGameEvent;                                                          // 0x0004 (size: 0x4)
    FTargetTypeDamageMultiplier TargetTypeMultiplier;                                 // 0x0008 (size: 0x10)
    float Energy;                                                                     // 0x0018 (size: 0x4)
    float SharpnessSlash;                                                             // 0x001C (size: 0x4)
    float SharpnessPierce;                                                            // 0x0020 (size: 0x4)
    int32 HitSeverityChange;                                                          // 0x0024 (size: 0x4)
    ECharacterImpactSourceSoundCategory ImpactSoundCategory;                          // 0x0028 (size: 0x1)
    class UProjectileImpactEffects* ImpactEffects;                                    // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FMeshHitZone
{
}; // Size: 0x1C

struct FMeshInstanceId
{
}; // Size: 0x8

struct FMeshInstancesRestoreOptions
{
    float RestoreInterval;                                                            // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FMeshMaterialPair
{
    class USkeletalMesh* SkeletalMesh;                                                // 0x0000 (size: 0x8)
    class UMaterialInstance* EquippedMaterialOverride;                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMessageStruct
{
    FText Text;                                                                       // 0x0000 (size: 0x18)
    float Duration;                                                                   // 0x0018 (size: 0x4)
    FLinearColor Color;                                                               // 0x001C (size: 0x10)

}; // Size: 0x30

struct FMetabolismAPBFontStyle
{
    class UFont* Font;                                                                // 0x0000 (size: 0x8)
    int32 FontSize;                                                                   // 0x0008 (size: 0x4)
    FMargin TitlePadding;                                                             // 0x000C (size: 0x10)
    FMargin ValuePadding;                                                             // 0x001C (size: 0x10)
    TEnumAsByte<EVerticalAlignment> TitleVerticalAlignment;                           // 0x002C (size: 0x1)
    TEnumAsByte<EHorizontalAlignment> TitleHorizontalAlignment;                       // 0x002D (size: 0x1)
    FSlateChildSize TitleSize;                                                        // 0x0030 (size: 0x8)
    TEnumAsByte<EVerticalAlignment> ValueVerticalAlignment;                           // 0x0038 (size: 0x1)
    TEnumAsByte<EHorizontalAlignment> ValueHorizontalAlignment;                       // 0x0039 (size: 0x1)
    FSlateChildSize ValueSize;                                                        // 0x003C (size: 0x8)

}; // Size: 0x48

struct FMetabolismConfiguration
{
    float InitialAbsorbedEnergyRatio;                                                 // 0x0000 (size: 0x4)
    float InitialAbsorbedWaterRatio;                                                  // 0x0004 (size: 0x4)
    float InitialAbsorbedVitaminsRatio;                                               // 0x0008 (size: 0x4)
    float InitialAbsorbedMineralsRatio;                                               // 0x000C (size: 0x4)
    float InitialColonFullness;                                                       // 0x0010 (size: 0x4)
    float InitialBladderFullness;                                                     // 0x0014 (size: 0x4)
    float MaxStomachVolume;                                                           // 0x0018 (size: 0x4)
    float MaxIntestineVolume;                                                         // 0x001C (size: 0x4)
    float MaxColonVolume;                                                             // 0x0020 (size: 0x4)
    float MaxBladderVolume;                                                           // 0x0024 (size: 0x4)
    float EnergyAbsorptionCapacityMultiplier;                                         // 0x0028 (size: 0x4)
    float WaterAbsorptionCapacityMultiplier;                                          // 0x002C (size: 0x4)
    float AlcoholAbsorptionBaseCapacity;                                              // 0x0030 (size: 0x4)
    float AbsorbedAlcoholDiscardRate;                                                 // 0x0034 (size: 0x4)
    float MaxEnergyToRecoverFromFatPerHour;                                           // 0x0038 (size: 0x4)
    float MaxAbsorbedEnergyExcessToStoreAsFatPerHour;                                 // 0x003C (size: 0x4)
    FSubstancesData NutrientsAbsorptionRateModifier;                                  // 0x0040 (size: 0xD0)
    float MinSubstancesToAbsorbRatio;                                                 // 0x0110 (size: 0x4)
    FSubstancesData AbsorbedNonEnergyProvidingNutrientsExcessDiscardRateMultiplier;   // 0x0118 (size: 0xD0)
    FSubstancesData AdditionalRequiredWaterPerNutrientAbsorbed;                       // 0x01E8 (size: 0xD0)
    float IntestineToColonFecesTransferRate;                                          // 0x02B8 (size: 0x4)
    FSubstancesData NutrientAbsorptionWasteFecesRatios;                               // 0x02C0 (size: 0xD0)
    FSubstancesData NutrientAbsorptionWasteUrineRatios;                               // 0x0390 (size: 0xD0)

}; // Size: 0x460

struct FMetabolismRadialAttributeProgressBarColor
{
    FLinearColor PositiveColor;                                                       // 0x0000 (size: 0x10)
    FLinearColor NeutralColor;                                                        // 0x0010 (size: 0x10)
    FLinearColor NegativeColor;                                                       // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMetabolismRadialProgressBarColorScheme
{
    FLinearColor BackgroundColor;                                                     // 0x0000 (size: 0x10)
    FLinearColor PrimaryBarColor;                                                     // 0x0010 (size: 0x10)
    FLinearColor PrimaryBarGlowColor;                                                 // 0x0020 (size: 0x10)
    FLinearColor SecondaryBarColor;                                                   // 0x0030 (size: 0x10)
    FLinearColor SecondaryBarGlowColor;                                               // 0x0040 (size: 0x10)
    FLinearColor FontColor;                                                           // 0x0050 (size: 0x10)
    FLinearColor FontInnerGlowColor;                                                  // 0x0060 (size: 0x10)
    FLinearColor FontOuterGlowColor;                                                  // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FMetabolismRadialProgressBarFontSettings
{
    int32 FontSize;                                                                   // 0x0000 (size: 0x4)
    FMargin FontPadding;                                                              // 0x0004 (size: 0x10)

}; // Size: 0x14

struct FMetabolismSPBColorScheme
{
    FLinearColor BaseColor;                                                           // 0x0000 (size: 0x10)
    FLinearColor FillColorBottom;                                                     // 0x0010 (size: 0x10)
    FLinearColor FillColorTop;                                                        // 0x0020 (size: 0x10)
    FLinearColor OutlineColorBottom;                                                  // 0x0030 (size: 0x10)
    FLinearColor OutlineColorTop;                                                     // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FMiniGameEndParams
{
}; // Size: 0x4

struct FMinigameToolRequestData
{
}; // Size: 0x18

struct FModularElementSnapMarker
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    bool CopyTransformFromSocket;                                                     // 0x0008 (size: 0x1)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)
    FModularElementSnapMarkerSocket Socket;                                           // 0x0040 (size: 0x18)
    bool InfluenceStability;                                                          // 0x0058 (size: 0x1)
    float Stability;                                                                  // 0x005C (size: 0x4)
    bool InfluenceMarkerGroup;                                                        // 0x0060 (size: 0x1)
    int32 MarkerGroupIndex;                                                           // 0x0064 (size: 0x4)
    bool RequiresServerSetting;                                                       // 0x0068 (size: 0x1)
    FName RequiredServerSettingName;                                                  // 0x006C (size: 0x8)

}; // Size: 0x80

struct FModularElementSnapMarkerSocket
{
    TSubclassOf<class UModularBaseBuildingSocketType> Type;                           // 0x0000 (size: 0x8)
    TSubclassOf<class UModularBaseBuildingSocketType> InType;                         // 0x0008 (size: 0x8)
    TSubclassOf<class UModularBaseBuildingSocketType> OutType;                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FModularTooltipSectionData
{
    TArray<class UModularTooltipElementData*> Elements;                               // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMovableCollisionFieldMoveInfo
{
    float Duration;                                                                   // 0x0000 (size: 0x4)
    EMovableCollisionFieldMovementCurveType curveType;                                // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FMovableCollisionFieldState
{
    bool IsTurnedOn;                                                                  // 0x0000 (size: 0x1)
    uint8 PackedCurrentPercentage;                                                    // 0x0001 (size: 0x1)
    EMovableCollisionFieldMoveType MoveType;                                          // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FMovableMeshComponentData
{
}; // Size: 0x14

struct FMovingSplineSoundData
{
    class UAkAudioEvent* StartAudioEvent;                                             // 0x0000 (size: 0x8)
    class UAkAudioEvent* StopAudioEvent;                                              // 0x0008 (size: 0x8)
    float LifetimeAfterStopping;                                                      // 0x0010 (size: 0x4)
    float AudioMovementSpeed;                                                         // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FMultiplierByClass
{
    UClass* ObjectClass;                                                              // 0x0000 (size: 0x8)
    float Multiplier;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FMultistageRandomRoll
{
    FFloatInterval _valueRange;                                                       // 0x0000 (size: 0x8)
    bool _shouldWrapValue;                                                            // 0x0008 (size: 0x1)
    TArray<FRandomRollStage> _baseValueRollStages;                                    // 0x0010 (size: 0x10)
    bool _isVarianceEnabled;                                                          // 0x0020 (size: 0x1)
    FFloatInterval _varianceRollInterval;                                             // 0x0024 (size: 0x8)
    FFloatInterval _varianceTargetInterval;                                           // 0x002C (size: 0x8)
    float _varianceTargetInterpSpeed;                                                 // 0x0034 (size: 0x4)
    int32 _baseValueStageToSetWhenForcingBaseValue;                                   // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FMusicPlayerPlaybackOptions
{
    TArray<FString> MusicPlaylist;                                                    // 0x0000 (size: 0x10)
    int32 CurrentPlaylistIndex;                                                       // 0x0010 (size: 0x4)
    bool PlaybackPaused;                                                              // 0x0014 (size: 0x1)
    float CurrentPlaybackVolume;                                                      // 0x0018 (size: 0x4)
    bool ShouldRepeatCurrent;                                                         // 0x001C (size: 0x1)
    bool ShouldLoop;                                                                  // 0x001D (size: 0x1)
    bool ShouldShuffle;                                                               // 0x001E (size: 0x1)
    bool ShouldPlayRadio;                                                             // 0x001F (size: 0x1)
    bool IsTurnedOn;                                                                  // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FNPCGuardAttackDescription
{
    ENPCGuardAttackType Type;                                                         // 0x0000 (size: 0x1)
    class UAnimMontage* Montage;                                                      // 0x0008 (size: 0x8)
    float cooldown;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FNetPackedProjectileDamageEvent : public FScumPointDamageEvent
{
    FVector_NetQuantize100 DealerLocation;                                            // 0x00C0 (size: 0xC)
    FVector_NetQuantize100 TargetLocation;                                            // 0x00CC (size: 0xC)
    float ProjectileMass;                                                             // 0x00D8 (size: 0x4)
    float ProjectileSpeed;                                                            // 0x00DC (size: 0x4)
    float ProjectileMuzzleVelocity;                                                   // 0x00E0 (size: 0x4)
    uint8 SharpnessHardnessPacked;                                                    // 0x00E4 (size: 0x1)
    uint8 ArmorPiercingFactorPacked;                                                  // 0x00E5 (size: 0x1)
    uint8 EventDataPacked;                                                            // 0x00E6 (size: 0x1)
    TSubclassOf<class AActor> WeaponClass;                                            // 0x00E8 (size: 0x8)
    class UObject* DamageDealer;                                                      // 0x00F0 (size: 0x8)
    class UVehicleAttachment* DamageReceiverVehicleAttachment;                        // 0x00F8 (size: 0x8)
    float DistanceTravelled;                                                          // 0x0100 (size: 0x4)
    float ExperienceMultiplier;                                                       // 0x0104 (size: 0x4)
    bool IsVehicleCollision;                                                          // 0x0108 (size: 0x1)
    int64 BaseElementId;                                                              // 0x0110 (size: 0x8)
    class UProjectileImpactEffects* overrideProjectileImpactEffects;                  // 0x0118 (size: 0x8)

}; // Size: 0x120

struct FNotificationAndDelay
{
    class UNotificationDescription* Notification;                                     // 0x0000 (size: 0x8)
    float Delay;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FNotificationDescriptionReplicationHelper
{
}; // Size: 0x18

struct FNotificationUISounds
{
    class UAkAudioEvent* PlayerKillIndicator;                                         // 0x0000 (size: 0x8)
    class UAkAudioEvent* DialogueInterruptIndicator;                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FNutrientsRDA
{
    float MinProteinsPerLeanBodyMass;                                                 // 0x0000 (size: 0x4)
    float MaxProteinsPerLeanBodyMass;                                                 // 0x0004 (size: 0x4)
    float Fats;                                                                       // 0x0008 (size: 0x4)
    float Water;                                                                      // 0x000C (size: 0x4)
    float VitaminA;                                                                   // 0x0010 (size: 0x4)
    float VitaminB1;                                                                  // 0x0014 (size: 0x4)
    float VitaminB2;                                                                  // 0x0018 (size: 0x4)
    float VitaminB3;                                                                  // 0x001C (size: 0x4)
    float VitaminB4;                                                                  // 0x0020 (size: 0x4)
    float VitaminB5;                                                                  // 0x0024 (size: 0x4)
    float VitaminB6;                                                                  // 0x0028 (size: 0x4)
    float VitaminB9;                                                                  // 0x002C (size: 0x4)
    float VitaminB12;                                                                 // 0x0030 (size: 0x4)
    float VitaminC;                                                                   // 0x0034 (size: 0x4)
    float VitaminD;                                                                   // 0x0038 (size: 0x4)
    float VitaminE;                                                                   // 0x003C (size: 0x4)
    float VitaminK;                                                                   // 0x0040 (size: 0x4)
    float Calcium;                                                                    // 0x0044 (size: 0x4)
    float Magnesium;                                                                  // 0x0048 (size: 0x4)
    float Potassium;                                                                  // 0x004C (size: 0x4)
    float Copper;                                                                     // 0x0050 (size: 0x4)
    float Selenium;                                                                   // 0x0054 (size: 0x4)
    float Iron;                                                                       // 0x0058 (size: 0x4)
    float Phosphorus;                                                                 // 0x005C (size: 0x4)
    float Zinc;                                                                       // 0x0060 (size: 0x4)
    float Manganese;                                                                  // 0x0064 (size: 0x4)
    float Sodium;                                                                     // 0x0068 (size: 0x4)

}; // Size: 0x6C

struct FObjectConditionContainer
{
    TArray<class UClass*> _objectConditions;                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FOutpostInformationTraderUIData
{
    TSoftClassPtr<ASedentaryNPC> TraderClass;                                         // 0x0000 (size: 0x28)

}; // Size: 0x28

struct FPBCTIIT_ApplyBandagesOrDisinfect_ApplyBandages_PerSkillData
{
    TArray<int32> NumUsesPerSeverityLevel;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPBCTIIT_ApplyBandagesOrDisinfect_Disinfect_PerSkillData
{
    TArray<int32> NumUsesPerSeverityLevel;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPBCTIIT_ApplyGel_PerSkillData
{
    TArray<int32> NumUsesPerSeverityLevel;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPBCTI_ApplyBandagesOrDisinfect_ApplyBandagesData
{
    float BaseActionDuration;                                                         // 0x0000 (size: 0x4)
    FFloatRange ActionDurationLimits;                                                 // 0x0004 (size: 0x10)
    float BaseExperienceGainVsSkillLevel;                                             // 0x0014 (size: 0x14)
    float StabilizationDurationReductionVsSkillLevel;                                 // 0x0028 (size: 0x14)
    float RecoveryDurationReductionVsSkillLevel;                                      // 0x003C (size: 0x14)

}; // Size: 0x50

struct FPBCTI_ApplyBandagesOrDisinfect_DisinfectData
{
    float BaseActionDuration;                                                         // 0x0000 (size: 0x4)
    FFloatRange ActionDurationLimits;                                                 // 0x0004 (size: 0x10)
    float BaseExperienceGainVsSkillLevel;                                             // 0x0014 (size: 0x14)
    class UAkAudioEvent* BeginInteractionPatientAudioEvent;                           // 0x0028 (size: 0x8)
    class UAkAudioEvent* EndInteractionPatientAudioEvent;                             // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPBCTI_ApplyGelData
{
    float BaseActionDuration;                                                         // 0x0000 (size: 0x4)
    FFloatRange ActionDurationLimits;                                                 // 0x0004 (size: 0x10)
    float BaseExperienceGainVsSkillLevel;                                             // 0x0014 (size: 0x14)
    class UAkAudioEvent* BeginInteractionPatientAudioEvent;                           // 0x0028 (size: 0x8)
    class UAkAudioEvent* EndInteractionPatientAudioEvent;                             // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPackedEntitySetupAndId
{
    uint64 _value;                                                                    // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPackedLocation
{
}; // Size: 0x8

struct FPackedState
{
    uint64 _value;                                                                    // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FPageSplatterInfo
{
    int32 MaxNumOfSplatters;                                                          // 0x0000 (size: 0x4)
    TArray<FSlateBrush> SplatterTextures;                                             // 0x0008 (size: 0x10)
    float Frequency;                                                                  // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPaintJobColor
{
    FColor WeaponColor;                                                               // 0x0000 (size: 0x4)
    FColor VehicleColor;                                                              // 0x0004 (size: 0x4)
    FColor BaseElementColor;                                                          // 0x0008 (size: 0x4)
    FColor TurretColor;                                                               // 0x000C (size: 0x4)

}; // Size: 0x10

struct FParachuteAnimParams
{
    class UAnimSequence* OpeningAnimation;                                            // 0x0000 (size: 0x8)
    FFloatInterval OpeningAnimationTimeRange;                                         // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FParameterFloat : public FEditableParameter
{
    float Value;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FParameterInt32 : public FEditableParameter
{
    int32 Value;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FParameterVector : public FEditableParameter
{
    FVector Value;                                                                    // 0x0010 (size: 0xC)

}; // Size: 0x20

struct FParameterVector4 : public FEditableParameter
{
    FVector4 Value;                                                                   // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FParticleCollisionDecalData
{
    class UMaterialInterface* Decal;                                                  // 0x0000 (size: 0x8)
    float MinSize;                                                                    // 0x0008 (size: 0x4)
    float MaxSize;                                                                    // 0x000C (size: 0x4)
    float MinLifetime;                                                                // 0x0010 (size: 0x4)
    float MaxLifetime;                                                                // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPendingTraderPersonalityDataHelperStruct
{
    class UTraderPersonalityDataAsset* Personality;                                   // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPerSkillLevelFloatData
{
    float NoSkill;                                                                    // 0x0000 (size: 0x4)
    float Basic;                                                                      // 0x0004 (size: 0x4)
    float Medium;                                                                     // 0x0008 (size: 0x4)
    float Advanced;                                                                   // 0x000C (size: 0x4)
    float AboveAdvanced;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPerSkillLevelIntegerData
{
    int32 NoSkill;                                                                    // 0x0000 (size: 0x4)
    int32 Basic;                                                                      // 0x0004 (size: 0x4)
    int32 Medium;                                                                     // 0x0008 (size: 0x4)
    int32 Advanced;                                                                   // 0x000C (size: 0x4)
    int32 AboveAdvanced;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPerTraderOverrideDataHelper
{
}; // Size: 0x70

struct FPeriodicallyReplenishedResourceDescription
{
    float InitialAmount;                                                              // 0x0000 (size: 0x4)
    float MaxAmount;                                                                  // 0x0004 (size: 0x4)
    float ReplenishInterval;                                                          // 0x0008 (size: 0x4)
    float ReplenishAmount;                                                            // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPhysicalAnimationDesc
{
}; // Size: 0x34

struct FPhysicalHitReactData
{
    FName ProfileName;                                                                // 0x0000 (size: 0x8)
    FName PelvisBoneName;                                                             // 0x0008 (size: 0x8)
    float InitialStrengthMultiplier;                                                  // 0x0010 (size: 0x4)
    float BlendDuration;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPhysicalSurfaceData
{
    float DirtinessFactor;                                                            // 0x0000 (size: 0x4)
    float WetnessFactor;                                                              // 0x0004 (size: 0x4)
    float LandingImpactVelocityModifier;                                              // 0x0008 (size: 0x4)
    float NoiseLoudnessModifier;                                                      // 0x000C (size: 0x4)
    float FootstepEnhancerChance;                                                     // 0x0010 (size: 0x4)
    float FootwearDamageMultiplier;                                                   // 0x0014 (size: 0x4)
    float FootAbrasionsMultiplier;                                                    // 0x0018 (size: 0x4)
    float VisualCoverageWhileInProne;                                                 // 0x001C (size: 0x4)
    float VisualCoverageWhileCrouching;                                               // 0x0020 (size: 0x4)
    float VisualCoverageWhileStanding;                                                // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FPhysicalSurfaceEffectsData
{
    FPhysicalSurfaceVehicleEffectsData Vehicle;                                       // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPhysicalSurfaceVehicleEffectsData
{
    class UParticleSystem* ParticleTrail;                                             // 0x0000 (size: 0x8)
    float ParticleTrailSlipModifier;                                                  // 0x0008 (size: 0x4)
    float ParticleTrailDestructionDelay;                                              // 0x000C (size: 0x4)
    class UParticleSystem* ParticleWave;                                              // 0x0010 (size: 0x8)
    float ParticleWaveSlipModifier;                                                   // 0x0018 (size: 0x4)
    float ParticleWaveDestructionDelay;                                               // 0x001C (size: 0x4)
    FPhysicalSurfaceVehicleTireParticleData SmallTireParticles;                       // 0x0020 (size: 0x10)
    FPhysicalSurfaceVehicleTireParticleData MediumTireParticles;                      // 0x0030 (size: 0x10)
    FPhysicalSurfaceVehicleTireParticleData LargeTireParticles;                       // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FPhysicalSurfaceVehicleTireParticleData
{
    class UParticleSystem* ParticleTrail;                                             // 0x0000 (size: 0x8)
    class UParticleSystem* ParticleWave;                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPlaceableActorStateReplicationHelper
{
}; // Size: 0x8

struct FPlantGrowthStageData
{
    float MinWaterMililiters;                                                         // 0x0000 (size: 0x4)
    float MinSunHours;                                                                // 0x0004 (size: 0x4)
    FFloatInterval OptimalAvgTemperature;                                             // 0x0008 (size: 0x8)
    float WaterDeficiencyGrowthExtendHours;                                           // 0x0010 (size: 0x4)
    float WaterDeficiencyDeathTimeHours;                                              // 0x0014 (size: 0x4)
    float TemperatureDeficiencyGrowthExtendHours;                                     // 0x0018 (size: 0x4)
    float TemperatureDeficiencyDeathTimeHours;                                        // 0x001C (size: 0x4)
    float SunDeficiencyGrowthExtendHours;                                             // 0x0020 (size: 0x4)
    float PlantPestGrowthExtendPercentage;                                            // 0x0024 (size: 0x4)
    float DeathFromPlantPestTimeHours;                                                // 0x0028 (size: 0x4)
    float PlantDiseaseGrowthExendPercentage;                                          // 0x002C (size: 0x4)
    float DeathFromPlantDiseaseTimeHours;                                             // 0x0030 (size: 0x4)
    float WeedGrowthExtendPercentage;                                                 // 0x0034 (size: 0x4)
    float RecoveryTimeHours;                                                          // 0x0038 (size: 0x4)
    float WeedHarvestingReductionPercentage;                                          // 0x003C (size: 0x4)
    float OrganicFertilizerHarvestingIncreasePercentage;                              // 0x0040 (size: 0x4)
    float IndustrialFertilizerHarvestingIncreasePercentage;                           // 0x0044 (size: 0x4)
    float WaterDeficiencyHarvestingDecreasePercentage;                                // 0x0048 (size: 0x4)
    float TemperatureDeficiencyHarvestingDecreasePercentage;                          // 0x004C (size: 0x4)
    float WaterDeficiencyHarvestingSearchTimeIncrease;                                // 0x0050 (size: 0x4)
    float TemperatureDeficiencyHarvestingSearchTimeIncrease;                          // 0x0054 (size: 0x4)
    float PlantHealthAtWhichProduceStartsDecaying;                                    // 0x0058 (size: 0x4)
    float HarvestedProduceMinHealthPercentage;                                        // 0x005C (size: 0x4)

}; // Size: 0x60

struct FPlantMesh
{
    FStaticMeshMaterialPair Mesh;                                                     // 0x0000 (size: 0x18)
    FFloatInterval StageMorphTargetInterpolationRange;                                // 0x0018 (size: 0x8)
    FVector GrowthExponents;                                                          // 0x0020 (size: 0xC)
    FTransform Transform;                                                             // 0x0030 (size: 0x30)

}; // Size: 0x60

struct FPlantMeshData
{
    bool PlantGrowsUpright;                                                           // 0x0000 (size: 0x1)
    FVector Translation;                                                              // 0x0004 (size: 0xC)
    FFloatInterval RandomVerticalOffsetInterval;                                      // 0x0010 (size: 0x8)
    FFloatInterval RandomHorizontalOffsetInterval;                                    // 0x0018 (size: 0x8)
    FFloatInterval RandomScaleInterval;                                               // 0x0020 (size: 0x8)
    FPlantStageMeshData VegetatingPlantMesh;                                          // 0x0028 (size: 0x18)
    FPlantStageMeshData FloweringPlantMesh;                                           // 0x0040 (size: 0x18)
    FPlantStageMeshData RipeningPlantMesh;                                            // 0x0058 (size: 0x18)

}; // Size: 0x70

struct FPlantStageMeshData
{
    bool SkipStage;                                                                   // 0x0000 (size: 0x1)
    float ProduceReadyStagePercent;                                                   // 0x0004 (size: 0x4)
    TArray<FPlantMesh> Meshes;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPlayerLoginInfo
{
    FString UserId;                                                                   // 0x0000 (size: 0x10)
    FDbIntegerId UserProfileId;                                                       // 0x0010 (size: 0x8)
    FString UserProfileName;                                                          // 0x0018 (size: 0x10)
    bool IsUserAdmin;                                                                 // 0x0028 (size: 0x1)
    bool IsUserServerSettingsAdmin;                                                   // 0x0029 (size: 0x1)
    bool PlayAsDrone;                                                                 // 0x002A (size: 0x1)
    FDeluxeVersion DeluxeVersion;                                                     // 0x002B (size: 0xC)
    int32 ServerResponsePort;                                                         // 0x0038 (size: 0x4)
    FDbIntegerId ServerUserProfileId;                                                 // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FPlayerPawnBirdInfo
{
    int32 CoastalBirdsinProximity;                                                    // 0x0000 (size: 0x4)
    int32 ContinetalBirdsinProximity;                                                 // 0x0004 (size: 0x4)
    int32 VirtualAssignedCoastalBirds;                                                // 0x0008 (size: 0x4)
    int32 VirtualAssignedContinentalBirds;                                            // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPlayerRpcChannelServerDataRequestNetSerializer
{
}; // Size: 0x8

struct FPlayerRpcChannelServerDataResponseNetSerializer
{
}; // Size: 0x8

struct FPlayerUnsubscribeData
{
}; // Size: 0x78

struct FPossibleChoppingTools
{
    TArray<FChoppingTool2> PossibleTools;                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPossibleEncounterData
{
    TSubclassOf<class UEncounterBase> EncounterClass;                                 // 0x0000 (size: 0x8)
    float EncounterWeight;                                                            // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPossibleRecipeIngredient
{
    bool IsResource;                                                                  // 0x0000 (size: 0x1)
    TSoftClassPtr<AItem> Item;                                                        // 0x0008 (size: 0x28)
    bool ShouldConsumeWhole;                                                          // 0x0030 (size: 0x1)
    int32 Usage;                                                                      // 0x0034 (size: 0x4)
    TSubclassOf<class UGameResourceType> ResourceType;                                // 0x0038 (size: 0x8)
    float Liters;                                                                     // 0x0040 (size: 0x4)
    float NutrientInclusionFactor;                                                    // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FPowerCableMeshInfo
{
    class UStaticMesh* Mesh;                                                          // 0x0000 (size: 0x8)
    float Length;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPowerNodeConnector
{
    FName SocketName;                                                                 // 0x0000 (size: 0x8)
    bool ShouldHaveCable;                                                             // 0x0008 (size: 0x1)
    int32 CableMeshIndex;                                                             // 0x000C (size: 0x4)
    int32 TargetConnectorIndex;                                                       // 0x0010 (size: 0x4)
    class UStaticMeshComponent* CableMeshComponent;                                   // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPriceUpdateData
{
}; // Size: 0x90

struct FPrisonerActionDifficultyCurve
{
    float _resting;                                                                   // 0x0000 (size: 0x4)
    float _idle;                                                                      // 0x0004 (size: 0x4)
    float _easy;                                                                      // 0x0008 (size: 0x4)
    float _demanding;                                                                 // 0x000C (size: 0x4)
    float _veryDemanding;                                                             // 0x0010 (size: 0x4)
    float _extremelyDemanding;                                                        // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPrisonerAerialPoseData
{
    float TerminalVelocity;                                                           // 0x0000 (size: 0x4)
    float LateralMaxSpeed;                                                            // 0x0004 (size: 0x4)
    float LateralDrag;                                                                // 0x0008 (size: 0x4)
    float DesiredPitch;                                                               // 0x000C (size: 0x4)
    float DragIntensity;                                                              // 0x0010 (size: 0x4)
    float YawRotationRate;                                                            // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPrisonerAerialPosePair
{
    EPrisonerAerialPose PoseA;                                                        // 0x0000 (size: 0x1)
    EPrisonerAerialPose PoseB;                                                        // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FPrisonerAerialPoseTransition
{
    float Duration;                                                                   // 0x0000 (size: 0x4)
    class UAnimSequence* Animation;                                                   // 0x0008 (size: 0x8)
    FFloatInterval AnimationTimeRange;                                                // 0x0010 (size: 0x8)
    class UCurveFloat* PitchBlendCurve;                                               // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPrisonerAirMovementParameters
{
    float TerminalVelocity;                                                           // 0x0000 (size: 0x4)
    float LateralMaxSpeed;                                                            // 0x0004 (size: 0x4)
    float LateralDrag;                                                                // 0x0008 (size: 0x4)
    float DesiredPitch;                                                               // 0x000C (size: 0x4)
    float YawRotationRateFactor;                                                      // 0x0010 (size: 0x4)
    float DragIntensity;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPrisonerAppearanceId
{
    EConZGender Gender;                                                               // 0x0000 (size: 0x1)
    int32 Index;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPrisonerAppearance_FaceVariation
{
    TSoftObjectPtr<UTexture2D> SkinColor;                                             // 0x0000 (size: 0x28)
    TSoftObjectPtr<UTexture2D> SkinNormal;                                            // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FPrisonerAppearance_HairColorPreset
{
    FLinearColor PreviewColor;                                                        // 0x0000 (size: 0x10)
    EConZColor ColorName;                                                             // 0x0010 (size: 0x1)
    float Brightness;                                                                 // 0x0014 (size: 0x4)
    FLinearColor RootColor;                                                           // 0x0018 (size: 0x10)
    FLinearColor RootColorOnHead;                                                     // 0x0028 (size: 0x10)
    float Roughness;                                                                  // 0x0038 (size: 0x4)
    float Scatter;                                                                    // 0x003C (size: 0x4)
    FLinearColor TipColor;                                                            // 0x0040 (size: 0x10)
    float RandomHueVariation;                                                         // 0x0050 (size: 0x4)
    float RandomValueVariation;                                                       // 0x0054 (size: 0x4)
    float FacialHair_Brightness;                                                      // 0x0058 (size: 0x4)
    FLinearColor FacialHair_RootColor;                                                // 0x005C (size: 0x10)
    float FacialHair_Roughness;                                                       // 0x006C (size: 0x4)
    float FacialHair_Scatter;                                                         // 0x0070 (size: 0x4)
    FLinearColor FacialHair_TipColor;                                                 // 0x0074 (size: 0x10)
    float FacialHair_RandomHueVariation;                                              // 0x0084 (size: 0x4)
    float FacialHair_RandomValueVariation;                                            // 0x0088 (size: 0x4)

}; // Size: 0x8C

struct FPrisonerAppearance_HairStyle
{
    EDeluxeVersion GameUpgradeRequired;                                               // 0x0000 (size: 0x1)
    class UCharacterMesh* Mesh;                                                       // 0x0008 (size: 0x8)
    float Haircontrast;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPrisonerAppearance_IrisColor
{
    FLinearColor PreviewColor;                                                        // 0x0000 (size: 0x10)
    FVector4 IrisColor;                                                               // 0x0010 (size: 0x10)
    EConZColor ColorName;                                                             // 0x0020 (size: 0x1)

}; // Size: 0x30

struct FPrisonerAppearance_IrisVariation
{
    TSoftObjectPtr<UTexture2D> IrisHeight;                                            // 0x0000 (size: 0x28)
    TSoftObjectPtr<UTexture2D> IrisMasks;                                             // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FPrisonerAppearance_SkinParams
{
    TArray<FPrisonerAppearance_FaceVariation> FaceVariations;                         // 0x0000 (size: 0x10)
    TArray<FPrisonerAppearance_SkinTone> SkinTones;                                   // 0x0010 (size: 0x10)
    TArray<FPrisonerAppearance_HairColorPreset> HairColorPresets;                     // 0x0020 (size: 0x10)
    int32 DefaultSkinToneIndex;                                                       // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPrisonerAppearance_SkinTone
{
    FLinearColor PreviewColor;                                                        // 0x0000 (size: 0x10)
    FLinearColor SkinColorOffset;                                                     // 0x0010 (size: 0x10)
    FLinearColor AverageLipColor;                                                     // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPrisonerAppearance_Tattoo
{
    EDeluxeVersion GameUpgradeRequired;                                               // 0x0000 (size: 0x1)
    TMap<class FName, class TSoftObjectPtr<UTexture2D>> TattooTextures;               // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FPrisonerAppearance_TattooArray
{
    TArray<FPrisonerAppearance_Tattoo> Tattoos;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPrisonerAquaticModeData
{
    float CapsuleHalfHeight;                                                          // 0x0000 (size: 0x4)
    EPrisonerMovementPace MaxMovementPace;                                            // 0x0004 (size: 0x1)
    float YawRotationRate;                                                            // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPrisonerBodyBoneGroupsVsSeverity
{
    TArray<FPrisonerBodyBoneGroupsVsSeverityKey> Keys;                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPrisonerBodyBoneGroupsVsSeverityKey
{
    FFloatRange SeverityRange;                                                        // 0x0000 (size: 0x10)
    TSet<EPrisonerBodyBoneGroup> Values;                                              // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FPrisonerBodyEffectSave
{
    TArray<uint8> Data;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPrisonerBodyMuscleGroupsVsSeverity
{
    TArray<FPrisonerBodyMuscleGroupsVsSeverityKey> Keys;                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPrisonerBodyMuscleGroupsVsSeverityKey
{
    FFloatRange SeverityRange;                                                        // 0x0000 (size: 0x10)
    TSet<EPrisonerBodyMuscleGroup> Values;                                            // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FPrisonerBodyOrganGroupsVsSeverity
{
    TArray<FPrisonerBodyOrganGroupsVsSeverityKey> Keys;                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPrisonerBodyOrganGroupsVsSeverityKey
{
    FFloatRange SeverityRange;                                                        // 0x0000 (size: 0x10)
    TSet<EPrisonerBodyOrganGroup> Values;                                             // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FPrisonerBodySimulationData_BodyPartMappingArray
{
    TArray<EBodyPart> BodyParts;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPrisonerBodySimulationData_ConsumableDigestionHandlersForValueRange
{
    FFloatRange ValueRange;                                                           // 0x0000 (size: 0x10)
    bool IsConstrainedByConsumptionMethod;                                            // 0x0010 (size: 0x1)
    EGameResourceConsumptionMethod ConsumptionMethodConstraint;                       // 0x0011 (size: 0x1)
    TArray<class UConsumableDigestionHandler*> DigestionHandlers;                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPrisonerBodySimulationData_ConsumableDigestionHandlersForValueRanges
{
    TArray<FPrisonerBodySimulationData_ConsumableDigestionHandlersForValueRange> ValueRanges; // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPrisonerBodySimulationData_Effects
{
    TSubclassOf<class UPrisonerBodyCondition_Knockout> KnockoutWithoutBlackout;       // 0x0000 (size: 0x8)
    TSubclassOf<class UPrisonerBodyCondition_Knockout> KnockoutWithBlackout;          // 0x0008 (size: 0x8)
    TSubclassOf<class UPrisonerBodyCondition_BleedingInjury> BleedingInjury;          // 0x0010 (size: 0x8)
    class UPrisonerBodyMuscleGroupToBurnInjuryClassMappings* DefaultMuscleGroupToBurnInjuryClassMappings; // 0x0018 (size: 0x8)
    TSubclassOf<class UPrisonerBodyCondition_Choking> Choking;                        // 0x0020 (size: 0x8)
    TSubclassOf<class UPrisonerBodyCondition_FoodDisgust> FoodDisgust;                // 0x0028 (size: 0x8)
    TSubclassOf<class UPrisonerBodyCondition_TearGasExposure> TearGasExposure;        // 0x0030 (size: 0x8)
    TSubclassOf<class UPrisonerBodyEffect_Limping> Limping;                           // 0x0038 (size: 0x8)
    FPrisonerBodySimulationData_Effects_ExhaustionChange ExhaustionChange;            // 0x0040 (size: 0x18)

}; // Size: 0x58

struct FPrisonerBodySimulationData_Effects_ExhaustionChange
{
    TSubclassOf<class UPrisonerBodyEffect_ExhaustionChange> Consumption;              // 0x0000 (size: 0x8)
    TSubclassOf<class UPrisonerBodyEffect_ExhaustionChange> Resting;                  // 0x0008 (size: 0x8)
    TSubclassOf<class UPrisonerBodyEffect_ExhaustionChange> Smoking;                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPrisonerCharacterMeshDecayMultiplierData
{
    float DamageMultiplierPerPace;                                                    // 0x0000 (size: 0x10)
    float DamageMultiplierPerStance;                                                  // 0x0010 (size: 0xC)
    float WetnessDamageThreshold;                                                     // 0x001C (size: 0x4)
    float WetnessDamageMultiplier;                                                    // 0x0020 (size: 0x4)
    bool DamagedByFloor;                                                              // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FPrisonerClimbAnimationInfo
{
    float MinEdgeHeight;                                                              // 0x0000 (size: 0x4)
    float MaxEdgeHeight;                                                              // 0x0004 (size: 0x4)
    float VaultDistance;                                                              // 0x0008 (size: 0x4)
    float MaxVaultLandHeightError;                                                    // 0x000C (size: 0x4)
    FVector AnchorOffset;                                                             // 0x0010 (size: 0xC)
    class UAnimSequenceBase* AnchoringAnimation;                                      // 0x0020 (size: 0x8)
    float AnchoringAnimationTime;                                                     // 0x0028 (size: 0x4)
    float AnchoringDuration;                                                          // 0x002C (size: 0x4)
    class UAnimMontage* ClimbingMontage;                                              // 0x0030 (size: 0x8)
    float StaminaDrain;                                                               // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FPrisonerCommonData_ResponseIdles
{
    TSubclassOf<class UPrisonerResponseIdle> DirtyAfterProne;                         // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPrisonerConditionalSpawnEquipment
{
    FGameplayTagQuery Condition;                                                      // 0x0000 (size: 0x48)
    TSoftClassPtr<AItem> ItemClass;                                                   // 0x0048 (size: 0x28)
    EBiomeType BiomeRequirement;                                                      // 0x0070 (size: 0x4)

}; // Size: 0x78

struct FPrisonerDistanceTravelledContext
{
}; // Size: 0x20

struct FPrisonerFPWeaponFOVSettings
{
}; // Size: 0x10

struct FPrisonerFirstPersonSubviewBlendOverride
{
    EPrisonerFirstPersonSubview Source;                                               // 0x0000 (size: 0x1)
    EPrisonerFirstPersonSubview Target;                                               // 0x0001 (size: 0x1)
    float Duration;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPrisonerGroundStanceData
{
    float CapsuleHalfHeight;                                                          // 0x0000 (size: 0x4)
    EPrisonerMovementPace MaxMovementPace;                                            // 0x0004 (size: 0x1)
    EPrisonerMovementPace MaxLimpingMovementPace;                                     // 0x0005 (size: 0x1)
    float YawRotationRate;                                                            // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPrisonerHallucinationIllusionInfo
{
    TSoftClassPtr<APrisonerHallucinationIllusion> Class;                              // 0x0000 (size: 0x28)
    TSet<TSoftClassPtr<APrisonerHallucinationIllusion>> IncompatibleClasses;          // 0x0028 (size: 0x50)
    FInt32Range SeverityLevelConstraint;                                              // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FPrisonerHallucinationSymptomSeverityLevelParams
{
    int32 MaxNumHallucinationIllusions;                                               // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FPrisonerInitialSkillInfo
{
    class USkill* Skill;                                                              // 0x0000 (size: 0x8)
    ESkillLevel InitialLevel;                                                         // 0x0008 (size: 0x1)
    float InitialExperiencePoints;                                                    // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPrisonerInjuryTypeLikelihoods
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    float BoneInjuryLikelihood;                                                       // 0x0010 (size: 0x4)
    float MuscleInjuryLikelihood;                                                     // 0x0014 (size: 0x4)
    float OrganInjuryLikelihood;                                                      // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPrisonerMaxMovementPaceVsSeverity
{
    TArray<FPrisonerMaxMovementPaceVsSeverityKey> Keys;                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPrisonerMaxMovementPaceVsSeverityKey
{
    FFloatRange SeverityRange;                                                        // 0x0000 (size: 0x10)
    EPrisonerMovementPace MaxMovementPace;                                            // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FPrisonerMeleeAttackTypes
{
    FGameplayTag PrimaryMeleeAttackTypeWhenNotMoving;                                 // 0x0000 (size: 0x8)
    FGameplayTag PrimaryMeleeAttackTypeWhenWalking;                                   // 0x0008 (size: 0x8)
    FGameplayTag PrimaryMeleeAttackTypeWhenJogging;                                   // 0x0010 (size: 0x8)
    FGameplayTag PrimaryMeleeAttackTypeWhenRunning;                                   // 0x0018 (size: 0x8)
    FGameplayTag PrimaryMeleeAttackTypeWhenFalling;                                   // 0x0020 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenNotMoving;                               // 0x0028 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenWalking;                                 // 0x0030 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenJogging;                                 // 0x0038 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenRunning;                                 // 0x0040 (size: 0x8)
    FGameplayTag SecondaryMeleeAttackTypeWhenFalling;                                 // 0x0048 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenNotMoving;                                   // 0x0050 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenWalking;                                     // 0x0058 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenJogging;                                     // 0x0060 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenRunning;                                     // 0x0068 (size: 0x8)
    FGameplayTag ComboMeleeAttackTypeWhenFalling;                                     // 0x0070 (size: 0x8)
    FGameplayTag BashMeleeAttackType;                                                 // 0x0078 (size: 0x8)
    FGameplayTag WeaponBayonetMeleeAttackType;                                        // 0x0080 (size: 0x8)

}; // Size: 0x88

struct FPrisonerMountReplication
{
    class UObject* MountedSlot;                                                       // 0x0000 (size: 0x8)
    EPrisonerMountSlotFlags _mountFlags;                                              // 0x0008 (size: 0x1)
    uint8 _version;                                                                   // 0x0009 (size: 0x1)

}; // Size: 0x10

struct FPrisonerMovementParams
{
    float MaxSpeed;                                                                   // 0x0000 (size: 0x4)
    float Acceleration;                                                               // 0x0004 (size: 0x4)
    float Deceleration;                                                               // 0x0008 (size: 0x4)
    float Friction;                                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPrisonerMovementSettings_Air
{
    FPrisonerAirMovementParameters Fall;                                              // 0x0000 (size: 0x18)
    FPrisonerAirMovementParameters SkydiveSlow;                                       // 0x0018 (size: 0x18)
    FPrisonerAirMovementParameters SkydiveFast;                                       // 0x0030 (size: 0x18)
    FPrisonerAirMovementParameters HandsBound;                                        // 0x0048 (size: 0x18)
    TMap<class FPrisonerAerialPosePair, class FPrisonerAerialPoseTransition> PoseTransitionParamsMap; // 0x0060 (size: 0x50)
    float JumpZVelocity;                                                              // 0x00B0 (size: 0x4)
    FFloatInterval JumpZVelocityMultiplierVsPerformanceScore;                         // 0x00F0 (size: 0x8)

}; // Size: 0xF8

struct FPrisonerMovementSettings_Ground
{
    FFloatInterval MaxSpeedMultiplierVsPerformanceScore;                              // 0x0000 (size: 0x8)
    FFloatInterval AccelerationMultiplierVsPerformanceScore;                          // 0x0008 (size: 0x8)
    float AccelerationMultiplierWhenImmersedInWater;                                  // 0x0010 (size: 0x4)
    FFloatInterval FrictionMultiplierVsPerformanceScore;                              // 0x0014 (size: 0x8)

}; // Size: 0x1C

struct FPrisonerMovementSettings_Misc
{
    FFloatInterval RotationRateMultiplierVsPerformanceScore;                          // 0x0000 (size: 0x8)
    FFloatInterval ClimbingSpeedMultiplierVsPerformanceScore;                         // 0x0008 (size: 0x8)
    FFloatInterval WindowClimbingSpeedMultiplierVsPerformanceScore;                   // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPrisonerMovementSettings_Water
{
    FFloatInterval MaxSpeedMultiplierVsPerformanceScore;                              // 0x0000 (size: 0x8)
    float DivingWaterEdgeMargin;                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPrisonerNameChangeRequestData
{
}; // Size: 0x20

struct FPrisonerPlayerInfo
{
}; // Size: 0x70

struct FPrisonerReportingEvents
{
}; // Size: 0x288

struct FPrisonerReportingEventsMap
{
}; // Size: 0x60

struct FPrisonerRestingData
{
    EPrisonerRestingMode mode;                                                        // 0x0000 (size: 0x1)
    bool IsRestingOnGround;                                                           // 0x0001 (size: 0x1)
    bool HasChangedTransform;                                                         // 0x0002 (size: 0x1)
    bool HasDisabledCapsuleCollision;                                                 // 0x0003 (size: 0x1)
    bool HasLockedRestingLocation;                                                    // 0x0004 (size: 0x1)
    TWeakObjectPtr<class UAnimSequenceBase> RestingAnimation;                         // 0x0008 (size: 0x8)
    float FeetIKOffset;                                                               // 0x0010 (size: 0x4)
    bool IsRestingOnBedroll;                                                          // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FPrisonerRestingDataAutonomous
{
    bool HasDisabledMovement;                                                         // 0x0000 (size: 0x1)
    FVector_NetQuantize Location;                                                     // 0x0004 (size: 0xC)
    FVector_NetQuantize EulerRotation;                                                // 0x0010 (size: 0xC)

}; // Size: 0x1C

struct FPrisonerRestingParameters
{
    EPrisonerRestingMode mode;                                                        // 0x0000 (size: 0x1)
    bool ShouldUpdateTransform;                                                       // 0x0001 (size: 0x1)
    bool ShouldDisableMovement;                                                       // 0x0002 (size: 0x1)
    bool ShouldDisableCapsuleCollision;                                               // 0x0003 (size: 0x1)
    bool ShouldLockRestingLocation;                                                   // 0x0004 (size: 0x1)
    TWeakObjectPtr<class UAnimSequenceBase> RestingAnimation;                         // 0x0008 (size: 0x8)
    TArray<FVector> EndRestLocations;                                                 // 0x0010 (size: 0x10)
    FTransform Transform;                                                             // 0x0020 (size: 0x30)
    bool IsRestingOnGround;                                                           // 0x0050 (size: 0x1)
    float FeetIKOffset;                                                               // 0x0054 (size: 0x4)
    TWeakObjectPtr<class AItem> Item;                                                 // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FPrisonerSkillInfo
{
}; // Size: 0x18

struct FPrisonerTeleportRequest
{
}; // Size: 0x20

struct FPrisonerThirdPersonSubviewBlendOverride
{
    EPrisonerThirdPersonSubview Source;                                               // 0x0000 (size: 0x1)
    EPrisonerThirdPersonSubview Target;                                               // 0x0001 (size: 0x1)
    float Duration;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPrisonerTurnMontageDescription
{
    class UAnimSequenceBase* AnimationL90;                                            // 0x0000 (size: 0x8)
    class UAnimSequenceBase* AnimationR90;                                            // 0x0008 (size: 0x8)
    FName TurnAngleCurveName;                                                         // 0x0010 (size: 0x8)
    FName SlotName;                                                                   // 0x0018 (size: 0x8)
    float BlendInTime;                                                                // 0x0020 (size: 0x4)
    float BlendOutTime;                                                               // 0x0024 (size: 0x4)
    float BlendOutTriggerTime;                                                        // 0x0028 (size: 0x4)
    float PlayRate;                                                                   // 0x002C (size: 0x4)

}; // Size: 0x30

struct FPrisonerViewInfo : public FMinimalViewInfo
{
    float WeaponFOV;                                                                  // 0x05F0 (size: 0x4)
    FVector WeaponFoveationOffset;                                                    // 0x05F4 (size: 0xC)
    float MinViewYaw;                                                                 // 0x0600 (size: 0x4)
    float MaxViewYaw;                                                                 // 0x0604 (size: 0x4)
    float MinViewPitch;                                                               // 0x0608 (size: 0x4)
    float MaxViewPitch;                                                               // 0x060C (size: 0x4)

}; // Size: 0x610

struct FProjectileArrowData
{
    UClass* AmmunitionArrowClass;                                                     // 0x0000 (size: 0x8)
    float ItemsHealth;                                                                // 0x0008 (size: 0x4)
    float StiffnessFactor;                                                            // 0x000C (size: 0x4)
    float FlightRotationCorrectionSpeed;                                              // 0x0010 (size: 0x4)
    float DeviationDegrees;                                                           // 0x0014 (size: 0x4)
    bool IsPartOfEvent;                                                               // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FProjectileData
{
    FText Caption;                                                                    // 0x0000 (size: 0x18)
    float Caliber;                                                                    // 0x0018 (size: 0x4)
    float Weight;                                                                     // 0x001C (size: 0x4)
    float MuzzleVelocity;                                                             // 0x0020 (size: 0x4)
    float BallisticCoefficient;                                                       // 0x0024 (size: 0x4)
    EBallisticDragModel BallisticDragModel;                                           // 0x0028 (size: 0x1)
    float InitialDamage;                                                              // 0x002C (size: 0x4)
    float InitialDamageInGameEvent;                                                   // 0x0030 (size: 0x4)
    FTargetTypeDamageMultiplier TargetTypeMultiplier;                                 // 0x0038 (size: 0x10)
    float PenetrationFactor;                                                          // 0x0048 (size: 0x4)
    float GlancingAngle;                                                              // 0x004C (size: 0x4)
    bool AllowGlanceOrForceBounce;                                                    // 0x0050 (size: 0x1)
    float BounceAngle;                                                                // 0x0054 (size: 0x4)
    float ArmorPiercingFactor;                                                        // 0x0058 (size: 0x4)
    bool CanCauseHeadExplosion;                                                       // 0x005C (size: 0x1)

}; // Size: 0x60

struct FProjectileImpulseMultiplier
{
    TSubclassOf<class AActor> ActorClass;                                             // 0x0000 (size: 0x8)
    float Multiplier;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FProximityReplenishedResourceDescription
{
    float ReplenishChance;                                                            // 0x0000 (size: 0x4)
    FFloatInterval ReplenishAmount;                                                   // 0x0004 (size: 0x8)
    float ReplenishTimeout;                                                           // 0x000C (size: 0x4)

}; // Size: 0x10

struct FQuestCycleStatsKey
{
}; // Size: 0x30

struct FQuestGiverIdentifier
{
}; // Size: 0x20

struct FQuestGiverSetup
{
    int32 MaxQuestsGeneratedPerDay;                                                   // 0x0000 (size: 0x4)
    int32 InitiallyGeneratedQuests;                                                   // 0x0004 (size: 0x4)
    int32 MaxAvailableQuests;                                                         // 0x0008 (size: 0x4)
    TMap<int32, int32> MinQuestsAvailablePerTier;                                     // 0x0010 (size: 0x50)
    TMap<int32, float> QuestsProbabilityPerTier;                                      // 0x0060 (size: 0x50)
    TSoftClassPtr<ASedentaryNPC> AllowedOnlyFromNPC;                                  // 0x00B0 (size: 0x28)
    TSoftClassPtr<ASedentaryNPC> RequireCompletedQuestFromOtherNPC;                   // 0x00D8 (size: 0x28)
    int32 RequireCompletedQuestsFromOtherNPCTier;                                     // 0x0100 (size: 0x4)
    int32 RequireCompletedQuestsFromOtherNPCNum;                                      // 0x0104 (size: 0x4)
    bool AllowAutoComplete;                                                           // 0x0108 (size: 0x1)

}; // Size: 0x110

struct FQuestGiverUIData
{
    FText Name;                                                                       // 0x0000 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0018 (size: 0x28)
    TArray<FText> PlayerQuestAcceptResponses;                                         // 0x0040 (size: 0x10)
    TArray<FText> QuestGiverQuestCompletedResponses;                                  // 0x0050 (size: 0x10)
