#ifndef UE4SS_SDK_UI_CookingRecipeDetails_HPP
#define UE4SS_SDK_UI_CookingRecipeDetails_HPP

class UUI_CookingRecipeDetails_C : public UCookingRecipeDetailsWidget
{
    class UImage* Image_77;                                                           // 0x0310 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget;          // 0x0318 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_1;        // 0x0320 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_2;        // 0x0328 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_3;        // 0x0330 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_4;        // 0x0338 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_5;        // 0x0340 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_6;        // 0x0348 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_7;        // 0x0350 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_8;        // 0x0358 (size: 0x8)
    class UUI_CookingIngredientInfoWidget_C* UI_CookingIngredientInfoWidget_9;        // 0x0360 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget;  // 0x0368 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_1; // 0x0370 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_2; // 0x0378 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_3; // 0x0380 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_4; // 0x0388 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_5; // 0x0390 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_6; // 0x0398 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_7; // 0x03A0 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_9; // 0x03A8 (size: 0x8)
    class UUI_PossibleCookingIngredientWidget_C* UI_PossibleCookingIngredientWidget_206; // 0x03B0 (size: 0x8)

}; // Size: 0x3B8

#endif
