// WidgetBlueprintGeneratedClass UI_DialLockWidget.UI_DialLockWidget_C
// Size: 0x2e8 (Inherited: 0x2a8)
struct UUI_DialLockWidget_C : UDialLockWidget {
	struct UImage* Image; // 0x2a8(0x08)
	struct UImage* Image_62; // 0x2b0(0x08)
	struct UCanvasPanel* InfoPanelSecondary; // 0x2b8(0x08)
	struct URetainerBox* MaskRetainerBox; // 0x2c0(0x08)
	struct UImage* RenderedMinigame; // 0x2c8(0x08)
	struct UImage* TextBackground; // 0x2d0(0x08)
	struct UCircularThrobber* Throbber; // 0x2d8(0x08)
	struct UImage* ThrobberBackground; // 0x2e0(0x08)
};

