#ifndef UE4SS_SDK_UI_DoorUpgrade_HPP
#define UE4SS_SDK_UI_DoorUpgrade_HPP

class UUI_DoorUpgrade_C : public UDoorUpgradeWidget
{
    class UImage* CraftingTitle;                                                      // 0x03A8 (size: 0x8)
    class UImage* CraftingTitle_1;                                                    // 0x03B0 (size: 0x8)
    class UImage* CraftingTitle_2;                                                    // 0x03B8 (size: 0x8)
    class UImage* CraftingTitle_3;                                                    // 0x03C0 (size: 0x8)
    class UImage* Image;                                                              // 0x03C8 (size: 0x8)
    class UImage* Image_0;                                                            // 0x03D0 (size: 0x8)
    class UImage* Image_1;                                                            // 0x03D8 (size: 0x8)
    class UImage* Image_2;                                                            // 0x03E0 (size: 0x8)
    class UTextBlock* TitleText;                                                      // 0x03E8 (size: 0x8)
    class UTextBlock* TitleText_1;                                                    // 0x03F0 (size: 0x8)
    class UTextBlock* TitleText_4;                                                    // 0x03F8 (size: 0x8)
    class UTextBlock* TitleText_8;                                                    // 0x0400 (size: 0x8)
    class UUI_DoorBCULockUpgradeSlot_C* UI_DoorBCULockUpgradeSlot2;                   // 0x0408 (size: 0x8)
    class UUI_DoorRemoteSensorUpgradeSlot_C* UI_DoorRemoteSensorUpgradeSlot_2;        // 0x0410 (size: 0x8)
    class UUI_DoorSecurityUpgradeSlot_C* UI_DoorSecurityUpgradeSlot_1;                // 0x0418 (size: 0x8)
    class UUI_DoorSecurityUpgradeSlot_C* UI_DoorSecurityUpgradeSlot_2;                // 0x0420 (size: 0x8)
    class UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot;                                  // 0x0428 (size: 0x8)
    class UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot_0;                                // 0x0430 (size: 0x8)
    class UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot_1;                                // 0x0438 (size: 0x8)

}; // Size: 0x440

#endif
