#ifndef UE4SS_SDK_UI_DialLockWidget_HPP
#define UE4SS_SDK_UI_DialLockWidget_HPP

class UUI_DialLockWidget_C : public UDialLockWidget
{
    class UImage* Image;                                                              // 0x02A8 (size: 0x8)
    class UImage* Image_61;                                                           // 0x02B0 (size: 0x8)
    class UCanvasPanel* InfoPanelSecondary;                                           // 0x02B8 (size: 0x8)
    class URetainerBox* MaskRetainerBox;                                              // 0x02C0 (size: 0x8)
    class UImage* RenderedMinigame;                                                   // 0x02C8 (size: 0x8)
    class UImage* TextBackground;                                                     // 0x02D0 (size: 0x8)
    class UCircularThrobber* Throbber;                                                // 0x02D8 (size: 0x8)
    class UImage* ThrobberBackground;                                                 // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
