// WidgetBlueprintGeneratedClass UI_DoorUpgrade.UI_DoorUpgrade_C
// Size: 0x440 (Inherited: 0x3a8)
struct UUI_DoorUpgrade_C : UDoorUpgradeWidget {
	struct UImage* CraftingTitle; // 0x3a8(0x08)
	struct UImage* CraftingTitle_2; // 0x3b0(0x08)
	struct UImage* CraftingTitle_3; // 0x3b8(0x08)
	struct UImage* CraftingTitle_4; // 0x3c0(0x08)
	struct UImage* Image; // 0x3c8(0x08)
	struct UImage* Image_1; // 0x3d0(0x08)
	struct UImage* Image_2; // 0x3d8(0x08)
	struct UImage* Image_3; // 0x3e0(0x08)
	struct UTextBlock* TitleText; // 0x3e8(0x08)
	struct UTextBlock* TitleText_2; // 0x3f0(0x08)
	struct UTextBlock* TitleText_5; // 0x3f8(0x08)
	struct UTextBlock* TitleText_9; // 0x400(0x08)
	struct UUI_DoorBCULockUpgradeSlot_C* UI_DoorBCULockUpgradeSlot2; // 0x408(0x08)
	struct UUI_DoorRemoteSensorUpgradeSlot_C* UI_DoorRemoteSensorUpgradeSlot_3; // 0x410(0x08)
	struct UUI_DoorSecurityUpgradeSlot_C* UI_DoorSecurityUpgradeSlot_2; // 0x418(0x08)
	struct UUI_DoorSecurityUpgradeSlot_C* UI_DoorSecurityUpgradeSlot_3; // 0x420(0x08)
	struct UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot; // 0x428(0x08)
	struct UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot_1; // 0x430(0x08)
	struct UUI_DoorUpgradeSlot_C* UI_DoorUpgradeSlot_2; // 0x438(0x08)
};

