#ifndef UE4SS_SDK_UI_FoodOverviewTooltipPanel_HPP
#define UE4SS_SDK_UI_FoodOverviewTooltipPanel_HPP

class UUI_FoodOverviewTooltipPanel_C : public UItemTooltipPanel
{
    class UImage* Image_8;                                                            // 0x02B8 (size: 0x8)
    class UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_0;                // 0x02C0 (size: 0x8)
    class UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_1;                // 0x02C8 (size: 0x8)
    class UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_2;                // 0x02D0 (size: 0x8)
    class UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_4;                // 0x02D8 (size: 0x8)
    class UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_5;                // 0x02E0 (size: 0x8)
    class UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_6;                // 0x02E8 (size: 0x8)
    class UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_7;                // 0x02F0 (size: 0x8)

}; // Size: 0x2F8

#endif
