#ifndef UE4SS_SDK_UI_FoodTooltipPanelSingleUse_HPP
#define UE4SS_SDK_UI_FoodTooltipPanelSingleUse_HPP

class UUI_FoodTooltipPanelSingleUse_C : public UItemTooltipPanel
{
    class UImage* Image_0;                                                            // 0x02B8 (size: 0x8)
    class UImage* Image_1;                                                            // 0x02C0 (size: 0x8)
    class UImage* Image_2;                                                            // 0x02C8 (size: 0x8)
    class UImage* Image_4;                                                            // 0x02D0 (size: 0x8)
    class UImage* Image_5;                                                            // 0x02D8 (size: 0x8)
    class UImage* Image_6;                                                            // 0x02E0 (size: 0x8)
    class UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement;            // 0x02E8 (size: 0x8)
    class UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_0;        // 0x02F0 (size: 0x8)
    class UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_1;        // 0x02F8 (size: 0x8)
    class UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_2;        // 0x0300 (size: 0x8)
    class UUI_TooltipOverviewTextElement_C* UI_TooltipOverviewTextElement_C_3;        // 0x0308 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement; // 0x0310 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_1; // 0x0318 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_0; // 0x0320 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_1; // 0x0328 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_2; // 0x0330 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_3; // 0x0338 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_4; // 0x0340 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_5; // 0x0348 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_6; // 0x0350 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_7; // 0x0358 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_8; // 0x0360 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_9; // 0x0368 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_10; // 0x0370 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_11; // 0x0378 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_12; // 0x0380 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_13; // 0x0388 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_14; // 0x0390 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_15; // 0x0398 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_16; // 0x03A0 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_17; // 0x03A8 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_18; // 0x03B0 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_19; // 0x03B8 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_20; // 0x03C0 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_21; // 0x03C8 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_22; // 0x03D0 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_23; // 0x03D8 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_24; // 0x03E0 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_25; // 0x03E8 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_26; // 0x03F0 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_27; // 0x03F8 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_36; // 0x0400 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_38; // 0x0408 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_39; // 0x0410 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_40; // 0x0418 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_41; // 0x0420 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_42; // 0x0428 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_43; // 0x0430 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_44; // 0x0438 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_45; // 0x0440 (size: 0x8)
    class UUI_TooltipOverviewTextParameterElement_C* UI_TooltipOverviewTextParameterElement_C_46; // 0x0448 (size: 0x8)

}; // Size: 0x450

#endif
