#ifndef UE4SS_SDK_UI_ItemsCraftingDetailsPanel_HPP
#define UE4SS_SDK_UI_ItemsCraftingDetailsPanel_HPP

class UUI_ItemsCraftingDetailsPanel_C : public UItemsCraftingDetailsPanel
{
    class UImage* HorizontalSeperator;                                                // 0x0388 (size: 0x8)
    class UImage* Image;                                                              // 0x0390 (size: 0x8)
    class UImage* Image_239;                                                          // 0x0398 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton;    // 0x03A0 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_1;  // 0x03A8 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_2;  // 0x03B0 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_3;  // 0x03B8 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_4;  // 0x03C0 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_5;  // 0x03C8 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_6;  // 0x03D0 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_7;  // 0x03D8 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_8;  // 0x03E0 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_9;  // 0x03E8 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_10; // 0x03F0 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_11; // 0x03F8 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_12; // 0x0400 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_13; // 0x0408 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_14; // 0x0410 (size: 0x8)
    class UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_15; // 0x0418 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton;                    // 0x0420 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_1;                  // 0x0428 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_2;                  // 0x0430 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_3;                  // 0x0438 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_4;                  // 0x0440 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_5;                  // 0x0448 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_6;                  // 0x0450 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_7;                  // 0x0458 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_8;                  // 0x0460 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_9;                  // 0x0468 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_10;                 // 0x0470 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_11;                 // 0x0478 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_12;                 // 0x0480 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_13;                 // 0x0488 (size: 0x8)
    class UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_14;                 // 0x0490 (size: 0x8)

}; // Size: 0x498

#endif
