// WidgetBlueprintGeneratedClass UI_ItemsCraftingDetailsPanel.UI_ItemsCraftingDetailsPanel_C
// Size: 0x498 (Inherited: 0x388)
struct UUI_ItemsCraftingDetailsPanel_C : UItemsCraftingDetailsPanel {
	struct UImage* HorizontalSeperator; // 0x388(0x08)
	struct UImage* Image; // 0x390(0x08)
	struct UImage* Image_240; // 0x398(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton; // 0x3a0(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_2; // 0x3a8(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_3; // 0x3b0(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_4; // 0x3b8(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_5; // 0x3c0(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_6; // 0x3c8(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_7; // 0x3d0(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_8; // 0x3d8(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_9; // 0x3e0(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_10; // 0x3e8(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_11; // 0x3f0(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_12; // 0x3f8(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_13; // 0x400(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_14; // 0x408(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_15; // 0x410(0x08)
	struct UUI_PossibleRecipeIngredientButton_C* UI_PossibleRecipeIngredientButton_16; // 0x418(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton; // 0x420(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_2; // 0x428(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_3; // 0x430(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_4; // 0x438(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_5; // 0x440(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_6; // 0x448(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_7; // 0x450(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_8; // 0x458(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_9; // 0x460(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_10; // 0x468(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_11; // 0x470(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_12; // 0x478(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_13; // 0x480(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_14; // 0x488(0x08)
	struct UUI_RecipeIngredientButton_C* UI_RecipeIngredientButton_15; // 0x490(0x08)
};

