#ifndef UE4SS_SDK_UI_IngredientsForRecipeWidget_HPP
#define UE4SS_SDK_UI_IngredientsForRecipeWidget_HPP

class UUI_IngredientsForRecipeWidget_C : public UIngredientsForRecipeWidget
{
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget;          // 0x0288 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_1;        // 0x0290 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_2;        // 0x0298 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_3;        // 0x02A0 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_4;        // 0x02A8 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_5;        // 0x02B0 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_6;        // 0x02B8 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_7;        // 0x02C0 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_8;        // 0x02C8 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_9;        // 0x02D0 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_10;       // 0x02D8 (size: 0x8)
    class UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_11;       // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
