// WidgetBlueprintGeneratedClass UI_ItemsCraftingPanel.UI_ItemsCraftingPanel_C
// Size: 0x428 (Inherited: 0x3e8)
struct UUI_ItemsCraftingPanel_C : UItemsCraftingPanel {
	struct UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer; // 0x3e8(0x08)
	struct UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_2; // 0x3f0(0x08)
	struct UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_3; // 0x3f8(0x08)
	struct UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_4; // 0x400(0x08)
	struct UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_5; // 0x408(0x08)
	struct UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_6; // 0x410(0x08)
	struct UUI_HighlightableArea_C* UI_HighlightableArea; // 0x418(0x08)
	struct UUI_HighlightableArea_C* UI_HighlightableArea_58; // 0x420(0x08)
};

