// WidgetBlueprintGeneratedClass UI_IngredientsForRecipeWidget.UI_IngredientsForRecipeWidget_C
// Size: 0x2e8 (Inherited: 0x288)
struct UUI_IngredientsForRecipeWidget_C : UIngredientsForRecipeWidget {
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget; // 0x288(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_2; // 0x290(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_3; // 0x298(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_4; // 0x2a0(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_5; // 0x2a8(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_6; // 0x2b0(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_7; // 0x2b8(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_8; // 0x2c0(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_9; // 0x2c8(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_10; // 0x2d0(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_11; // 0x2d8(0x08)
	struct UUI_InteractiveIngredientWidget_C* UI_InteractiveIngredientWidget_12; // 0x2e0(0x08)
};

