#ifndef UE4SS_SDK_UI_ItemsCraftingPanel_HPP
#define UE4SS_SDK_UI_ItemsCraftingPanel_HPP

class UUI_ItemsCraftingPanel_C : public UItemsCraftingPanel
{
    class UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer;    // 0x03E8 (size: 0x8)
    class UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_1;  // 0x03F0 (size: 0x8)
    class UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_2;  // 0x03F8 (size: 0x8)
    class UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_3;  // 0x0400 (size: 0x8)
    class UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_4;  // 0x0408 (size: 0x8)
    class UUI_CraftingRecipeButtonsContainer_C* UI_CraftingRecipeButtonsContainer_5;  // 0x0410 (size: 0x8)
    class UUI_HighlightableArea_C* UI_HighlightableArea;                              // 0x0418 (size: 0x8)
    class UUI_HighlightableArea_C* UI_HighlightableArea_57;                           // 0x0420 (size: 0x8)

}; // Size: 0x428

#endif
