#ifndef UE4SS_SDK_UI_SimpleTextEntryVerticalDropdown_Content_HPP
#define UE4SS_SDK_UI_SimpleTextEntryVerticalDropdown_Content_HPP

class UUI_SimpleTextEntryVerticalDropdown_Content_C : public UVerticalScrollBoxDropdownContent
{
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry;                  // 0x0278 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_1;                // 0x0280 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_2;                // 0x0288 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_3;                // 0x0290 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_4;                // 0x0298 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_5;                // 0x02A0 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_6;                // 0x02A8 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_7;                // 0x02B0 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_8;                // 0x02B8 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_9;                // 0x02C0 (size: 0x8)
    class UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_10;               // 0x02C8 (size: 0x8)

}; // Size: 0x2D0

#endif
