// WidgetBlueprintGeneratedClass UI_SimpleTextEntryVerticalDropdown_Content.UI_SimpleTextEntryVerticalDropdown_Content_C
// Size: 0x2d0 (Inherited: 0x278)
struct UUI_SimpleTextEntryVerticalDropdown_Content_C : UVerticalScrollBoxDropdownContent {
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry; // 0x278(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_2; // 0x280(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_3; // 0x288(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_4; // 0x290(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_5; // 0x298(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_6; // 0x2a0(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_7; // 0x2a8(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_8; // 0x2b0(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_9; // 0x2b8(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_10; // 0x2c0(0x08)
	struct UUI_SimpleTextDropdownEntry_C* UI_SimpleTextDropdownEntry_11; // 0x2c8(0x08)
};

