#ifndef UE4SS_SDK_UI_SpawnSectorSelector_HPP
#define UE4SS_SDK_UI_SpawnSectorSelector_HPP

class UUI_SpawnSectorSelector_C : public USpawnSectorSelectorWidget
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0278 (size: 0x8)
    class UButton* Button;                                                            // 0x0280 (size: 0x8)
    class UButton* Button_0;                                                          // 0x0288 (size: 0x8)
    class UButton* Button_1;                                                          // 0x0290 (size: 0x8)
    class UButton* Button_2;                                                          // 0x0298 (size: 0x8)
    class UButton* Button_3;                                                          // 0x02A0 (size: 0x8)
    class UButton* Button_4;                                                          // 0x02A8 (size: 0x8)
    class UButton* Button_5;                                                          // 0x02B0 (size: 0x8)
    class UButton* Button_6;                                                          // 0x02B8 (size: 0x8)
    class UButton* Button_7;                                                          // 0x02C0 (size: 0x8)
    class UButton* Button_8;                                                          // 0x02C8 (size: 0x8)
    class UButton* Button_9;                                                          // 0x02D0 (size: 0x8)
    class UButton* Button_10;                                                         // 0x02D8 (size: 0x8)
    class UButton* Button_11;                                                         // 0x02E0 (size: 0x8)
    class UButton* Button_12;                                                         // 0x02E8 (size: 0x8)
    class UButton* Button_13;                                                         // 0x02F0 (size: 0x8)
    class UButton* Button_14;                                                         // 0x02F8 (size: 0x8)
    class UButton* Button_15;                                                         // 0x0300 (size: 0x8)
    class UButton* Button_16;                                                         // 0x0308 (size: 0x8)
    class UButton* Button_17;                                                         // 0x0310 (size: 0x8)
    class UButton* Button_18;                                                         // 0x0318 (size: 0x8)
    class UButton* Button_19;                                                         // 0x0320 (size: 0x8)
    class UButton* Button_20;                                                         // 0x0328 (size: 0x8)
    class UButton* Button_21;                                                         // 0x0330 (size: 0x8)
    class UButton* Button_22;                                                         // 0x0338 (size: 0x8)
    class UButton* Button_23;                                                         // 0x0340 (size: 0x8)
    class UImage* MapImage;                                                           // 0x0348 (size: 0x8)
    class UUniformGridPanel* UniformGridPanel_0;                                      // 0x0350 (size: 0x8)

    void BndEvt__Button_1_K2Node_ComponentBoundEvent_544_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_0_K2Node_ComponentBoundEvent_561_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_2_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_15_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_14_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_13_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_12_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_11_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_10_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_9_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_8_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_7_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_6_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_5_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_4_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_3_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_23_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_22_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_21_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_20_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_19_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_18_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_17_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_16_K2Node_ComponentBoundEvent_21_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__Button_K2Node_ComponentBoundEvent_22_OnButtonClickedEvent__DelegateSignature();
    void ExecuteUbergraph_UI_SpawnSectorSelector(int32 EntryPoint);
}; // Size: 0x358

#endif
