#ifndef UE4SS_SDK_UI_SquadEditor_HPP
#define UE4SS_SDK_UI_SquadEditor_HPP

class UUI_SquadEditor_C : public USquadEditor
{
    class UImage* Image;                                                              // 0x0378 (size: 0x8)
    class UImage* Image_1;                                                            // 0x0380 (size: 0x8)
    class UImage* Image_3;                                                            // 0x0388 (size: 0x8)
    class UImage* Image_185;                                                          // 0x0390 (size: 0x8)
    class UImage* Image_433;                                                          // 0x0398 (size: 0x8)
    class UImage* Image_785;                                                          // 0x03A0 (size: 0x8)
    class URetainerBox* RetainerBox_0;                                                // 0x03A8 (size: 0x8)
    class URetainerBox* RetainerBox_1;                                                // 0x03B0 (size: 0x8)
    class URetainerBox* RetainerBox_2;                                                // 0x03B8 (size: 0x8)

}; // Size: 0x3C0

#endif
