// WidgetBlueprintGeneratedClass UI_Trader_BuyPanel.UI_Trader_BuyPanel_C
// Size: 0x9e8 (Inherited: 0x4c8)
struct UUI_Trader_BuyPanel_C : UTraderBuyPanel {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4c8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnAmmo; // 0x4d0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnArmor; // 0x4d8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnArrows; // 0x4e0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnAssault; // 0x4e8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnBallisticVests; // 0x4f0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnBaseBuildingExpansion; // 0x4f8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnBayonets; // 0x500(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnBicycles; // 0x508(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnBlunt; // 0x510(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnBolts; // 0x518(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnBows; // 0x520(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnBullets; // 0x528(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnC4; // 0x530(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCharmsDLC; // 0x538(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCityBike; // 0x540(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianBags; // 0x548(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianClothing; // 0x550(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianFootwear; // 0x558(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianGloves; // 0x560(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwear; // 0x568(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearCaps; // 0x570(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearEyewear; // 0x578(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearHelmets; // 0x580(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearMasks; // 0x588(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianPants; // 0x590(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianPantsLong; // 0x598(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianPantsShort; // 0x5a0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianTops; // 0x5a8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsJackets; // 0x5b0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsLongSleeves; // 0x5b8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsShirts; // 0x5c0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCivilianUnderwear; // 0x5c8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnClothing; // 0x5d0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCombatHelmets; // 0x5d8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCraftingMaterials; // 0x5e0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCrossbows; // 0x5e8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCruiserParts; // 0x5f0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnCutting; // 0x5f8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnDetonators; // 0x600(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnDirtbikeParts; // 0x608(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnExplosives; // 0x610(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFarming; // 0x618(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFarmingTools; // 0x620(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFertilizers; // 0x628(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFlashlights; // 0x630(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFood; // 0x638(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodCooked; // 0x640(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodDrinks; // 0x648(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFresh; // 0x650(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFreshFruit; // 0x658(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFreshMeat; // 0x660(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFreshMushrooms; // 0x668(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodFreshVegetables; // 0x670(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFoodProcessed; // 0x678(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnFourWheels; // 0x680(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnGhillieWraps; // 0x688(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnGrenadeLaunchers; // 0x690(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnGrenades; // 0x698(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnHandguns; // 0x6a0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnHelmets; // 0x6a8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnLaikaParts; // 0x6b0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnLMGs; // 0x6b8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMagazines; // 0x6c0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMedical; // 0x6c8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMeleeWeapons; // 0x6d0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBags; // 0x6d8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsAssault; // 0x6e0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsHiking; // 0x6e8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsWaist; // 0x6f0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBoots; // 0x6f8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBootsAssault; // 0x700(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryBootsHiking; // 0x708(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryClothing; // 0x710(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryGloves; // 0x718(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwear; // 0x720(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearBalaclava; // 0x728(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearCaps; // 0x730(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearGasMasks; // 0x738(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearGoggles; // 0x740(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHelmets; // 0x748(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryHolsters; // 0x750(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPants; // 0x758(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsCargo; // 0x760(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsGhillie; // 0x768(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsShorts; // 0x770(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsTactical; // 0x778(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryScarfs; // 0x780(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTops; // 0x788(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsGhillies; // 0x790(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsJackets; // 0x798(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsShirts; // 0x7a0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsSweaters; // 0x7a8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMines; // 0x7b0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMiscellaneous; // 0x7b8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMOtorbikes; // 0x7c0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMotorboats; // 0x7c8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnMountainBike; // 0x7d0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnPesticides; // 0x7d8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnPiercing; // 0x7e0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnPoliceVests; // 0x7e8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnQuivers; // 0x7f0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnRafts; // 0x7f8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnRagerParts; // 0x800(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnRails; // 0x808(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnRangedWeapons; // 0x810(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnRifles; // 0x818(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnRISParts; // 0x820(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnSales; // 0x828(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnScopes; // 0x830(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnSeeds; // 0x838(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnServices; // 0x840(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnShotguns; // 0x848(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnSights; // 0x850(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnSMGs; // 0x858(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnStabproofVests; // 0x860(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnStorage; // 0x868(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnSUP; // 0x870(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnSuppressors; // 0x878(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnTacticalVests; // 0x880(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnTools; // 0x888(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsFishing; // 0x890(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsLockpicking; // 0x898(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsRepair; // 0x8a0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsRepairOther; // 0x8a8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnToolsRepairVehicle; // 0x8b0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnTractorParts; // 0x8b8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnTwoWheels; // 0x8c0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnVests; // 0x8c8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnVintageHelmets; // 0x8d0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnWeaponAccessories; // 0x8d8(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnWeaponParts; // 0x8e0(0x08)
	struct UUI_Trader_ItemCategoryButton_C* _btnWolfsWagenParts; // 0x8e8(0x08)
	struct UWrapBox* _cat2wdVehicles; // 0x8f0(0x08)
	struct UWrapBox* _cat4wdVehicles; // 0x8f8(0x08)
	struct UWrapBox* _catAmmo; // 0x900(0x08)
	struct UWrapBox* _catArmor; // 0x908(0x08)
	struct UWrapBox* _catArmorHelmets; // 0x910(0x08)
	struct UWrapBox* _catArmorVests; // 0x918(0x08)
	struct UWrapBox* _catBicycles; // 0x920(0x08)
	struct UWrapBox* _catClothing; // 0x928(0x08)
	struct UWrapBox* _catClothingCivilian; // 0x930(0x08)
	struct UWrapBox* _catClothingCivilianHeadwear; // 0x938(0x08)
	struct UWrapBox* _catClothingCivilianPants; // 0x940(0x08)
	struct UWrapBox* _catClothingCivilianTops; // 0x948(0x08)
	struct UWrapBox* _catClothingMilitary; // 0x950(0x08)
	struct UWrapBox* _catClothingMilitaryBags; // 0x958(0x08)
	struct UWrapBox* _catClothingMilitaryBoots; // 0x960(0x08)
	struct UWrapBox* _catClothingMilitaryHeadwear; // 0x968(0x08)
	struct UWrapBox* _catClothingMilitaryPants; // 0x970(0x08)
	struct UWrapBox* _catClothingMilitaryTops; // 0x978(0x08)
	struct UWrapBox* _catExplosives; // 0x980(0x08)
	struct UWrapBox* _catFarming; // 0x988(0x08)
	struct UWrapBox* _catFood; // 0x990(0x08)
	struct UWrapBox* _catFoodFresh; // 0x998(0x08)
	struct UWrapBox* _catMeleeWeapons; // 0x9a0(0x08)
	struct UWrapBox* _catMotorbikes; // 0x9a8(0x08)
	struct UWrapBox* _catRangedWeapons; // 0x9b0(0x08)
	struct UWrapBox* _catTools; // 0x9b8(0x08)
	struct UWrapBox* _catToolsRepair; // 0x9c0(0x08)
	struct UWrapBox* _catVehiclesAndItems; // 0x9c8(0x08)
	struct UWrapBox* _catWeaponAccessories; // 0x9d0(0x08)
	struct UScrollBox* _mainScrollBox; // 0x9d8(0x08)
	struct UImage* Image_32; // 0x9e0(0x08)

	void Construct(); // Function UI_Trader_BuyPanel.UI_Trader_BuyPanel_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x297fc00
	void ExecuteUbergraph_UI_Trader_BuyPanel(int32_t EntryPoint); // Function UI_Trader_BuyPanel.UI_Trader_BuyPanel_C.ExecuteUbergraph_UI_Trader_BuyPanel // (Final|UbergraphFunction) // @ game+0x297fc00
};

