#ifndef UE4SS_SDK_UI_TournamentScoreboardWidget_HPP
#define UE4SS_SDK_UI_TournamentScoreboardWidget_HPP

class UUI_TournamentScoreboardWidget_C : public UTournamentScoreboardWidget
{
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow;                  // 0x0280 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_1;                // 0x0288 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_2;                // 0x0290 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_3;                // 0x0298 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_4;                // 0x02A0 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_5;                // 0x02A8 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_6;                // 0x02B0 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_7;                // 0x02B8 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_8;                // 0x02C0 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_9;                // 0x02C8 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_10;               // 0x02D0 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_11;               // 0x02D8 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_12;               // 0x02E0 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_13;               // 0x02E8 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_14;               // 0x02F0 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_15;               // 0x02F8 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_16;               // 0x0300 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_17;               // 0x0308 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_18;               // 0x0310 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_19;               // 0x0318 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_20;               // 0x0320 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_21;               // 0x0328 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_22;               // 0x0330 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_23;               // 0x0338 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_24;               // 0x0340 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_25;               // 0x0348 (size: 0x8)
    class UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_39;               // 0x0350 (size: 0x8)

}; // Size: 0x358

#endif
