// WidgetBlueprintGeneratedClass UI_TournamentScoreboardWidget.UI_TournamentScoreboardWidget_C
// Size: 0x358 (Inherited: 0x280)
struct UUI_TournamentScoreboardWidget_C : UTournamentScoreboardWidget {
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow; // 0x280(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_2; // 0x288(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_3; // 0x290(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_4; // 0x298(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_5; // 0x2a0(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_6; // 0x2a8(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_7; // 0x2b0(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_8; // 0x2b8(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_9; // 0x2c0(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_10; // 0x2c8(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_11; // 0x2d0(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_12; // 0x2d8(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_13; // 0x2e0(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_14; // 0x2e8(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_15; // 0x2f0(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_16; // 0x2f8(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_17; // 0x300(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_18; // 0x308(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_19; // 0x310(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_20; // 0x318(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_21; // 0x320(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_22; // 0x328(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_23; // 0x330(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_24; // 0x338(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_25; // 0x340(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_26; // 0x348(0x08)
	struct UUI_TournamentScoreboardRow_C* UI_TournamentScoreboardRow_40; // 0x350(0x08)
};

