#ifndef UE4SS_SDK_UI_Trader_BuyPanel_HPP
#define UE4SS_SDK_UI_Trader_BuyPanel_HPP

class UUI_Trader_BuyPanel_C : public UTraderBuyPanel
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x04C8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnAmmo;                                  // 0x04D0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnArmor;                                 // 0x04D8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnArrows;                                // 0x04E0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnAssault;                               // 0x04E8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnBallisticVests;                        // 0x04F0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnBaseBuildingExpansion;                 // 0x04F8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnBayonets;                              // 0x0500 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnBicycles;                              // 0x0508 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnBlunt;                                 // 0x0510 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnBolts;                                 // 0x0518 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnBows;                                  // 0x0520 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnBullets;                               // 0x0528 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnC4;                                    // 0x0530 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCharmsDLC;                             // 0x0538 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCityBike;                              // 0x0540 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianBags;                          // 0x0548 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianClothing;                      // 0x0550 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianFootwear;                      // 0x0558 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianGloves;                        // 0x0560 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwear;                      // 0x0568 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearCaps;                  // 0x0570 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearEyewear;               // 0x0578 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearHelmets;               // 0x0580 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianHeadwearMasks;                 // 0x0588 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianPants;                         // 0x0590 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianPantsLong;                     // 0x0598 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianPantsShort;                    // 0x05A0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianTops;                          // 0x05A8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsJackets;                   // 0x05B0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsLongSleeves;               // 0x05B8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianTopsShirts;                    // 0x05C0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCivilianUnderwear;                     // 0x05C8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnClothing;                              // 0x05D0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCombatHelmets;                         // 0x05D8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCraftingMaterials;                     // 0x05E0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCrossbows;                             // 0x05E8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCruiserParts;                          // 0x05F0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnCutting;                               // 0x05F8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnDetonators;                            // 0x0600 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnDirtbikeParts;                         // 0x0608 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnExplosives;                            // 0x0610 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFarming;                               // 0x0618 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFarmingTools;                          // 0x0620 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFertilizers;                           // 0x0628 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFlashlights;                           // 0x0630 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFood;                                  // 0x0638 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFoodCooked;                            // 0x0640 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFoodDrinks;                            // 0x0648 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFoodFresh;                             // 0x0650 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFoodFreshFruit;                        // 0x0658 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFoodFreshMeat;                         // 0x0660 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFoodFreshMushrooms;                    // 0x0668 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFoodFreshVegetables;                   // 0x0670 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFoodProcessed;                         // 0x0678 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnFourWheels;                            // 0x0680 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnGhillieWraps;                          // 0x0688 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnGrenadeLaunchers;                      // 0x0690 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnGrenades;                              // 0x0698 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnHandguns;                              // 0x06A0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnHelmets;                               // 0x06A8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnLaikaParts;                            // 0x06B0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnLMGs;                                  // 0x06B8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMagazines;                             // 0x06C0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMedical;                               // 0x06C8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMeleeWeapons;                          // 0x06D0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryBags;                          // 0x06D8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsAssault;                   // 0x06E0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsHiking;                    // 0x06E8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryBagsWaist;                     // 0x06F0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryBoots;                         // 0x06F8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryBootsAssault;                  // 0x0700 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryBootsHiking;                   // 0x0708 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryClothing;                      // 0x0710 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryGloves;                        // 0x0718 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwear;                      // 0x0720 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearBalaclava;             // 0x0728 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearCaps;                  // 0x0730 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearGasMasks;              // 0x0738 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryHeadwearGoggles;               // 0x0740 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryHelmets;                       // 0x0748 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryHolsters;                      // 0x0750 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryPants;                         // 0x0758 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsCargo;                    // 0x0760 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsGhillie;                  // 0x0768 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsShorts;                   // 0x0770 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryPantsTactical;                 // 0x0778 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryScarfs;                        // 0x0780 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryTops;                          // 0x0788 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsGhillies;                  // 0x0790 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsJackets;                   // 0x0798 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsShirts;                    // 0x07A0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMilitaryTopsSweaters;                  // 0x07A8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMines;                                 // 0x07B0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMiscellaneous;                         // 0x07B8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMOtorbikes;                            // 0x07C0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMotorboats;                            // 0x07C8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnMountainBike;                          // 0x07D0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnPesticides;                            // 0x07D8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnPiercing;                              // 0x07E0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnPoliceVests;                           // 0x07E8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnQuivers;                               // 0x07F0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnRafts;                                 // 0x07F8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnRagerParts;                            // 0x0800 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnRails;                                 // 0x0808 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnRangedWeapons;                         // 0x0810 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnRifles;                                // 0x0818 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnRISParts;                              // 0x0820 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnSales;                                 // 0x0828 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnScopes;                                // 0x0830 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnSeeds;                                 // 0x0838 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnServices;                              // 0x0840 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnShotguns;                              // 0x0848 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnSights;                                // 0x0850 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnSMGs;                                  // 0x0858 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnStabproofVests;                        // 0x0860 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnStorage;                               // 0x0868 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnSUP;                                   // 0x0870 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnSuppressors;                           // 0x0878 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnTacticalVests;                         // 0x0880 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnTools;                                 // 0x0888 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnToolsFishing;                          // 0x0890 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnToolsLockpicking;                      // 0x0898 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnToolsRepair;                           // 0x08A0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnToolsRepairOther;                      // 0x08A8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnToolsRepairVehicle;                    // 0x08B0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnTractorParts;                          // 0x08B8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnTwoWheels;                             // 0x08C0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnVests;                                 // 0x08C8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnVintageHelmets;                        // 0x08D0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnWeaponAccessories;                     // 0x08D8 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnWeaponParts;                           // 0x08E0 (size: 0x8)
    class UUI_Trader_ItemCategoryButton_C* _btnWolfsWagenParts;                       // 0x08E8 (size: 0x8)
    class UWrapBox* _cat2wdVehicles;                                                  // 0x08F0 (size: 0x8)
    class UWrapBox* _cat4wdVehicles;                                                  // 0x08F8 (size: 0x8)
    class UWrapBox* _catAmmo;                                                         // 0x0900 (size: 0x8)
    class UWrapBox* _catArmor;                                                        // 0x0908 (size: 0x8)
    class UWrapBox* _catArmorHelmets;                                                 // 0x0910 (size: 0x8)
    class UWrapBox* _catArmorVests;                                                   // 0x0918 (size: 0x8)
    class UWrapBox* _catBicycles;                                                     // 0x0920 (size: 0x8)
    class UWrapBox* _catClothing;                                                     // 0x0928 (size: 0x8)
    class UWrapBox* _catClothingCivilian;                                             // 0x0930 (size: 0x8)
    class UWrapBox* _catClothingCivilianHeadwear;                                     // 0x0938 (size: 0x8)
    class UWrapBox* _catClothingCivilianPants;                                        // 0x0940 (size: 0x8)
    class UWrapBox* _catClothingCivilianTops;                                         // 0x0948 (size: 0x8)
    class UWrapBox* _catClothingMilitary;                                             // 0x0950 (size: 0x8)
    class UWrapBox* _catClothingMilitaryBags;                                         // 0x0958 (size: 0x8)
    class UWrapBox* _catClothingMilitaryBoots;                                        // 0x0960 (size: 0x8)
    class UWrapBox* _catClothingMilitaryHeadwear;                                     // 0x0968 (size: 0x8)
    class UWrapBox* _catClothingMilitaryPants;                                        // 0x0970 (size: 0x8)
    class UWrapBox* _catClothingMilitaryTops;                                         // 0x0978 (size: 0x8)
    class UWrapBox* _catExplosives;                                                   // 0x0980 (size: 0x8)
    class UWrapBox* _catFarming;                                                      // 0x0988 (size: 0x8)
    class UWrapBox* _catFood;                                                         // 0x0990 (size: 0x8)
    class UWrapBox* _catFoodFresh;                                                    // 0x0998 (size: 0x8)
    class UWrapBox* _catMeleeWeapons;                                                 // 0x09A0 (size: 0x8)
    class UWrapBox* _catMotorbikes;                                                   // 0x09A8 (size: 0x8)
    class UWrapBox* _catRangedWeapons;                                                // 0x09B0 (size: 0x8)
    class UWrapBox* _catTools;                                                        // 0x09B8 (size: 0x8)
    class UWrapBox* _catToolsRepair;                                                  // 0x09C0 (size: 0x8)
    class UWrapBox* _catVehiclesAndItems;                                             // 0x09C8 (size: 0x8)
    class UWrapBox* _catWeaponAccessories;                                            // 0x09D0 (size: 0x8)
    class UScrollBox* _mainScrollBox;                                                 // 0x09D8 (size: 0x8)
    class UImage* Image_31;                                                           // 0x09E0 (size: 0x8)

    void Construct();
    void ExecuteUbergraph_UI_Trader_BuyPanel(int32 EntryPoint);
}; // Size: 0x9E8

#endif
