// BlueprintGeneratedClass WoodenWeaponRack.WoodenWeaponRack_C
// Size: 0xc00 (Inherited: 0xbb0)
struct AWoodenWeaponRack_C : ARackItem {
	struct UBoxComponent* Box5; // 0xbb0(0x08)
	struct UItemRackSlotComponent* ItemRackSlot_6; // 0xbb8(0x08)
	struct UBoxComponent* Box4; // 0xbc0(0x08)
	struct UItemRackSlotComponent* ItemRackSlot_5; // 0xbc8(0x08)
	struct UBoxComponent* Box3; // 0xbd0(0x08)
	struct UItemRackSlotComponent* ItemRackSlot_4; // 0xbd8(0x08)
	struct UBoxComponent* Box2; // 0xbe0(0x08)
	struct UItemRackSlotComponent* ItemRackSlot_3; // 0xbe8(0x08)
	struct UBoxComponent* Box1; // 0xbf0(0x08)
	struct UItemRackSlotComponent* ItemRackSlot_2; // 0xbf8(0x08)
};

